{
  "id": "D_kwDOOMDw3M4AfUhE",
  "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20",
  "title": "Multi-Factor Authentication: How do we ensure (and prove) that phishing resistant MFA is enabled for users?",
  "body": "### Context: \r\nAs the FedRAMP PMO drafts the Key Security Indicators, we are very interested in getting this community's ideas for how automated validation could be implemented in different specific cases. In your response, we encourage focusing on the technical specifics. By working through this very specific example in depth, we hope to discover more about how other similar questions can be addressed. \r\n\r\n## Take the T/F statement: Phishing-resistant MFA is enabled for all users. \r\n\r\n- How might a small Li-SaaS company report on that statement?\r\n- How could we automate the evaluation of this statement on major platforms right now?\r\n    - GCP, Azure, AWS, etc.....\r\n- How do we create processes that allow 3PAOs to verify it?\r\n",
  "author": "kyhu65867",
  "created_at": "2025-04-16T16:42:57Z",
  "comments": [
    {
      "id": "DC_kwDOOMDw3M4AxLVa",
      "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20#discussioncomment-12891482",
      "body": "I'm thinking about a unified CSP  neutral approach for MFA validation High‑Level Workflow\r\n\r\nSo, a single, cloud‑agnostic framework which can automatically verify phishing‑resistant MFA across AWS, Azure, and GCP by using lightweight connectors to collect each user’s MFA methods, normalizing the data, applying a unified compliance rule, and recording cryptographic proofs in an immutable ledger. This approach delivers a repeatable, auditable workflow that small SaaS teams can deploy quickly and 3PAOs can effortlessly verify without bespoke scripts or manual checks.\r\n\r\n\r\n   a. Provider Adapter  \r\n      • For each cloud (AWS, Azure, GCP), implement a small connector that:\r\n        – Enumerates every interactive user account\r\n        – Retrieves that user’s registered MFA methods\r\n        – Outputs a uniform list of entries in the form:\r\n            cloud: <provider>\r\n            userId: <user identifier>\r\n            methods: [list of registered methods]\r\n   b. Normalization & Rule Evaluation  \r\n      • Merge all connector outputs into one unified list  \r\n      • Apply a single compliance rule:\r\n        – Allowed Methods = hardware‑based second factors only (for example: FIDO2, security‑key, OATH‑token)\r\n        – Mark each user as Compliant if at least one allowed method is present; otherwise mark as Non‑Compliant  \r\n   c. Consolidation & Reporting  \r\n      • Dashboard Summary shows:\r\n          Total Users:       <number>\r\n          Compliant:         <number>\r\n          Non‑Compliant:     <number>\r\n          Statement Result:  TRUE or FALSE  \r\n      • Drill‑down Table lists every Non‑Compliant user with their cloud and missing methods  \r\n   d. Immutable Evidence  \r\n      • Package raw connector outputs together with the normalized compliance results  \r\n      • Compute a cryptographic hash (e.g. SHA‑256) of that package and record it, with timestamp, in a ledger system (such as QLDB)  \r\n      • Store the full package in long‑term object storage (S3, Blob, GCS) for auditor retrieval  \r\n   e. 3PAO Verification  \r\n      • Auditor downloads the stored package and reads the ledger proof  \r\n      • Auditor recomputes the hash locally and confirms it matches the ledger entry  \r\n      • Auditor can spot‑check raw connector data to confirm correct classification  \r\n      • Auditor can rerun the same connector code against a test snapshot to reproduce results\r\n\r\n2. Connector Responsibilities by Cloud\r\n   AWS\r\n     List Users            -> IAM ListUsers\r\n     Fetch MFA Methods     -> IAM ListMFADevices\r\n     PR‑MFA Criteria       -> Hardware tokens (U2F, WebAuthn)\r\n   Azure\r\n     List Users            -> Microsoft Graph API: /users\r\n     Fetch MFA Methods     -> Microsoft Graph API: /authentication/methods\r\n     PR‑MFA Criteria       -> FIDO2 or hardware OATH tokens\r\n   GCP\r\n     List Users            -> Cloud Identity list‑users\r\n     Fetch MFA Methods     -> 2FA Settings API\r\n     PR‑MFA Criteria       -> Hardware security keys (Titan, YubiKey)\r\n\r\n3. Sample KSI Definition\r\n   Identifier            : KSI‑PRMFA‑01\r\n   Name                  : Phishing‑Resistant MFA Enforcement\r\n   Description           : All interactive user principals must have at least one hardware‑based, phishing‑resistant second factor.\r\n   Evaluation Steps      :\r\n     1. Run each cloud connector to gather userId → methods list\r\n     2. Normalize combined data into a single list\r\n     3. Apply the rule: methods intersect {FIDO2, SECURITY_KEY, OATH_TOKEN} must be non‑empty\r\n     4. Classify each user as Compliant or Non‑Compliant\r\n   Automation Frequency  : Hourly or on‑demand\r\n   Evidence Artifacts     :\r\n     – Raw connector output files\r\n     – Normalized compliance results\r\n     – Ledger proof hash with timestamp\r\n   3PAO Verification     :\r\n     – Verify hash matches ledger record\r\n     – Review raw connector outputs\r\n     – Replay scan process with the same connector code\r\n\r\n4. Benefits of This Approach\r\n   • Cloud‑Agnostic: A single evaluation engine serves every provider; adding new clouds requires only a lightweight connector  \r\n   • Fully Automatable: No manual steps; scheduled or on‑demand scans produce reliable, consistent results with audit trail  \r\n   • Verifiable: Auditors receive both raw data and cryptographic proof in one package, simplifying independent verification  \r\n   • Extensible: The same pattern scales to any future Key Security Indicator by adjusting connector logic and rule definitions  \r\n\r\nCollin Hogue-Spears (Cloudera)",
      "author": "CKHogueSpears",
      "created_at": "2025-04-20T16:45:15Z",
      "replies": [
        {
          "id": "DC_kwDOOMDw3M4AxNbA",
          "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20#discussioncomment-12900032",
          "body": "Thanks @DragonHorse2019. This is a really well thought out framework.  Two thoughts I would love to see feedback on:\r\n\r\n1. I think the criteria here should not just be that a strong MFA method is available, but that no other methods are supported.  I.E. if you have support for FIDO2 but also allow username/password that is not going to work. The problem is there can be an almost infinite number of non-compliant options...\r\n\r\n2. Somewhat related is the use of external Identity Management Solutions.  The MFA requirement expands beyond backend access in many cases to include administrative accounts with access through a web interface. One thing I like about your idea is that it could be expanded pretty easily to include Identity providers like OKTA or ID.me. But this expands the list of authentication methods and requires some kind of auditing to determine which meet the criteria. \r\n\r\nVery interested to see your feedback and input form others on this idea.",
          "author": "dan-fedramp",
          "created_at": "2025-04-21T15:42:00Z"
        },
        {
          "id": "DC_kwDOOMDw3M4AxNjl",
          "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20#discussioncomment-12900581",
          "body": "I concur with Dan on some of the finer grained points, but I'm very excited to see the thought you've put into this, and can totally see this having a short runway to liftoff!! \r\n\r\nI particularly like this part: \r\n\r\n> • Dashboard Summary shows:\r\nTotal Users:\r\nCompliant:\r\nNon‑Compliant:\r\nStatement Result: TRUE or FALSE\r\n\r\nJust a True/False indication on a statement may not be enough information for certain parties, so that additional data of the users and a count of the users that do versus do not use MFA is a great start towards drilling down into the specifics! A couple of my perspectives: \r\n\r\n- Some user accounts carry more risk than others. It might be worth distinguishing between privileged accounts versus your run-of-the-mill users and \"weigh\" the privileged accounts more. \r\n- In order for the statement to be true, there is already an implicit assumption that all user accounts have MFA enabled. Is there more information that could be gathered to determine whether anyone goes above and beyond this statement? Maybe certain methods for MFA are better than others? Ultimately, our end goal is to be able to score some of these metrics, so being able to identify the \"A+\" implementations versus the \"B-\" ones would be cool (although this case might be too cut and dry for that sort of granularity). ",
          "author": "kyhu65867",
          "created_at": "2025-04-21T16:39:12Z"
        },
        {
          "id": "DC_kwDOOMDw3M4AxidJ",
          "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20#discussioncomment-12986185",
          "body": "Great work @DragonHorse2019! I agree with @dan-fedramp's comments on both points. \r\n1. The challenge of showing not just one compliant option in place but showing that no other non-compliant method is supported will likely crop up in many KSIs related to access.  \r\n\r\n2. For an external IdP, I think the process would look something like this. \r\nExample scenario: AWS GovCloud with Okta Gov High IdP\r\n- A. Pull Identity Providers from IAM via AWS API (Issuer URL, SSO service location, etc) \r\n-- [aws iam list-saml-providers](https://docs.aws.amazon.com/cli/latest/reference/iam/list-saml-providers.html)\r\n-- [aws iam list-open-id-connect-providers](https://docs.aws.amazon.com/cli/latest/reference/iam/list-open-id-connect-providers.html)\r\n\r\n- B. Verify external IdP is only Identity Source via AWS API (eg: no manual IAM users unaccounted for) \r\n-- [list-groups](https://docs.aws.amazon.com/cli/latest/reference/identitystore/list-groups.html)\r\n-- [list-users](https://docs.aws.amazon.com/cli/latest/reference/identitystore/list-users.html) \r\n-- etc.\r\n\r\n- C. Pull Okta application list and correlate authentication policies with application (AWS) via Okta API \r\n\r\n- D. Pull Okta authenticator enrollment policy and rules for that application via Okta API (looking for phishing resistant MFA required in authenticator enrollment policy and rules)\r\n-- [authenticator enrollment policy](https://developer.okta.com/docs/concepts/policies/#authenticator-enrollment-policies)\r\n \r\n- E. For assurance, an auditor could run a policy simulation via the Okta API to validate that phishing resistant MFA is enforced (looking for a 200 or 403 response depending on input) \r\n-- [Okta API: /api/v1/policies/simulate](https://developer.okta.com/docs/api/openapi/okta-management/management/tag/Policy/#tag/Policy/operation/createPolicySimulation)\r\n\r\nThis is specific to AWS & Okta but a similar process would likely apply to other Cloud/IdP relationships. \r\n\r\nIsaac Teuscher (Paramify)",
          "author": "iteuscher",
          "created_at": "2025-04-29T22:21:29Z"
        },
        {
          "id": "DC_kwDOOMDw3M4Axm9H",
          "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20#discussioncomment-13004615",
          "body": "> 1. I think the criteria here should not just be that a strong MFA method is available, but that no other methods are supported.  I.E. if you have support for FIDO2 but also allow username/password that is not going to work. The problem is there can be an almost infinite number of non-compliant options...\r\n\r\nGiven this requirement (I'd agree to that), wouldn't a desirable goal be to produce evidence that has little to no logs of users successfully logging in across environment(s) without minimally required strong MFA?\r\n\r\n> Just a True/False indication on a statement may not be enough information for certain parties, so that additional data of the users and a count of the users that do versus do not use MFA is a great start towards drilling down into the specifics!\r\n\r\nI get this impression as well, so I'd be curious if my proposed measurement is actually getting towards what we want to know quantitatively, because qualitatively true/false doesn't tell the story. Thoughts?",
          "author": "aj-stein-gsa",
          "created_at": "2025-05-01T14:10:28Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOMDw3M4AxNmt",
      "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20#discussioncomment-12900781",
      "body": "In the case of EntraID, we have much of this addressed with [CISA ScubaGear.](https://github.com/cisagov/ScubaGear)  \r\n\r\nI see the spirit of what’s being accomplished here is an automated assessment for IA-8 - Implement replay-resistant authentication mechanisms for access to [Selection (one or more): privileged accounts; non-privileged accounts]\r\n\r\nIn this case, support for phishing resistant without an evaluation of other signals on its own is an incomplete assessment of an IdP.  It’s the aggregate of the tests (available in CISA ScubaGear) that would help us automate an audit.\r\n\r\nThe following would be a reasonable mapping of automated tests for IA-8.  Credit @aiden78sherry for the mapping.\r\n|ScuBA Mapping|Reasoning|\r\n|------------|------------|\r\n|MS.AAD.1.1v1|Weak \"legacy\" authenticators are blocked. Policy forces users to use stronger authentication methods.|\r\n|MS.AAD.3.1v1|Phishing resistant MFA is enforced which is a replay resistant method of authentication.|\r\n|MS.AAD.3.3v1|If phishing resistant MFA is not enforced, and Microsoft authenticator is being used, which is replay attack resistant, then login context will be shown.|\r\n|MS.AAD.3.5v1|SMS, voice call, and email OTP are the weakest authenticators. This policy forces users to use stronger MFA methods.|\r\n|MS.AAD.3.6v1|Phishing resistant MFA is enforced for privileged roles which is a replay resistant method of authentication.|\r\n|MS.AAD.3.8v1|Managed devices are required to use MFA, which is a replay resistant method of authentication.|",
      "author": "pjavan",
      "created_at": "2025-04-21T17:03:53Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOMDw3M4AxUcq",
      "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20#discussioncomment-12928810",
      "body": "Based on this great feedback, I was thinking about a ScubaGear three-step model (PowerShell data pull → OPA/Rego evaluation → HTML / JSON report). ​\r\n\r\nConnector parity – the same Rego policies can ingest data from AWS IAM, Azure / Entra ID, GCP Cloud Identity, and Okta, all producing the standard ScubaGear-style JSON.\r\n\r\nFail-closed logic – the statement flips to FALSE if any legacy factor (SMS, voice, e-mail OTP, app-TOTP, password-only) remains allowed, even when FIDO2 is present. ​Multi-Factor Authentication, etc.\r\n\r\nPrivileged weighting – accounts mapped to admin, PIM-elevated, or root roles carry a 10× multiplier, so a single risky admin overrides thousands of ordinary users....still thinking about this, maybe that is too much.\r\n\r\nTamper-evident evidence – raw connector JSON, the OPA decision, and a SHA-256 digest are sealed in an append-only ledger.\r\n\r\nI guess we can also ...\r\n• Upstream an IA-8 “Phishing-Resistant MFA” Rego policy to ScubaGear and keep the multi-cloud connectors in a companion repo.\r\n• Map that policy to KSI-PRMFA-01 so DevOps teams can run it in their IaC pipelines and surface pass/fail results via the JSON /metrics endpoint.  Something like that...\r\n\r\nAny objections before I open a draft PR, or suggestions on additional IdPs/tests to prioritise?\r\nOne final thought: would auditors benefit if every evidence package also included a lightweight OSCAL Component Definition export?",
      "author": "CKHogueSpears",
      "created_at": "2025-04-24T00:17:49Z",
      "replies": [
        {
          "id": "DC_kwDOOMDw3M4AxXAQ",
          "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20#discussioncomment-12939280",
          "body": "I'm super excited to see this PR! ",
          "author": "kyhu65867",
          "created_at": "2025-04-24T19:35:04Z"
        },
        {
          "id": "DC_kwDOOMDw3M4AxlN9",
          "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20#discussioncomment-12997501",
          "body": "> would auditors benefit if every evidence package also included a lightweight OSCAL Component Definition\r\n\r\nyou could put evidence in the [SAR model results list ](https://pages.nist.gov/OSCAL-Reference/models/v1.1.3/assessment-results/json-reference/#/assessment-results/results)- that's where evidence should go\r\n\r\nIf I tweak your question to: should I include the evidence gathering tool(s) in a component definition - I'd say yes since it can then go into [the SAP components list](https://pages.nist.gov/OSCAL-Reference/models/v1.1.3/assessment-plan/json-reference/#/assessment-plan/assessment-assets/components)!\r\n\r\n",
          "author": "sunstonesecure-robert",
          "created_at": "2025-04-30T18:27:06Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOMDw3M4Axlf2",
      "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20#discussioncomment-12998646",
      "body": "It's pretty simple in Okta:\r\n\r\n```\r\n# Get MFA enrollment policies\r\ncurl -s -X GET \\\r\n  -H \"Authorization: SSWS ${OKTA_API_TOKEN}\" \\\r\n  -H \"Accept: application/json\" \\\r\n  \"https://${OKTA_DOMAIN}/api/v1/policies?type=MFA_ENROLL\" | jq > mfa_enrollment_policies.json\r\n\r\n# Get FIDO2 authenticator configuration\r\ncurl -s -X GET \\\r\n  -H \"Authorization: SSWS ${OKTA_API_TOKEN}\" \\\r\n  -H \"Accept: application/json\" \\\r\n  \"https://${OKTA_DOMAIN}/api/v1/authenticators\" | jq > authenticators.json\r\n```\r\n\r\nI made a full script for this a bit ago. Updated today for FedRAMP 20x KSIs today: https://github.com/ethanolivertroy/okta-audit/tree/Fedramp-20x\r\n",
      "author": "ethanolivertroy",
      "created_at": "2025-04-30T20:58:35Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOMDw3M4Ax9Pb",
      "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/20#discussioncomment-13095899",
      "body": "Enabled is not enforced.   Enabled means it is available to a user to engage. Enforced removes the users' choice and forces them to use MFA.  From a security perspective, our default policy should be enforced with Enabled being the exception and hence, a risk analysis performed.  ",
      "author": "Christcpd",
      "created_at": "2025-05-09T21:12:33Z",
      "replies": []
    }
  ]
}