{
  "id": "D_kwDOOMDw3M4Afbw8",
  "url": "https://github.com/FedRAMP/automating-assessment-cwg/discussions/22",
  "title": "Key Security Indicators, Pilot Launch, and More",
  "body": "Hi everyone! \r\nWe've been very busy at FedRAMP over the last couple of weeks, and I wanted to draw your attention to two recent developments that pertain directly to this working group.\r\n\r\n## Draft Key Security Indicators Released!\r\nWe talk a lot about Key Security Indicators in this CWG, so I'm sure many of you will be interested in reading our [Draft Standard for KSIs](https://www.fedramp.gov/rfcs/0006/). As a reminder, formal feedback should be submitted via the official RFC process, but we welcome any and all discussion related to Key Security Indicators here as well!\r\n\r\n## FedRAMP 20x Phase One Pilot Announced!\r\nAdditionally, FedRAMP just announced a [Phase One Pilot](https://www.fedramp.gov/20x/phase-one/), open to the public, which will test a new approach to a FedRAMP Low authorization.\r\n\r\nThis discussions page, specifically under the category [\"20x Phase One Pilot\"](https://github.com/FedRAMP/automating-assessment-cwg/discussions/categories/20x-phase-one-pilot), will be a central place to discuss ideas and get feedback from the FedRAMP PMO and the larger community. \r\n\r\nSince this is an open pilot, there is no need to fill out an interest form-- cloud service providers interested in participating should prepare materials in collaboration with PaaS/IaaS providers and 3PAOs to submit to FedRAMP after the RFC for the Key Security Indicators closes. Materials will be reviewed in the order they are received. \r\n\r\n## More\r\nWe released [two other draft standards](https://www.fedramp.gov/updates/rfcs/) for RFC alongside the Key Security Indicators. If you want to see what else we've been up to, check out our [most recent blog post](https://www.fedramp.gov/2025-04-24-fedramp-20x-one-month-in-and-moving-fast/), \r\n\r\n",
  "author": "kyhu65867",
  "created_at": "2025-04-24T19:27:16Z",
  "comments": []
}