{
  "id": "D_kwDOOKttEc4AfAlb",
  "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13",
  "title": "Applying Bayes' Theorem to quantify cloud security risk",
  "body": "Here is an interesting [write up](https://stephenshaffer.io/learning-how-to-quantify-risk-using-bayes-ddcd439d12f2) on how to apply Bayes' Theorem in AWS",
  "author": "sam-aydlette",
  "created_at": "2025-03-25T20:05:59Z",
  "comments": [
    {
      "id": "DC_kwDOOKttEc4AwTT7",
      "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12662011",
      "body": "@sam-aydlette, I have a weekend project to investigate this idea. Let's keep this one in the forefront. I've been socializing it around my circles, and my group thinks it's a good idea, but we are working on the practicality of it for possibly fringe cases where context is needed. ",
      "author": "chrisjohnson1",
      "created_at": "2025-03-29T12:55:24Z",
      "replies": [
        {
          "id": "DC_kwDOOKttEc4AwVPD",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12669891",
          "body": ">  but we are working on the practicality of it for possibly fringe cases where context is needed.\r\n\r\nI'd love to read more in the coming days about what fringe cases and context you mean and how they are inputs into this approach. 😄 \r\n",
          "author": "aj-stein-gsa",
          "created_at": "2025-03-30T21:33:35Z"
        },
        {
          "id": "DC_kwDOOKttEc4AwVVo",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12670312",
          "body": "For sure, @aj-stein-gsa! My automated Bayesian approach uses LLMs to establish a valuable baseline risk analysis, generally assuming a \"typical, moderately secure\" environment. The need for specific context arises in \"fringe cases\" where an organization significantly deviates from that baseline – for example, through their actual choices for organization-defined parameters (like AC-1 review frequency or SI-2 patch times), the specifics of their technical implementations (e.g., SC-13 crypto choices or IA-5(7) code scanning rigor), unique supply chain dependencies (SR-11/SR-12 vendor realities), or even their operational culture. This context is crucial because it directly informs the actual control effectiveness probabilities (like `P(B)` or `P(B|A))`, allowing refinement of the LLM's initial estimates and highlighting why human oversight remains essential to ensure the final risk assessment accurately reflects the specific environment.",
          "author": "chrisjohnson1",
          "created_at": "2025-03-30T23:47:20Z"
        },
        {
          "id": "DC_kwDOOKttEc4AwVWo",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12670376",
          "body": "OK, I am curious to read more because measuring the risk of unauthorized access due to properly or improperly configured AWS security groups, per the original article, seems much more approachable to me. Modeling the \"labels\" to an example typical, moderately secure system re control goals and their consequences I think I understand qualitatively. However, it's harder for me to get rooted in these quantitative methods.\r\n\r\nSo, we look forward to reading more!",
          "author": "aj-stein-gsa",
          "created_at": "2025-03-31T00:12:50Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOKttEc4AwUvM",
      "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12667852",
      "body": "Hi Team!\r\n\r\nMy preliminary results are in, and the outcome exceeds expectations. I'm working my way through the entire result set at a much more granular level, but I'll post back here tonight with the results of my findings.  \r\n\r\nIt's all very exciting!",
      "author": "chrisjohnson1",
      "created_at": "2025-03-30T14:39:28Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOKttEc4AwVf-",
      "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12670974",
      "body": "Hi Team,\r\n\r\nIn the spirit of ultimate transparency, I have made the repo that holds the code for this project public for the community's review and contribution. Please review [the repository](https://github.com/Knox-Gov/nist_bayes_risk_auto) and let me know your thoughts.\r\n\r\nAdditionally, I've attached the results of this code to this thread.\r\n[nist_bayes_analysis.xlsx](https://github.com/user-attachments/files/19528751/nist_bayes_analysis.xlsx)\r\n\r\nLastly, this is in line with a larger idea we have regarding an immutable ledger when it comes to reporting metrics to an aggregator, as Pete mentioned in the FedRamp 20x program announcement. ",
      "author": "chrisjohnson1",
      "created_at": "2025-03-31T02:11:04Z",
      "replies": [
        {
          "id": "DC_kwDOOKttEc4AwVh5",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12671097",
          "body": "FYI, in the Excel document, my custom formulas weren't exported from Google Sheets.  The formula is the following:\r\n```excel\r\n=IFS( NOT(ISNUMBER([@[Posterior Probability P(A|B)]])), \r\n\"Error/NA\", [@[Posterior Probability P(A|B)]] >= 0.4, \"Critical\", \r\n[@[Posterior Probability P(A|B)]] >= 0.15, \"High\", \r\n[@[Posterior Probability P(A|B)]] >= 0.02, \"Medium\", \r\nTRUE, \"Low\" )\r\n```",
          "author": "chrisjohnson1",
          "created_at": "2025-03-31T02:34:37Z"
        },
        {
          "id": "DC_kwDOOKttEc4AwWmh",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12675489",
          "body": "This is really interesting @chrisjohnson1, thank you! A few clarifying questions. First, using this approach who in your mind would be responsible for owning the Bedrock instance (or equivalent) and performing this analysis on the CSV input? Would that be the CSP whose data is being analyzed, or the Agency customer? Second, how would the content of the control implementation statement itself be verified? Would it make sense that the content be in quantitative form where possible (i.e., relying on measurable outputs from IAM, vuln scan tools, etc. rather than a human writing a subjective paragraph based on their interpretation)?",
          "author": "sam-aydlette",
          "created_at": "2025-03-31T11:39:19Z"
        },
        {
          "id": "DC_kwDOOKttEc4AwXHd",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12677597",
          "body": "Howdy, @sam-aydlette! The intent is to make this an open-source standard that any CSP can adopt. The analysis can be self-hosted or handled by a SaaS provider—totally flexible, depending on the organization’s preference.\r\n\r\nAs you mentioned, all control content gets quantified using the Bayes Risk score. Our current thinking is that relevant signals (IAM, vuln scans, logs, etc.) get scraped via Prometheus and published to a ledger database. That way, everything is measurable, tamper-evident, and auditable. But unlike public blockchains, this ledger isn’t visible to the world. Access is strictly limited to the parties who need to validate the system's security:\r\n\r\n* The Cloud Service Provider (CSP)\r\n* The consuming Agency(ies)\r\n* The authorized Third-Party Assessors (3PAOs)\r\n\r\n**No one else.** This permissioned ledger is designed for shared trust between verified participants, not public exposure.\r\n\r\nWe’re aiming for full transparency and automation with minimal subjectivity. Here’s the post that outlines the ledger DB piece: https://www.knoxsystems.com/blog/fedramp-ledger-part2\r\n\r\nI would love your take on how we can refine this further or where you'd see pitfalls.",
          "author": "chrisjohnson1",
          "created_at": "2025-03-31T14:49:07Z"
        },
        {
          "id": "DC_kwDOOKttEc4AwaBO",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12689486",
          "body": "@sam-aydlette, I am following up with you on your thoughts on the above, with the addition of LLRs. I know there is a lot to unpack here, and I'm happy to answer any questions you may have. ",
          "author": "chrisjohnson1",
          "created_at": "2025-04-01T14:20:48Z"
        },
        {
          "id": "DC_kwDOOKttEc4Awalu",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12691822",
          "body": "@chrisjohnson1 the purpose of this forum is to let stakeholders collaborate with us and hear their views, so I am not going to offer any value judgment on the work itself. But I'm very interested to see what other folks think!",
          "author": "sam-aydlette",
          "created_at": "2025-04-01T18:01:42Z"
        },
        {
          "id": "DC_kwDOOKttEc4Awapn",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12692071",
          "body": "@sam-aydlette, 100%! I am looking forward to others' input, too!",
          "author": "chrisjohnson1",
          "created_at": "2025-04-01T18:28:33Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOKttEc4Awy-d",
      "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-12791709",
      "body": "In the spirit of leaning on previous efforts to create prior probability, I would like the community's opinion on incorporating the [Thread-Based Risk Profiling Methodology, developed by the GSA FedRAMP PMO on 02/15/2022](https://www.fedramp.gov/assets/resources/documents/Threat-Based_Risk_Profiling_Methodology.pdf).\r\n\r\nEveryone's input would be incredibly valuable for this effort. ",
      "author": "chrisjohnson1",
      "created_at": "2025-04-10T13:15:10Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOKttEc4AxyWg",
      "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/13#discussioncomment-13051296",
      "body": "It was really good to see engagement on this post last month. We are going to close this post to commenting for now. If you commented or came across this thread and had other thoughts about relevant work on risk quantification as it pertains to continuous reporting, feel free to follow up in https://github.com/FedRAMP/continuous-reporting-cwg/discussions/39.",
      "author": "aj-stein-gsa",
      "created_at": "2025-05-06T14:46:54Z",
      "replies": []
    }
  ]
}