{
  "id": "D_kwDOOKttEc4AfI1A",
  "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26",
  "title": "Ideas for most efficient reporting mechanism",
  "body": "What are folks ideas on the the ideal way for agencies to consume continuous reporting for the CSOs they are leveraging? E.g., customer accessible CSP managed dashboard, API integration, etc. Does it make sense to create standard API specifications that agencies can use to integrate CSO reporting with their own tooling (EMASS, CSAM, etc.)? Would it make more sense to align on reporting metrics on the FedRAMP Marketplace itself? All ideas are welcome...",
  "author": "sam-aydlette",
  "created_at": "2025-04-03T13:32:35Z",
  "comments": [
    {
      "id": "DC_kwDOOKttEc4AwgGg",
      "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-12714400",
      "body": "Currently, reporting in the current state (for FedRAMP ConMon anyway, but this CWG looks forward to the future 😄 ) means periodic bulk submission of data all at once. Do people have strong opinions on \"submitting data all at once\" approach (even if more frequent), or would rather it can be broken into smaller submissions and bunched up later?",
      "author": "aj-stein-gsa",
      "created_at": "2025-04-03T14:12:45Z",
      "replies": [
        {
          "id": "DC_kwDOOKttEc4Aw9OU",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-12833684",
          "body": "As a CSP we have plenty of automation that collects machine readable security posture information from our systems.  Examples include: security configuration, baseline alignment, vulnerabilities, components, etc.  We pull and store this data as machine readable JSON and then execute secondary processing against the data to identify trends, resolve issues, and ensure our security posture is maintained.\r\n\r\nIf FedRAMP provided a desired input schema (JSON, CSV, XML, YAML, etc) and an API endpoint that we could ship this data to, with an expected cadence (e.g. daily, weekly, monthly) we would readily deliver this.",
          "author": "gponto",
          "created_at": "2025-04-14T19:50:57Z"
        },
        {
          "id": "DC_kwDOOKttEc4AxzSP",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13055119",
          "body": "> As a CSP we have plenty of automation that collects machine readable security posture information from our systems. Examples include: security configuration, baseline alignment, vulnerabilities, components, etc. We pull and store this data as machine readable JSON and then execute secondary processing against the data to identify trends, resolve issues, and ensure our security posture is maintained.\r\n\r\nAnd how do you provide the data or visualize metrics to internal stakeholders as a result? How about external stakeholders, such as customers or possible customers, if so? Is there a permanent location? Ad-hoc data reports or more permanent \"queries\" (monthly trend of vulnerabilities in system) that are static and do not change or something more dynamic or flexible?\r\n \r\n> If FedRAMP provided a desired input schema (JSON, CSV, XML, YAML, etc) and an API endpoint that we could ship this data to, with an expected cadence (e.g. daily, weekly, monthly) we would readily deliver this.\r\n\r\nI definitely understand that concern. Just to be fair (and I work closely with the [Automating Assessment CWG](https://github.com/FedRAMP/automating-assessment-cwg/discussions) in that regard, feel free to post here, there, or crosspost), at this early stage of the [newly announced pilot](https://www.fedramp.gov/20x/phase-one/), the goal is FedRAMP _not explicitly specify_ our requirements and preferences. You come to use with your preferred architecture and approaches and we hear you out. We will not bias you with decisions in that regard, we have not made any yet and may not for a long time, if at all.",
          "author": "aj-stein-gsa",
          "created_at": "2025-05-06T21:39:57Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOKttEc4AwzxK",
      "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-12794954",
      "body": "I replied to another Discussion that kind of addressed this as well. I suggest an online Dashboard, CSP specific, will simple workflow engine to orchestrate the ATO process. The CSP Dashboard contains the results of KSI metrics (presentation of which is in a Control Domain perspective - not every nitty-gritty NIST Rev5 control). A shift to a Control Domain presentation of results has significant advantages in simplifying and streamlining the presentation of results. \r\n\r\nI agree that an API should be considered to make it easier for the Agency as well, not just the CSP, and potentially aligning eMASS to a new shift to a Control Domain presentation of results would I suspect make everyone using eMASS cheer with great joy. :-)\r\n\r\nI like the FedRAMP Marketplace idea, but build it out to see the CSP Dashboard, and perhaps automate the authorization process via a simple workflow engine. ",
      "author": "JosephScarzone",
      "created_at": "2025-04-10T17:56:26Z",
      "replies": [
        {
          "id": "DC_kwDOOKttEc4Aw9Qg",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-12833824",
          "body": "As mentioned here: https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-12833684 we (a CSP) would readily send our security posture data to a FedRAMP API and would love to see that ingested and returned as a dashboard that we could use to report our security posture to Agencies, Auditors, and even our customers.",
          "author": "gponto",
          "created_at": "2025-04-14T20:07:57Z"
        },
        {
          "id": "DC_kwDOOKttEc4Ax5So",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13079720",
          "body": "While there may be some agencies that would prefer to use a CSP built (as a compromise I would prefer FedRAMP owned over a CSP), my agency would prefer to fully ingest the CSP data and integrate it into our existing security/risk posture dashboard. We are capable of daily ingest which would be a significant improvement over the current stale monthly conmon updates. Consistent visibility should be a minimum for continuous reporting, especially if we are moving towards full ongoing authorization (either CSP or agency based) of information systems. ",
          "author": "TWeikle",
          "created_at": "2025-05-08T18:19:53Z"
        },
        {
          "id": "DC_kwDOOKttEc4Ax5gJ",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13080585",
          "body": "> As mentioned here: [#26 (reply in thread)](https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-12833684) we (a CSP) would readily send our security posture data to a FedRAMP API \r\n\r\nWhat if FedRAMP consumed APIs from one or more CSPs?\r\n\r\n>  would love to see that ingested and returned as a dashboard that we could use to report our security posture to Agencies, Auditors, and even our customers.\r\n\r\nDo you have such a dashboard today? If so, what does it look like?",
          "author": "aj-stein-gsa",
          "created_at": "2025-05-08T20:21:23Z"
        },
        {
          "id": "DC_kwDOOKttEc4Ax5gW",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13080598",
          "body": "Hi, @TWeikle, thanks for starting to contribute here. 👋 \r\n\r\n> While there may be some agencies that would prefer to use a CSP built (as a compromise I would prefer FedRAMP owned over a CSP), my agency would prefer to fully ingest the CSP data and integrate it into our existing security/risk posture dashboard.\r\n\r\nInteresting, can you explain more about that preference and your other compromise option?\r\n\r\n> We are capable of daily ingest which would be a significant improvement over the current stale monthly conmon updates. Consistent visibility should be a minimum for continuous reporting, especially if we are moving towards full ongoing authorization (either CSP or agency based) of information systems.\r\n\r\nCan you explain more what you are capable of ingesting more frequently than monthly? And if so, how you are able to do it more frequently? I am happy to get more of an agency perspective here, thanks for providing your take.",
          "author": "aj-stein-gsa",
          "created_at": "2025-05-08T20:23:28Z"
        },
        {
          "id": "DC_kwDOOKttEc4Ax5iP",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13080719",
          "body": "> Interesting, can you explain more about that preference and your other compromise option?\r\n\r\nI believe leveraging the marketplace as a means for consolidating information is beneficial. Otherwise, we'll need to navigate to hundreds of different CSP sites to view various types of dashboards. Standardization is preferable, and having one central location makes reviewing and selection easier. Even if we were to put this information behind a portal, limiting access to federal employees (but not to the same extent as package by package access in the current process), would be my preferred compromise if direct ingestion isn't viable. \r\n\r\nObviously, ingestion to our own dashboard would be the preferred avenue, but I would assume that would be only once we've officially established a contract with the vendor, so it might come down to a central PMO owned site for initial review like the marketplace, then internal agency ingestion.\r\n\r\n> Can you explain more what you are capable of ingesting more frequently than monthly? And if so, how you are able to do it more frequently? I am happy to get more of an agency perspective here, thanks for providing your take.\r\n\r\nWe currently collect data from various tools deployed in the environment: vuln scans, end point management, EDR, MDM. We centralize the collection from throughout the agency and then ETL for ingestion. We've also centralized logging, but that hasn't been integrated into our dashboarding tool....yet. We do have custom built dashboards within the SIEM to handle various reviews.\r\n\r\nWhile data ingest occurs each day, we aren't necessarily scanning our full environment each day, it's broken up over time and reports in following scans, but we have to meet the BOD so it's certainly every week at minimum. ETL picks up vuln repositories each day, refreshing any stale data with new data.\r\n\r\nIt is a significant amount of data and the ETL process can be slow, but if were looking at modernization I believe this is a good opportunity to enhance our process and adopt better ways to collect our data.",
          "author": "TWeikle",
          "created_at": "2025-05-08T20:38:46Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOKttEc4Aw799",
      "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-12828541",
      "body": "Just thinking about creating another rubric set. Given that the KSI rating is being introduced and getting some attention, I would think having a second set of principles to measure against would create confusion at this point in time. I could see when there is true automation to have a core, weighted ranking system in place with the ability for a user to pivot within a dashboard to such that an agency might be able to review the same package against their own custom weights and interests. However, I would encourage that for acceptance of a product, the primary set be the deciding factor.",
      "author": "GovRAMP-Fred",
      "created_at": "2025-04-14T12:19:13Z",
      "replies": [
        {
          "id": "DC_kwDOOKttEc4Ax5h5",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13080697",
          "body": "Thanks for the high-level feedback, but do you have any experiences or data around how you would want to see a future state reporting process increase efficiency, @GovRAMP-Fred?",
          "author": "aj-stein-gsa",
          "created_at": "2025-05-08T20:36:54Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOKttEc4AxV7N",
      "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-12934861",
      "body": "On the API-based pipeline that @gponto and others had mentioned, I have the following questions to guide our discussions further:\r\n- How do you think about push (to FedRAMP api endpoints) and pull (giving FedRAMP access to your endpoints to pull data)? Which way is more convenient/cost-effective for you and why?\r\n- For the data schema, what existing schemas/ontologies can be used for our schema engineering?\r\n- What do smaller CSPs think about producing machine-readable reporting data? For example: Will you be able to produce and send those data in a near-realtime fashion? Would starter-codes help you in building such pipeline? etc.",
      "author": "Cybonto",
      "created_at": "2025-04-24T12:33:34Z",
      "replies": [
        {
          "id": "DC_kwDOOKttEc4Axyu2",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13052854",
          "body": "IMHO...Most convenient is push. Keeps it simple and under CSP control. We should be able to do it per a defined frequency or ad-hoc at any time. Being part of a small and innovative company, I see no concerns about producing machine-readable reporting data. We are already doing this anyway internally. Starter-codes could be helpful for many; it's a good idea. ",
          "author": "JosephScarzone",
          "created_at": "2025-05-06T17:04:43Z"
        },
        {
          "id": "DC_kwDOOKttEc4AxyxD",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13052995",
          "body": "> Being part of a small and innovative company, I see no concerns about producing machine-readable reporting data. We are already doing this anyway internally. Starter-codes could be helpful for many; it's a good idea.\r\n\r\nBy way of example, what kind of structured data do you produce? For whom? (e.g. internal operations and security staff? customers? downstream customers?) How do you report it to those people?",
          "author": "aj-stein-gsa",
          "created_at": "2025-05-06T17:20:35Z"
        },
        {
          "id": "DC_kwDOOKttEc4Axy72",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13053686",
          "body": "> IMHO...Most convenient is push. Keeps it simple and under CSP control. We should be able to do it per a defined frequency or ad-hoc at any time. Being part of a small and innovative company, I see no concerns about producing machine-readable reporting data. We are already doing this anyway internally. Starter-codes could be helpful for many; it's a good idea.\r\n\r\nI would second this as well.  Getting into the weeds, we would `POST` a `JSON` payload to a `REST API` authenticated by `OAuth 2.0 Bearer Token` following the App Auth flow.",
          "author": "gponto",
          "created_at": "2025-05-06T18:26:58Z"
        },
        {
          "id": "DC_kwDOOKttEc4Axy-X",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13053847",
          "body": "I think this CWG is more than happy to get deeper into the weeds. 😄 \r\n\r\n> I would second this as well. Getting into the weeds, we would `POST` a `JSON` payload to a `REST API` authenticated by `OAuth 2.0 Bearer Token` following the App Auth flow.\r\n\r\nWhich person or organization is `POST`ing a JSON payload where?",
          "author": "aj-stein-gsa",
          "created_at": "2025-05-06T18:46:49Z"
        },
        {
          "id": "DC_kwDOOKttEc4AxzJh",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13054561",
          "body": "> I think this CWG is more than happy to get deeper into the weeds. 😄\r\n> \r\n> > I would second this as well. Getting into the weeds, we would `POST` a `JSON` payload to a `REST API` authenticated by `OAuth 2.0 Bearer Token` following the App Auth flow.\r\n> \r\n> Which person or organization is `POST`ing a JSON payload where?\r\n\r\nSo presently, our workflow looks like this:\r\n\r\n1. We run CICD pipelines that continuously \"pull\" (HTTP GET/POST) data from various tools (Cloud Service APIs, Scan tools, SIEM, etc.) as machine readable objects (JSON, XML, CSV, etc.)\r\n2. A chained process then \"pushes\" this data (HTTP PUT/POST) to a Data Lake, which is really just a location that can readily ingest semi-structured machine-readable data/files for use by many other downstream processes.\r\n3. As part of this continuous toolchain, we could easily \"push\" (HTTP PUT/POST) any data FedRAMP requires (e.g. all CVE findings) to a REST API.  As far as the schema, I would suggest SARIF (https://docs.oasis-open.org/sarif/sarif/v2.1.0/sarif-v2.1.0.html) which is the industry standard for shipping security scan tool findings to tools like Github Advanced Security without any effort on the part of FedRAMP to build/manage.  See: https://docs.github.com/en/code-security/code-scanning/integrating-with-code-scanning/sarif-support-for-code-scanning\r\n\r\n",
          "author": "gponto",
          "created_at": "2025-05-06T20:20:10Z"
        },
        {
          "id": "DC_kwDOOKttEc4AxzPl",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13054949",
          "body": "> So presently, our workflow looks like this:\r\n> \r\n> 1. We run CICD pipelines that continuously \"pull\" (HTTP GET/POST) data from various tools (Cloud Service APIs, Scan tools, SIEM, etc.) as machine readable objects (JSON, XML, CSV, etc.)\r\n\r\nUnderstood, we work similarly.\r\n\r\n> 2. A chained process then \"pushes\" this data (HTTP PUT/POST) to a Data Lake, which is really just a location that can readily ingest semi-structured machine-readable data/files for use by many other downstream processes.\r\n\r\nThat's nice, we in FedRAMP do not get to use that in production here, but I have evaluated and used it elsewhere; this approach makes sense given 1.\r\n\r\n> 3. As part of this continuous toolchain, we could easily \"push\" (HTTP PUT/POST) any data FedRAMP requires (e.g. all CVE findings) to a REST API.  As far as the schema, I would suggest SARIF (https://docs.oasis-open.org/sarif/sarif/v2.1.0/sarif-v2.1.0.html) which is the industry standard for shipping security scan tool findings to tools like Github Advanced Security without any effort on the part of FedRAMP to build/manage.  See: https://docs.github.com/en/code-security/code-scanning/integrating-with-code-scanning/sarif-support-for-code-scanning\r\n\r\nThanks for the details, this is all good stuff. I do not speak officially, but some of us are already big SARIF fans and encode results that way ourselves in older FedRAMP tooling.\r\n\r\nMore to the point, I am inferring from your message that FedRAMP would host a service with endpoints to upload data, re my original question. Just keep in mind that is not an invariant requirement FedRAMP and this community have settled on; there _may be no APIs hosted by FedRAMP at all_ moving forward.",
          "author": "aj-stein-gsa",
          "created_at": "2025-05-06T21:13:47Z"
        },
        {
          "id": "DC_kwDOOKttEc4AxzQo",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13055016",
          "body": "> Just keep in mind that is not an invariant requirement FedRAMP and this community have settled on; there _may be no APIs hosted by FedRAMP at all_ moving forward.\r\n\r\n@sam-aydlette - Understood on the above caveat.  This is actually why I suggested SARIF because FedRAMP could make available one or more Github repos (perhaps 1:CSP) for us to ship our \"Findings\" into.  Thus FedRAMP would need not host an API, nor build any front end tooling, as all those things are already in place with Github.\r\n\r\n(For the record I do not work for Github, it just serves as a ready example for this Tool --- SARIF ---> Github flow for cataloging CSP issues and automatically remediating them as we continuously ship data.)",
          "author": "gponto",
          "created_at": "2025-05-06T21:24:32Z"
        },
        {
          "id": "DC_kwDOOKttEc4AxzRa",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13055066",
          "body": "> @sam-aydlette - Understood on the above caveat. This is actually why I suggested SARIF because FedRAMP could make available one or more Github repos (perhaps 1:CSP) for us to ship our \"Findings\" into. Thus FedRAMP would need not host an API, nor build any front end tooling, as all those things are already in place with Github.\r\n\r\nThat perspective and framing makes a lot of sense to me, I appreciate you taking the time to find alignment. I have a lot of open questions, in my own mind and for the whole community of us to consider favorable answer(s), about how you wrap and ship that data around and explain it over time. We think that is important context and level setting for this CWG.\r\n \r\n> (For the record I do not work for Github, it just serves as a ready example for this Tool --- SARIF ---> Github flow for cataloging CSP issues and automatically remediating them as we continuously ship data.)\r\n\r\nUnderstood and thanks for clarification. I (maybe obviously) don't work for GitHub either but GSA permits us to use FedRAMP as part of an authorized service in a system boundary for our work in FedRAMP as GSA staff. I was alluding to the fact I co-maintain software that analyzes OSCAL and data defined in other data models to emit findings and debugging information in SARIF. We used it a lot in the (now) obsolete FedRAMP Digital Authorization Package Pilot.\r\n\r\nP.S. As much as I would love to see him @sam-aydlette has left FedRAMP and GSA. He may respond, but he is no longer a facilitator. I do know GitHub tries to auto-complete when you use `@` to ping users based on issue and pull request context, I just know that will not be obvious from what you see in GitHub unless I tell you.",
          "author": "aj-stein-gsa",
          "created_at": "2025-05-06T21:30:52Z"
        },
        {
          "id": "DC_kwDOOKttEc4Ax1eH",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13064071",
          "body": "@aj-stein-gsa Regarding your question to me above, our generative AI platform (Ask Sage) produces roughly 95% of our ConMon package in the formats needed by FedRAMP. We post it in our FedRAMP repository and grant access to FedRAMP and DoD/Agencies as needed. As we are a start-up company, my CEO and I are the only ones who have access to the data internally. Hope that answers your question.\r\n\r\n",
          "author": "JosephScarzone",
          "created_at": "2025-05-07T14:13:14Z"
        },
        {
          "id": "DC_kwDOOKttEc4Ax5gg",
          "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13080608",
          "body": "> @aj-stein-gsa Regarding your question to me above, our generative AI platform (Ask Sage) produces roughly 95% of our ConMon package in the formats needed by FedRAMP. We post it in our FedRAMP repository and grant access to FedRAMP and DoD/Agencies as needed. As we are a start-up company, my CEO and I are the only ones who have access to the data internally. Hope that answers your question.\r\n\r\nSorry I didn't reply sooner, @JosephScarzone, thanks for the follow-up and the transparency. We do appreciate that. Any insights, given this experience, on how to make the reporting process itself more efficient from your end and uploading to a repository? (I know it likely would not be the current FedRAMP-maintained one or even a similar one in the future, but more detail around this would be helpful.)\r\n",
          "author": "aj-stein-gsa",
          "created_at": "2025-05-08T20:24:51Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOKttEc4AyQdT",
      "url": "https://github.com/FedRAMP/continuous-reporting-cwg/discussions/26#discussioncomment-13174611",
      "body": "There has been a lot of good discussion on this topic in the last few weeks, but we are going to close this one for now. We will open up new posts for commenting accordingly around different facets of this topic when the time is right, or you can when it is right for you, fellow community members!",
      "author": "aj-stein-gsa",
      "created_at": "2025-05-16T19:43:14Z",
      "replies": []
    }
  ]
}