{
  "id": "D_kwDOOMfSVs4AfNVG",
  "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/14",
  "title": "ISO: Input from CSPs that pursue FedRAMP before other certifications",
  "body": "One major barrier that [advisors and regulators](https://www.gsa.gov/technology/government-it-initiatives/federal-secure-cloud-advisory-committee/federal-secure-cloud-advisory-committee-meetings) aim to overcome is what the DoD calls the \"[valley of death](https://www.dau.edu/library/damag/january-february2022/valley-death)\": prospective bidders (especially small to medium sized enterprises/SMEs) are unable to obtain a federal procurement contract without a federal-ready and scalable offering, but they are unlikely to develop this offering without (1) a reasonable chance of success at a federal procurement contract and (2) the sustained funding needed to bring it to completion. \r\n\r\nSome CSPs overcome the valley of death by reinvesting profits from a commercial offering into the security improvements and certifications needed for a federal offering. These CSPs might have passed a lengthy commercial cloud audit before even considering the U.S. government as a customer. Allowing these firms to more rapidly obtain FedRAMP (so long as their accreditation meets or exceeds FedRAMP requirements **and** their third-party auditor is a trusted validator) would significantly reduce their bureaucratic burden. Other threads assess whether such an expedited process can or should be applied to firms with GovRAMP/TX-RAMP/a FISMA ATO, so my goal is not to get into that here.\r\n\r\n**In this thread, it would be great to hear from CSPs (and particularly SMEs) that take the reverse approach.** For example, [in this comment](https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/5#discussioncomment-12767575), @dljenkins considers FedRAMP their \"uber control set\" that can be used to meet industry frameworks, and [this comment](https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/5#discussioncomment-12769607) from @osteth states that he's \"never experienced an issue when submitting a FedRAMP security plan to [a] SOC2 assessor.\" \r\n\r\nTo analyze how the application of existing frameworks may impact CSPs who choose to pursue FedRAMP first (or exclusively), I'm curious to know:\r\n1. How common is it for CSPs (and particularly SMEs) to pursue/obtain FedRAMP authorization before industry, GovRAMP, or FISMA certifications? In what contexts is this the most efficient/feasible option?\r\n2. How do these firms cross the \"valley of death\" as illustrated above? \r\n3. If FedRAMP authorization continued to be difficult BUT could be more easily obtained with prior industry/GovRAMP certification under the new process, how would this impact a CSP's decision to pursue FedRAMP first vs. other certifications?\r\n4. Do the various recommendations and proposals across this GitHub (and elsewhere) on how to apply existing mechanisms pose any new considerations for groups that would otherwise pursue FedRAMP first?\r\n\r\nAs I see it, interoperability with existing frameworks would greatly reduce barriers for firms with prior certifications AND those who plan to pursue industry certifications after FedRAMP. However, while I see the valley of death issue addressed regularly in meeting minutes, I don't often hear directly from CSPs who choose FedRAMP as their first line of defense.",
  "author": "cmanningasp",
  "created_at": "2025-04-08T21:53:23Z",
  "comments": [
    {
      "id": "DC_kwDOOMfSVs4AwuTc",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/14#discussioncomment-12772572",
      "body": "To establish a basis for where my input is coming from, I previously worked within a gov organization on a very small team where we managed ~750 security plans, I have since worked at 3 CSPs. One who achieved FedRamp, one who maintained what they called \"FedRAMP like\" (a NIST 800-53 rev4 at FedRAMP moderate baseline) that never chose to pursue certification, and my current position where we completed every step up to where we would gain our FedRAMP accreditation and the sponsor decided to discontinue use of our product due to budget constraints leaving us squarely in a strange  FedRAMP valley of death.\r\n\r\nI fully recommend to all CSP's that they adopt the NIST 800-53 security plan format and use a FedRAMP baseline that makes sense for their application when defining their organizationally defined values. Even if you never decide to pursue FedRAMP this provides a clear and defined set of controls that typically meets or exceeds requirements set out by other frameworks. \r\n\r\nWhen starting a new security plan I work with the DevOps lead to block out a 2-week sprint to dedicate to the effort because I will need input from the entire DevOps team to capture everything and fill out all of the control implementation details. I typically require about a week before and after for preparation and cleanup. This is, in my opinion,  not a huge ask for a one-time event for the rewards that it returns. \r\n\r\nA FedRAMP Ready system with no ATO is not ideal, but there are some benefits. We have a good, well-documented system and are not yet required to pay for costly 3PAO continuous monitoring and I was recently able to achieve TxRAMP in only 2 weeks via their fast-track program. The downside is that we paid for everything to get FedRAMP without achieving ATO, it's difficult to pick up a new sponsor to carry it across the finish line and our chances of getting picked up for the JAB are low. My current plan of attack has been to get TxRAMP and GovRAMP to enable the sales team to bring on as many customers as possible in the hopes of finding a new sponsor while updating to Rev5 in OSCAL format to show program maturity and readiness. \r\n\r\nAs the SecOps lead I have had no pushback on my decision to utilize NIST800-53 format or defining the organizationally defined controls at a FedRAMP moderate level. I sell the idea as a buy-once-cry-once investment (using FedRAMP as an \"Uber control\" set as @dljenkins describes) and emphasize that compliance enables sales as opposed to being a cost center. \r\n\r\nGreat question! I am very interested in hearing other's opinions.  ",
      "author": "osteth",
      "created_at": "2025-04-09T03:28:14Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOMfSVs4AwwT1",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/14#discussioncomment-12780789",
      "body": "I come at these discussions through a business lens rather than an IT / Security lens.\r\n \r\n> 1. How common is it for CSPs (and particularly SMEs) to pursue/obtain FedRAMP authorization before industry, GovRAMP, or FISMA certifications? In what contexts is this the most efficient/feasible option?\r\n\r\nIn my experience, there are vastly more companies (future CSPs) getting started because they see a commercial demand.  So if the commercial market is the draw, then the first security frameworks those companies encounter are going to be the ones that are already part of the \"culture\" of those markets.  The first framework a potential CSP is going to consider is the first one it encounters on the way to recurring revenue.  That's why SOC 2 Type 2 is so prevalent (widest applicability), or why HITRUST has built momentum (specificity to healthcare needs).\r\n\r\nFor FedRAMP to be considered \"first\", then it will need an aggressive communication strategy to the commercial world.  (And it won't be through a GitHub discussion LOL)  \r\n\r\nAs of now, I think it is too steep a hill for FedRAMP to get mindshare ahead of the existing frameworks.",
      "author": "jon-at-betterstitch",
      "created_at": "2025-04-09T16:13:04Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOMfSVs4AwwX9",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/14#discussioncomment-12781053",
      "body": "I doubt that any CSP's pursue FedRAMP first unless it is a solution tailored for Federal Government. The commercial market is very different, the speed at which they can act to begin using a SaaS even under the promise of future roadmap items is very different that we see in Federal. So, it's not just the speed/costs to get to FedRAMP but also what the ROI timing looks like.\r\n\r\nGiven that, I strongly support and recommend using the SP800-53 controls to baseline everything. As you close out controls for other industry compliance certificates you get closer to being ready for FedRAMP.",
      "author": "dljenkins",
      "created_at": "2025-04-09T16:34:08Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOMfSVs4Aw8s_",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/14#discussioncomment-12831551",
      "body": "As a 3PAO, it's very uncommon to see CSPs attempt a 800-53 based assessment first. Generally, everyone has done a SOC report and then they are figuring out what makes the most sense for their next step (ISO, HITRUST, FedRAMP, TX-RAMP, GovRAMP, 800-171, etc.) or they know what their next step is and are on the way.\r\nI've seen one exception, the CSP had various other assessments on different products but were building something specific for 1 federal client and only ever got a FISMA assessment based on 800-53.\r\nI think if the barrier to authorization is lowered, or in other words the valley of death is low to non-existent, FedRAMP would be more viable for a first authorization choice. It would still depend on the CSPs customer base but it would certainly help FedRAMP build momentum as an early assessment to build towards.",
      "author": "jenameldrum",
      "created_at": "2025-04-14T16:24:16Z",
      "replies": []
    }
  ]
}