{
  "id": "D_kwDOOMfSVs4Afbue",
  "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26",
  "title": "Why not NIST 800-171?",
  "body": "We can de-scope 2/3 of the excess controls in FedRAMP Moderate by making it based on 800-171 like CMMC.  What is that? about 80% of the authorizations?   Tremendous efficiency without compromising security or breaking any (FISMA) laws or regulations.  And less onerous requirements around documentation is a plus!\r\n\r\nNIST 800-171 is the standard for \"non-federal information systems\" that store, process or transport federal data.  I would argue that is exactly what a commercial cloud service is.\r\n\r\nNIST 800-53 is the standard for federal information systems.  Created when most were on prem, which imho is why so many of the controls don't make sense for cloud.  \r\n\r\nI am good with High systems being based on 800-53.  However, if the minimum requirement for handling CUI is NIST 800-171, but for cloud systems it needs to be FedRAMP Moderate (according to the FAR), then why does FedRAMP Moderate need to be based on 800-53? Seems inconsistent to me.",
  "author": "jmas-cf",
  "created_at": "2025-04-24T18:31:56Z",
  "comments": [
    {
      "id": "DC_kwDOOMfSVs4AxXdK",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-12941130",
      "body": "I think the challenge with NIST 800-171 is that it primarily focuses on confidentiality. Its core objective is to protect CUI from unauthorized disclosure when processed, stored, or transmitted in non-federal systems and organizations. It doesn't do well to cover integrity and, more importantly in the context of a CSP, the availability of data. \n\nWith that said, I think the FedRAMP PMO is exploring all options. ",
      "author": "ryantpatrick",
      "created_at": "2025-04-25T00:54:57Z",
      "replies": [
        {
          "id": "DC_kwDOOMfSVs4AxZkk",
          "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-12949796",
          "body": "To @jmas-cf point though, he said \"descope 2/3.\" Would create a lot of efficiency if CMMC and FedRAMP worked together, even though there would be delta controls to assess to cover all of FedRAMPs requirements. ",
          "author": "abr-cf",
          "created_at": "2025-04-25T17:18:57Z"
        },
        {
          "id": "DC_kwDOOMfSVs4AxZsr",
          "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-12950315",
          "body": "I feel like \"availability\" of a commercial cloud service is more of an SLA thing.  Does the government **_really_** care about a CSPs contingency planning, maintenance, media protection, and physical security, etc. other than the 800-171 requirements in those families?  And yes, if there is an overlay needed for some 800-53 control that an agency feels is super important that needs to be included, it can still include it.  As I look at 800-53 with a new lens though, it really does seem redundant and superfluous, at least for the 80% solution, where 800-171 probably gets the job done. For the other 20%, sure, you can go FedRAMP High / NIST 800-53.",
          "author": "jmas-cf",
          "created_at": "2025-04-25T18:35:32Z"
        },
        {
          "id": "DC_kwDOOMfSVs4Axyo4",
          "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-13052472",
          "body": "I feel the government does have a reason to care about more than just SLAs. A CSP can roll the dice that their primary datacenter will never go down, and be right most of the time and meet their SLA. But if it ever is down due to a major catastrophe, the CSP puts the government customer at risk if they can't recover their system within the SLAs. In my eyes this is about the government making the call on risk mitigation and risk acceptance. Maybe there's room to let different agencies with different systems and requirements set different bars, but then we're complicating things even more..",
          "author": "vanderson-fits",
          "created_at": "2025-05-06T16:30:07Z"
        },
        {
          "id": "DC_kwDOOMfSVs4Axy0c",
          "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-13053212",
          "body": "@vanderson-fits you're right. Availability is likely just as important as confidentiality and integrity. I think Ransomware has taught us all that. Keeping your data out of the hands of those unauthorized is good and all but if you can't access it then production/operations/business stops. ",
          "author": "ryantpatrick",
          "created_at": "2025-05-06T17:42:38Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOMfSVs4Axe2u",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-12971438",
      "body": "I think this is a great option to explore. If FedRAMP were more based on the CMMC controls there would likely still be a differences between the two but CSPs could likely get both authorizations on one system without any sort of herculean effort. FedRAMP could tailor in some 800-53 controls or specific parameters but that wouldn't necessitate an entirely different FedRAMP authorized system like many CSPs need to do currently. ",
      "author": "jenameldrum",
      "created_at": "2025-04-28T15:23:41Z",
      "replies": [
        {
          "id": "DC_kwDOOMfSVs4Ax2XJ",
          "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-13067721",
          "body": "CMMC controls are based on NIST 800-171 Rev 2 (linked to the previous version of NIST 800-53) It will be a downgrade to map NIST 800-53 Rev5 (the current version) to CMMC.  ",
          "author": "patkompleye",
          "created_at": "2025-05-07T20:28:08Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOMfSVs4AxfDz",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-12972275",
      "body": "NIST SP 800-171 establishes foundational security requirements but doesn’t offer the structure or granularity needed to cover the full complexity of cloud environments. In contrast, NIST SP 800-53 provides extensive control families and enhancements that map to varied cloud models and threat landscapes. As such, I don’t expect that simply eliminating controls or enhancements during tailoring will yield significant efficiency gains.",
      "author": "chrisjohnson1",
      "created_at": "2025-04-28T16:44:13Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOMfSVs4AxhbV",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-12981973",
      "body": "To be clear, 800-53 is akin to a dictionary and not a story like 800-171.  So you can't say we can scope to 53 because there is no framework inside 53, it's just a lost of all controls.   You can scope to 171, CSF, or others.  ",
      "author": "Christcpd",
      "created_at": "2025-04-29T14:37:15Z",
      "replies": [
        {
          "id": "DC_kwDOOMfSVs4Axpmp",
          "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-13015465",
          "body": "800-171 maps to the 800-53 controls that an organization that is processing US Govt CUI must implement.   A cloud service authorization is much different than an organization getting certified to process a type of information. \r\n",
          "author": "judgesma",
          "created_at": "2025-05-02T15:20:03Z"
        },
        {
          "id": "DC_kwDOOMfSVs4Ax2WS",
          "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-13067666",
          "body": "NIST CSF is the framework, NIST SP 800-53, NIST SP 800-17, NIST SP 800-66 are control catalogs.  According to the Federal Information Modernization Act. (FISMA) (44 USC Chapter 35) each agency is required to develop, document and implement agency-wide information security program.  Appendix I to OMB Circular A-130   contains criteria to help agencies on the implementation of the NIST SP 800 series applicable to the in-scope information systems, by way of example Agencies shall protect Controlled Unclassified Information (CUI) and shall apply NIST FIPS and NIST (800-series) SPs, as appropriate. The main difference is that NIS SP 800-83 applies to federal information systems and NIST 800-171 to non-federal information systems ( federal contractors).",
          "author": "patkompleye",
          "created_at": "2025-05-07T20:21:07Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOMfSVs4Ax2CF",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-13066373",
      "body": "As we continue to have these discussions, we need to keep in mind the broader implications on industry and ecosystem. Industry and all levels of government - including state and local governments - are already challenged with duplicative and often conflicting federal cyber regs.  For cloud services authorization - NIST 800-53 does provide a framework that - because of its specificity - can map to satisfy other frameworks/regs. Agree with @judgesma on 800-171 to 800-53.  ",
      "author": "Leah-GovRAMP",
      "created_at": "2025-05-07T17:50:13Z",
      "replies": [
        {
          "id": "DC_kwDOOMfSVs4Ax9MU",
          "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-13095700",
          "body": "You  don't implement 53.  You implement the CSF, 171, or others.   53 contains the overall instructions for everything.  Do you sit down and read the dictionary? No, you use it to look up words you don't understand from a book.   The CSF is the book.   53 is the dictionary.  Same for 171.   And 172 is the Cliff Notes for 171.  ;)",
          "author": "Christcpd",
          "created_at": "2025-05-09T20:44:40Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOMfSVs4Ax_8Y",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-13106968",
      "body": "As pointed out above, cloud services are authorized using controls mapped to frameworks (i.e., FedRAMP Moderate/High, SOC2, HITRUST, DoD SRG, etc.).   Currently, FedRAMP provides the 800-53 controls that we must meet to be authorized at Mod or High.  We don't currently authorize cloud services to 800-171 controls--this would be _net new_ and not well aligned for purpose.   As an example, we do have an internal network that we have had CMMC L2 3PAO certified (mapped to 800-171) to process US CUI data and strictly control access--but it is not a cloud service that we sell to any customers--it is for our internal business operations.   \r\n\r\nFor CSPs & FedRAMP customers to benefit from applying existing frameworks, we need to be able to share the evidence across **current** frameworks that we already perform in the commercial space.  ",
      "author": "judgesma",
      "created_at": "2025-05-11T12:53:52Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOMfSVs4AyZce",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/26#discussioncomment-13211422",
      "body": "SP800-171 and FedRAMP are for different purposes. FedRAMP (The Federal RIsk and Authorization Management Program) is for managing the risk of certain CUI data being compromised.  Under Risk Management Framework, one of initial steps is Categorization based on FIPS199. SP800-53 accounted for this by providing L,M,H sets of controls. FedRAMP also supports the L,M,H model. If SP800-171 is the only standard for FedRAMP, then there will need be a new or revised standard to include the L category. \r\n\r\nI do not believe SP800-171, as it stands, is the correct reference framework for FedRAMP. ",
      "author": "bernieleung",
      "created_at": "2025-05-20T20:23:50Z",
      "replies": []
    }
  ]
}