{
  "id": "D_kwDOOMfSVs4Af4Ou",
  "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/37",
  "title": "Addressing Lack of Reciprocity and Inconsistent Agency Requirements Despite FedRAMP-Authorized Controls",
  "body": "Hi all,\r\n\r\nAs part of our FedRAMP pilot, we’ve implemented robust controls aligned with the FedRAMP High baseline, including granular access control, data isolation, and obfuscation to meet the needs of our government partners.\r\n\r\nDespite this, we’re facing three major challenges that threaten the scalability and effectiveness of this effort:\r\n\r\n1. Personnel Security & Background Investigations\r\nEven when our team members have completed federally adjudicated Tier 1 or Tier 2 background checks, some agencies require redundant investigations or re-adjudications, while others are satisfied with only an NDA. This lack of reciprocity leads to inconsistent access requirements, delays, and administrative burdens across agencies.\r\n\r\n2. Technical Control Acceptance\r\nWe’ve also encountered cases where agencies challenge the sufficiency of our FedRAMP-authorized control implementations — particularly around access enforcement and compensating controls like data obfuscation. In some cases, this appears to stem from limited technical familiarity, while in others, agency-specific policies override FedRAMP guidance. These inconsistencies undermine the value of achieving a unified federal authorization.\r\n\r\n3. Vendor Ecosystem Gaps at the High Baseline\r\nThe FedRAMP marketplace offers limited SaaS options authorized at the High baseline, which poses real constraints. Many common commercial tools are either only Low/Moderate authorized or not authorized at all. To comply, we’ve had to terminate existing vendor contracts, identify replacements, and negotiate new agreements — often under short timelines.\r\nThis not only increases operational and procurement overhead, but in some cases, the core functionality of our product is degraded due to limited tooling compatibility or subpar alternatives. These trade-offs impact product quality, user experience, and ultimately, mission outcomes.\r\n\r\nWe’d love to hear from others in the FedRAMP community:\r\n\r\na. Are you experiencing similar challenges with agency-specific reciprocity issues or vendor limitations?\r\n\r\nb. What strategies have you used to navigate agency pushback on authorized controls?\r\n\r\nc. Is the FedRAMP PMO actively working to push agency-wide reciprocity and address the ecosystem gaps for High baseline adoption?\r\n\r\nWe believe solving these issues will be critical for broader adoption of secure, cloud-based services across government.\r\n\r\nLooking forward to your insights and collaboration.\r\n\r\nThanks!\r\nKelsey McMichael\r\nDirector, Federal Security Enablement\r\nMark43",
  "author": "kelseymcmichael",
  "created_at": "2025-05-21T21:06:26Z",
  "comments": [
    {
      "id": "DC_kwDOOMfSVs4AyfFZ",
      "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/37#discussioncomment-13234521",
      "body": "Hey Kelsey, regarding (c):\r\n\r\n> c. Is the FedRAMP PMO actively working to push agency-wide reciprocity and address the ecosystem gaps for High baseline adoption?\r\n\r\n44 USC § 3613 requires agencies to rely on the adequacy of FedRAMP assessments for their own risk assessment, and requires them to follow guidance related to FedRAMP produced by the Director of OMB. M-24-15 was released in July 2024 and furthers this requirement. Agencies are required by law and policy to follow the FedRAMP process and leverage these materials.\r\n\r\nHowever, it is important to note that agencies are also required by law to maintain full responsibility of their own systems and, more importantly, agencies must consider _their specific use of the cloud service offering_ when determining its suitability for their needs. Agencies may not require cloud services to contradict FedRAMP guidelines but may determine there is a demonstrable need for additional requirements in order to use the cloud service offering. This is normal and expected.\r\n\r\nCloud service offerings need to make their own business decisions about how to deal with specific customers who may want additional or enhance security in place for their own use.\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-22T13:03:32Z",
      "replies": [
        {
          "id": "DC_kwDOOMfSVs4AyrOD",
          "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/37#discussioncomment-13284227",
          "body": "Thank you for your thoughtful response and for highlighting the requirements under 44 U.S.C. § 3613 and OMB M-24-15. We fully understand that agencies must assess systems for their own mission needs and risk posture — and that M-24-15/FISMA is intended as the authoritative foundation for those assessments.\r\n\r\nHowever, I'd like to continue this conversation by highlighting a growing concern across the pilot and vendor communities: the widening gap between the policy intent of reciprocity and its practical application across agencies.\r\n\r\nWhile FedRAMP is designed to streamline and standardize security reviews, we’re consistently encountering:\r\n\r\n**1. Redundant Personnel Security Requirements**\r\nDespite completed Tier 1/Tier 2 federal background investigations, many agencies require additional adjudications, reinvestigations, or bespoke processes. Others accept NDAs. This inconsistency creates delays and contradicts the principle of trusted, portable clearances — especially for FedRAMP-High environments.\r\n\r\n**2. Inconsistent Acceptance of Authorized Controls**\r\nWe’ve seen FedRAMP-approved implementations (e.g., data obfuscation, RBAC enforcement) challenged or overridden by agency-specific preferences or interpretations — even when no material control gap exists. This creates a fragmented assurance model and erodes trust in the FedRAMP process itself.\r\n\r\n**3. FedRAMP High Vendor Ecosystem Gaps**\r\nThe limited availability of High-baseline SaaS tools has forced us to terminate contracts, restructure solutions, and in some cases degrade product functionality — not for lack of security, but because alternatives lack FedRAMP High authorization. These trade-offs directly impact service quality and mission enablement.\r\n\r\n**Reciprocity Is Supported in Policy — But Inconsistently Practiced**\r\nWe’re encouraged by the strong support for reciprocity found in:\r\n\r\n-M-24-15: The FedRAMP Authorization Act (2022, codified in 44 U.S.C. § 3613(e)) introduces a powerful legal mechanism:\r\n\r\nIf a cloud product or service has a FedRAMP authorization at a given FIPS 199 impact level, agencies must presume the authorization package is adequate for issuing an ATO or ATU at or below that level—provided the authorization remains in good standing (i.e., with continuous monitoring).\r\n\r\nThis Presumption of Adequacy:\r\n\r\n- Promotes consistent and efficient reuse of security assessments.\r\n\r\n- Applies unless the agency demonstrates a specific, documented need for additional controls.\r\n\r\n- Requires agencies to notify FedRAMP if they reject an authorization and explain why the package was deemed deficient.\r\n\r\n- Empowers the FedRAMP PMO to determine if additional FedRAMP effort is warranted to support revisions.\r\n\r\nOMB Memorandum M-24-15 further reinforces this by stating:\r\n\r\n“Agency policies should not assume that particular paths or sponsors of FedRAMP authorizations are unacceptable.” \r\n(https://www.whitehouse.gov/wp-content/uploads/2024/07/M-24-15-Modernizing-the-Federal-Risk-and-Authorization-Management-Program.pdf)\r\n\r\nThis underscores the expectation that agencies leverage existing FedRAMP authorizations to the maximum extent practicable, reducing redundant assessments and facilitating faster adoption of secure cloud services.\r\n\r\n- OMB A-130, which encourages joint and leveraged authorizations \"whenever practicable\"\r\n\r\n- NIST SP 800-37, which defines reciprocity within the Risk Management Framework\r\n\r\n- EO 13467 establishes a framework for reforming processes related to suitability, credentialing, and security clearance, promoting the reciprocal recognition of background investigations and adjudications across agencies.\r\n\r\n- M-24-15, mandates agencies leverage existing FedRAMP authorizations when acquiring cloud services authorized at the appropriate impact level, reinforcing the principle of reciprocity. \r\n\r\n- DoDI 8510.01, which formalizes reciprocity as a core DoD RMF principle and actively promotes mutual acceptance of comparable security assessments\r\n\r\nThe frameworks are there — what’s missing is a shared operational approach across agencies.\r\n\r\n**A Call to the Community**\r\nTo the broader FedRAMP pilot and agency participants:\r\n\r\n- How is your agency currently applying reciprocity — or struggling with it?\r\n\r\n- Have you successfully implemented joint or leveraged authorizations across agency lines?\r\n\r\n- What tools, guidance, or support would make it easier to accept authorized SaaS offerings without duplicative reviews?\r\n\r\n- How can vendors like us better support your risk decisions while avoiding unnecessary rework?\r\n\r\nWe’re not asking to eliminate discretion or agency autonomy — only to collaborate on practical, repeatable paths for reuse and trust, especially for systems that meet the High baseline.\r\n\r\nWe welcome continued dialogue with the PMO and are eager to work with others in the community to surface solutions, define shared practices, and align on the spirit and letter of reciprocity. I am curious, is this something the Federal Secure Cloud Advisory Committee is discussing as a part of the goal to provide more robust transparency and dialogue between industry and government?",
          "author": "kelseymcmichael",
          "created_at": "2025-05-27T13:48:57Z"
        },
        {
          "id": "DC_kwDOOMfSVs4AyrWT",
          "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/37#discussioncomment-13284755",
          "body": "From a government perspective, less than a year to start rethinking and putting into massive shifts in policy such as those created by M-24-15 is effectively a blink in time (agencies weren't even required to develop policies for this until January and most of them missed the deadline which was overcome by events). On top of that, FedRAMP and OMB have only really started to push this new approach very recently, as you can see by FedRAMP building these materials in public.\r\n\r\nThis is the beginning of addressing all of these problems. It's very important for folks to continue to flag and bring these problems to the table so everyone has good information to apply change in the right direction, but we'll focus on application in the current operating environment over general address of historical issues.\r\n\r\nVery interested in hearing input on the questions/comments in the broader call to the community that you have made here though!",
          "author": "pete-gov",
          "created_at": "2025-05-27T14:31:23Z"
        },
        {
          "id": "DC_kwDOOMfSVs4AysO5",
          "url": "https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/37#discussioncomment-13288377",
          "body": "Thanks, Pete. I worked in the government for the last 13 years - trust me, I understand. I will continue to push this topic throughout the pilots and do hope to hear from others in the community soon! ",
          "author": "kelseymcmichael",
          "created_at": "2025-05-27T20:43:01Z"
        }
      ]
    }
  ]
}