{
  "id": "D_kwDOOxfoic4AgAKE",
  "url": "https://github.com/FedRAMP/community/discussions/22",
  "title": "Automating Assessment for Service Configuration KSI Validations (KSI-SC)",
  "body": "## Context\r\nThe draft Key Security Indicators (KSIs) have been released! Week to week, we will focus on one security area and discuss automation ideas for the validations. \r\n\r\n### KSI-SC for Service Configuration reads:\r\n\"A secure cloud service offering will enforce the use of approved cryptography, continuously verify component integrity, and restrict access to external services.\"\r\n\r\n### Validations include: \r\n1. Harden and review network and system configurations\r\n1. Encrypt all network traffic\r\n1. Encrypt all federal and sensitive information at rest\r\n1. Manage configuration centrally\r\n1. Enforce system and component integrity through cryptographic means\r\n1. Use a key management capability to execute regular rotation of digital keys\r\n1. Use a consistent, risk-informed approach for applying security patches\r\n\r\n# Questions for the Community\r\n- **_Which validations are conducive to automation, and which ones are not?_**\r\n- **_What auto-generated evidence can be applied to each validation?_**\r\n- **_How might 3PAOs assess these validations/evidence?_**",
  "author": "kyhu65867",
  "created_at": "2025-05-13T14:50:07Z",
  "comments": [
    {
      "id": "DC_kwDOOxfoic4AyQ1F",
      "url": "https://github.com/FedRAMP/community/discussions/22#discussioncomment-13176133",
      "body": "KSI-SC has a lot! As I've been working through these I have been able to find automated ways to pull evidence for most of the validations, but I've found it's hard to know when you are providing enough coverage for each validation. For example **KSI-SC-1** includes two main actions (harden and review) on two categories of resources (network and system). Both of those categories (network and system) have a lot of resource types within them that could potentially be assessed for hardened configurations. \r\n\r\nOne approach to minimize unnecessary CSP effort and promote standardization would be to leverage hardening guides (eg: CIS, STIG, etc) and \"Operational Best Practices\" provided by IaaS companies that are familiar with configuration options for their environments. \r\n\r\nFor example, AWS Labs hosts several AWS Config Rules Conformance Packs (https://github.com/awslabs/aws-config-rules/tree/master/aws-config-conformance-packs) including some for CIS and FedRAMP Best Practices. Unfortunately their FedRAMP Low Conformance Pack doesn't work in AWS GovCloud right now (full analysis of why [here](https://docs.google.com/spreadsheets/d/1eKZpe2EPA-8RQkG6bWViwLRrdDeS4yUpvtvUpu_4WEg/edit?usp=sharing )) but I made a PR with an improved working conformance pack for GovCloud available to download here: https://github.com/iteuscher/aws-config-rules/blob/gov-cloud-config-rules-fixes/aws-config-conformance-packs/Operational-Best-Practices-for-FedRAMP-Low.yaml\r\n\r\nHere's the steps to use and apply this conformance pack in AWS GovCloud\r\n\r\n1. Download AWS GovCloud improved fork of AWS Lab’s FedRAMP Low Conformance pack [here](https://github.com/iteuscher/aws-config-rules/blob/gov-cloud-config-rules-fixes/aws-config-conformance-packs/Operational-Best-Practices-for-FedRAMP-Low.yaml) \r\n2. Navigate to AWS Config > Conformance Packs \r\n3. Click “Deploy Conformance Pack” \r\n4. Choose “Template is ready” and “Upload a template file”\r\n5. Click “Choose file” and select the downloaded FedRAMP Low Conformance Pack (from step 1)\r\n6. Add a Conformance Pack Name such as: FedRAMP-Low-Operational-Best-Practices\r\n7. Click “Deploy conformance pack” \r\n8. Your FedRAMP Low Best Practices Conformance Pack is now deployed. The Compliance score will update over time as AWS Config is able to measure conformance status across a sufficient time period. \r\n\r\nThis approach gives CSPs a quick and fairly painless way to assess network and system hardening (KSI-SC-1) and review it with a dashboard and filterable list of rules. \r\n\r\nFor 20x automated evidence a script can run to pull the conformance pack status (is it enabled? which rules are enabled?) and the result (do the resources meet the conformance requirements?) which could produce a JSON or other machine readable output. \r\n```\r\n# Script pseudocode\r\n# 1. List all conformance packs\r\n#    aws configservice describe-conformance-packs --query \"ConformancePackNames[]\" --output text\r\n#\r\n# 2. For each conformance pack, get:\r\n#    - Status details\r\n#    aws configservice describe-conformance-pack-status --conformance-pack-names \"$pack\"\r\n#    - Compliance summary\r\n#    aws configservice get-conformance-pack-compliance-summary --conformance-pack-names \"$pack\"\r\n#    - Detailed compliance results\r\n#    aws configservice get-conformance-pack-compliance-details --conformance-pack-name \"$pack\"\r\n```\r\n\r\nLooking forward to hearing other approaches to this KSI validation! \r\n-- Isaac Teuscher (Paramify)\r\n￼",
      "author": "iteuscher",
      "created_at": "2025-05-16T23:29:12Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AyVs6",
          "url": "https://github.com/FedRAMP/community/discussions/22#discussioncomment-13196090",
          "body": "@iteuscher,\r\n\r\nThank you for contributing this to the community! This is exactly the kind of thing we are hoping for.",
          "author": "dan-fedramp",
          "created_at": "2025-05-19T16:22:50Z"
        },
        {
          "id": "DC_kwDOOxfoic4AyYvP",
          "url": "https://github.com/FedRAMP/community/discussions/22#discussioncomment-13208527",
          "body": "I appreciate that. Happy to help!",
          "author": "iteuscher",
          "created_at": "2025-05-20T15:03:15Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ayx_Z",
      "url": "https://github.com/FedRAMP/community/discussions/22#discussioncomment-13311961",
      "body": "Closing this discussion as we move into the next phase of this pilot!",
      "author": "pete-gov",
      "created_at": "2025-05-29T16:40:10Z",
      "replies": []
    }
  ]
}