{
  "id": "D_kwDOOxfoic4AgAYY",
  "url": "https://github.com/FedRAMP/community/discussions/29",
  "title": "FedRAMP 20x Pilot scenario: I am a CSP with an existing SOC2 Type 2 report - what KSIs can’t be validated and why?",
  "body": "This is a purely hypothetical scenario, but happy to answer any qualifying questions in the comments.",
  "author": "emu-gov",
  "created_at": "2025-05-06T13:17:47Z",
  "comments": [
    {
      "id": "DC_kwDOOxfoic4AxyuY",
      "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13052824",
      "body": "I think we need to take a step back and figure out how validation would occur and what that means. A SOC 2 Type 2 report is just a PDF document. There is no associated “package” that comes with it that includes evidence. How would validation of a KSI happen with a SOC 2 Type 2 report if there is no mapping or reciprocity with controls listed in a SOC 2 Type 2 report?",
      "author": "troyfine",
      "created_at": "2025-05-06T17:02:32Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Axy9r",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13053803",
          "body": "Fair question. We are being intentionally open ended as we want to see what gets presented or included in a package during the pilots.\r\n\r\nThe high-level process as outlined on the [Phase One Pilot](https://www.fedramp.gov/20x/phase-one/) identifies that a SOC2 Type 2 report itself could be used as evidence for KSI validation - [Draft standards for KSIs](https://www.fedramp.gov/rfcs/0006/)\r\n\r\nWhile we would like technical and machine readable evidence to the greatest extent possible, there may be situations where this is very challenging or not possible. If applicable information was already evaluated for the purpose of an audit, we would like to be able to reuse.\r\n\r\nWe haven't mapped anything specifically to the KSIs and aren't looking at full reciprocity, so for the purpose of the pilot, the CSP and/or 3PAO would determine if the audit report contains enough information to validate part or all of a KSI and submit with their package.",
          "author": "emu-gov",
          "created_at": "2025-05-06T18:41:24Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxzBL",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13054027",
          "body": "Thank you for the clarification. In order for a 3PAO to do this for any commercial framework, they will need to review the evidence (machinery readable or not) that was provided for the SOC 2 Type 2 audit (or insert any other framework) and see which KSI it would meet. I know we keep saying no mapping or reciprocity, but this still seems like the 3PAO would evaluate evidence and map it to the correct KSI.\r\n\r\nIf the evidence still needs to be evaluated by a 3PAO, then how would this be any different than a traditional FedRAMP audit? Audit firms that perform a SOC 2 Type 2 audit and FedRAMP audit for the same company have already been leveraging evidence amongst their audit teams where possible. \r\n\r\nI think if commercial frameworks are going to be leveraged, there will need to be some level of reciprocity or mapping where a 3PAO does not have to re-review evidence.",
          "author": "troyfine",
          "created_at": "2025-05-06T19:11:00Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxzCD",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13054083",
          "body": "I agree with @troyfine. If a CSP has to pay an auditor for SOC 2 or any other framework and then has to pay a second time to a 3PAO so the evidence can be validated, then I think that is counterproductive to the intent of easing the burden to attain an ATO. There has to be a level of trust in the merits of the commercially available framework in order for this to work. ",
          "author": "ryantpatrick",
          "created_at": "2025-05-06T19:15:26Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxzIS",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13054482",
          "body": "For the Phase One Pilot, a 3PAO review by a FedRAMP recognized assessor is a required step in the process. \r\n\r\nThe benefit in leveraging an existing report could be in reducing the amount of overall review time, but @troyfine & @ryantpatrick your feedback is understood and much appreciated.",
          "author": "emu-gov",
          "created_at": "2025-05-06T20:10:55Z"
        },
        {
          "id": "DC_kwDOOxfoic4Axzfs",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13055980",
          "body": "Thank you for the clarification. In my opinion, the review time will only be reduced if they don’t have to review the evidence because the 3PAO can determine that the KSI is already met since it was tested during another framework’s audit and they can confirm the control was in place and operating effectively based on the results documented in the report. Otherwise, they will be doing the same level of review of evidence they otherwise would have during a FedRAMP assessment.\r\n\r\nThough, I do understand why 3PAOs should be reviewing the evidence since KSIs might be more specific than the controls tested in other frameworks.",
          "author": "troyfine",
          "created_at": "2025-05-06T23:26:04Z"
        },
        {
          "id": "DC_kwDOOxfoic4Ax116",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13065594",
          "body": "@emu-gov @troyfine @ryantpatrick \r\nThis actually brings up another point regarding additional frameworks, and perhaps a greater philosophical underlying issue.\r\n\r\nAt what point is a assessor's (FedRAMP 3PAO, SOC2 auditor, ISO auditor, HITRUST, etc) validation deemed sufficient?  I ask this, because historically in the pre-20x world, where packages had essentially three levels of review (or more), even the 3PAO validation was often questioned.  Obviously, it is the AO's or FedRAMP's prerogative to review and perform a deep dive into the package, but I think the thought is to have a lighter touch review than in the past, hence the much faster package reviews happening today.\r\n\r\nSo I think it's important to understand at what point an auditor's evaluation is deemed acceptable.  And yes, we have R311 and A2LA for FedRAMP 3PAOs, but I think determing the level of trust we are going to grant credence to the opinion of an auditor from another framework is a valuable exercise.  Just like we offer presumption of adequacy for an ATO to be reused, should we have some way to presume adequacy and trust for non-FedRAMP auditors?  This would prevent the re-evaluation of a SOC2 report by an A2LA accredited FedRAMP 3PAO.  Which is mostly rework, more money, and more time, and not necessarily an improvement in the overall security posture of the CSO.  \r\n\r\nOr is this a rabbithole where we start having AICPA authorized SOC 2 assessors being required to follow R311 (or a subset thereof?) or certain KSIs require less rigor (e.g. a SOC 2 auditor's opinion on training vs SOC 2 auditor's opinion on encryption)?\r\n\r\n",
          "author": "jsantore-cgc",
          "created_at": "2025-05-07T16:22:01Z"
        },
        {
          "id": "DC_kwDOOxfoic4Ax13h",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13065697",
          "body": "@jsantore-cgc I agree with this and believe these are crucial discussions to be having. Thank you for summarizing it!",
          "author": "troyfine",
          "created_at": "2025-05-07T16:33:13Z"
        },
        {
          "id": "DC_kwDOOxfoic4Ax136",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13065722",
          "body": "@jsantore-cgc I completely agree which is why I asked the question about assurance standards here: https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/21#discussioncomment-12858219 ",
          "author": "ryantpatrick",
          "created_at": "2025-05-07T16:36:44Z"
        },
        {
          "id": "DC_kwDOOxfoic4Ax2N8",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13067132",
          "body": "@jsantore-cgc unfortunately CPA firms are the one that define competence requirements and although they would implement a policy to follow R311 guidance, some firms can always find a workaround.  Cross training and credentials are not difficult to implement but FedRAMP requires a level of detail that a significant number of CPA firms do not meet.",
          "author": "patkompleye",
          "created_at": "2025-05-07T19:23:07Z"
        },
        {
          "id": "DC_kwDOOxfoic4AyKEG",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13148422",
          "body": "Similarly: https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/5#discussioncomment-12750884",
          "author": "ChanceofClouds",
          "created_at": "2025-05-14T17:59:20Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Axyw5",
      "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13052985",
      "body": "When asking about what can or can't be validated, are we talking about by the FedRAMP or agency staff or by the SOC 2 auditor prior to submission to FedRAMP?\r\n",
      "author": "ryantpatrick",
      "created_at": "2025-05-06T17:18:54Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ax2Zg",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13067872",
          "body": "I am currently working on a similar project, but it starts with FedRAMP rev5 controls which are used to meet some sections of a SOC 2 report.  From a high level  CC 6.0 it addresses Logical and Physical Access controls which can be mapped to AC, IA, PE.   The SOC 2 can report on section 4 the Security Requirements Traceability Matrix for the applicable level.\r\n\r\nThere is also the option to have a SOC 2 plus NIST 800-53 Rev5 report, which should also include the Security Requirements Traceability Matrix to allow FedRAMP assessors to make informed decisions. ",
          "author": "patkompleye",
          "created_at": "2025-05-07T20:50:31Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ax8Bc",
      "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13090908",
      "body": "What our team has observed is that there is a degree of variability in how controls are defined for a SOC 2 audit, which makes it difficult to gauge how well they line up with the NIST 800-53 requirements if you consider the defined parameters, where applicable.  That's why we would suggest, as others have in this thread, evaluating the evidence and not just the PDF report. ",
      "author": "Leah-GovRAMP",
      "created_at": "2025-05-09T13:21:51Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ax8N-",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13091710",
          "body": "This is absolutely true.  There are some ways to address this, although not in a one-size-fits-all sense.\r\n\r\n1) One can define your controls against the COSO principles with 800-53.  (@troyfine and I did a mapping of this back in the rev 4 days), so that can be required.  If they do it right, it's usable; if not, it's not (or only partially usable).  I believe that there is an official SOC 2 to 800-53 mapping out there today as well.\r\n2) You don't have to use all or nothing of the SOC 2.  Only areas that directly align with a KSI or whatever may be deemed usable (as far as giving credit for)\r\n3) You can require standards for the SOC 2 auditors.   Not supplanting AICPA, but 'we will accept a SOC 2, if the SOC 2 auditor satisfies these requirements... ' (Think A2LA R311 type stuff).\r\n4) Not all controls/KSIs are equal.  From a risk appetite perspective, I'd be willing to trust a SOC 2 regarding training, but perhaps not on encryption.  I think there's opportunities to create a usable structure to determine what aspects of a SOC 2 are usable as-is, which are usable if they align with our needs, and some which may never be usable.  And then we make a hopefully low friction mechanism to account for the delta.\r\n\r\nThe more discussion I see, the more it seems like the consensus is that SOC 2 doesn't work.  I'd like to change that mindset and figure out ways where some/part of it CAN work.  It's not all or nothing,  and I think figuring out what 'credit' we are willing to grant to a SOC 2 sets some guidelines and foundation when we expand to other frameworks.  \r\n\r\n",
          "author": "jsantore-cgc",
          "created_at": "2025-05-09T13:57:29Z"
        },
        {
          "id": "DC_kwDOOxfoic4Ax8PN",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13091789",
          "body": "But the KSIs and validations don’t appear to have parameters and are not specific. For example, one of the validations for “KSI-IAM: A secure cloud service offering will protect user data, control access, and implement zero trust practices.” is “Enforce strong passwords”.\r\n\r\nIn my opinion, any commercial framework would already cover this, so is there a need for the 3PAO to review evidence for this KSI if they are comfortable with commercial framework report? SOC 2, ISO 27001, etc.",
          "author": "troyfine",
          "created_at": "2025-05-09T13:59:25Z"
        },
        {
          "id": "DC_kwDOOxfoic4Ax8P4",
          "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13091832",
          "body": "I completely agree, the current state of SOC 2 reports makes it challenging.  According to SSAE the organization (CSP) is responsible for  selecting the controls and frameworks to audit against.   The SOC 2 report will also need to follow current FedRAMP guidance and include the Examine, Interview and Testing methods within the Controls Testing Section, making it easy to track for a 3PAO.  \r\nI have seen too many reports that only use interviews, or just rely on a third party platform and issue the report without even talking to any stakeholder.",
          "author": "patkompleye",
          "created_at": "2025-05-09T14:00:30Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ax9LA",
      "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13095616",
      "body": "Generally, any controls in a SOC audit are a sampling and not a total review of every time that control was engaged.  For example, user training.   Employee list is submitted and auditor pulls five names from the lost asking for proof of training completion.  All the CSP must show is evidence for those five people.  The remaining 120 people are never checked.  \n\nThe same can be said for MFA policy.  Those 5 that were checked had MFA enforced while there are 10 others with it just enabled making it optiional.\n\nSo, the question becomes, is the FedRAMP PMO willing to accept that the control was not fully validated?  \n\nThis is one of the reasons I do not like SOC as a security assurance.  I want to know about everything to ensure the best security.  And that is where GRC tools excel.  ",
      "author": "Christcpd",
      "created_at": "2025-05-09T20:38:17Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Ax9Og",
      "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13095840",
      "body": "Another additional point here is that SOC reports are variable with the 5 Trust Services Criteria.   Security is the only required criteria.  Privacy and the others are optional.   The organization chooses which of the remaining four they want to opt into. \n\nOk,ok, one more point on SOC.  :)   The scoping of the boundary will need to match.  No way to really automate that. Scope is something people don't review in a SOC report often.  They look through the findings and say, \"All looks good\" without realizing the scoped boundary is a single VPC that performs no functions they will consume from the CSP.    But they have a SOC 2!  ;)\n\nHope this helps. ",
      "author": "Christcpd",
      "created_at": "2025-05-09T21:02:10Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyjVd",
      "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13251933",
      "body": "Another question here would be does the SOC 2 report cover the FedRAMP environment or not? Most customers have separate FedRAMP and commercial environments, and the SOC 2 report may not cover both. If it doesn't, I'm not certain any information from the SOC 2 report can be used at all.",
      "author": "jbrenton-fits",
      "created_at": "2025-05-23T22:46:24Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Ay5sF",
      "url": "https://github.com/FedRAMP/community/discussions/29#discussioncomment-13343493",
      "body": "With the initial release of the [formal 20xP1 submission requirements (including Q&A in this thread)](https://github.com/FedRAMP/community/discussions/34) and an updated Q&A thread on the [20xP1 release standards (25.05) for KSIs and MAS here](https://github.com/FedRAMP/community/discussions/28), I'm closing out these older threads to avoid any confusion.\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-06-02T12:57:55Z",
      "replies": []
    }
  ]
}