{
  "id": "D_kwDOOxfoic4Af-ME",
  "url": "https://github.com/FedRAMP/community/discussions/3",
  "title": "FedRAMP RFC-0006: 20x Phase One Key Security Indicators (Closed)",
  "body": "# RFC-0006 20x Phase One Key Security Indicators\r\n\r\n> - Status: Closed\r\n> - Created By: FedRAMP PMO\r\n> - Start Date: 2025-04-24\r\n> - Closing Date: 2025-05-24\r\n> - Short Name: rfc-0006-key-security-indicators\r\n\r\n## Where to Comment\r\n\r\nMon May 26 09:52:49 EDT 2025\r\n\r\nThis RFC is now closed to public comment. Many thanks to all the participants!\r\n\r\n## Summary\r\n\r\nFedRAMP’s 20x Phase One Key Security Indicators creates an abstraction layer to summarize the security capabilities expected of a cloud-native service offering to meet FedRAMP Low authorization requirements. These indicators align to NIST SP 800-53 controls and form a baseline equivalent.\r\n\r\nThese Key Security Indicators will be updated after public comment and formalized for use in the FedRAMP 20x Phase One Pilot to grant FedRAMP Low authorizations. During Phase Two, Key Security Indicators will be expanded for FedRAMP Moderate authorizations.\r\n\r\nAuthorization packages based on Key Security Indicators must be machine-readable, supported by evidence, and should include automated technical validation whenever possible.\r\n\r\n## Motivation and Rationale\r\n\r\nFedRAMP 20x describes key goals for a new assessment approach that is being designed by FedRAMP in collaboration with industry stakeholders and agency experts. Automation efforts have historically focused on automating the production of documentation materials to be used in an assessment, but the FedRAMP Authorization Act requires FedRAMP to establish a means for the “automation of security assessments and reviews.” FedRAMP asserts that automatically producing and reviewing documentation alone will not meet this requirement.\r\n\r\nFedRAMP 20x encourages the development of truly automated security assessment with continuous validation and enforcement by following NIST guidance to focus on required security capabilities. This initial release will serve as a foundation for the FedRAMP 20x pilot program, allowing us to refine the approach based on real-world implementation before expanding to additional service types and impact levels.\r\n\r\n## Explanation\r\n\r\nThe full draft standard is approximately 5 pages and is available for review in the following formats:\r\n\r\n- [Basic web formatting on fedramp.gov](https://fedramp.gov/updates/rfcs/0006)\r\n- Basic text markdown on GitHub (below)\r\n- PDF file:  [rfc-0006-key-security-indicators.pdf](https://github.com/FedRAMP/rfcs/raw/main/rfc/assets/0006-key-security-indicators.pdf)\r\n- DOCX file:  [rfc-0006-key-security-indicators.docx](https://github.com/FedRAMP/rfcs/raw/main/rfc/assets/0006-key-security-indicators.docx)\r\n\r\n## Discussion Requested\r\n\r\nThis draft standard is open for any public comment. FedRAMP encourages fast, informal comments from any member of the public. The public may submit multiple comments and may respond to other public comments. All comments from the public sent via email will be made public.\r\n\r\nThe FedRAMP Automating Assessments Working Group will simultaneously host discussions on potential best practices and implementation methods for integration of Key Security Indicators into the FedRAMP 20x Phase One Pilot for FedRAMP Low authorizations.\r\n\r\n---\r\n\r\n# RFC-0006 20x Phase One Key Security Indicators\r\n\r\nThursday, April 24, 2025\r\n\r\n---\r\n\r\n# Background\r\n\r\n> [OMB Circular A-130: Managing Information as a Strategic Resource](https://obamawhitehouse.archives.gov/sites/default/files/omb/assets/OMB/circulars/a130/a130revised.pdf) Appendix I states _“Agencies may also develop overlays for specific types of information or communities of interest (e.g., all web-based applications, all health care-related systems) as part of the security control selection process. Overlays provide a specification of security or privacy controls, control enhancements, supplemental guidance, and other supporting information as part of the tailoring process, that is intended to complement (and further refine) security control baselines. The overlay may be more stringent or less stringent than the original security control baseline and can be applied to multiple information systems.”_\r\n\r\n> [NIST SP 800-53B: Control Baselines for Information Systems and Organizations](https://csrc.nist.gov/pubs/sp/800/53/b/upd1/final) Section 2.5 states _“As the number of controls in \\[SP 800-53\\] grows in response to an increasingly sophisticated threat space, it is important for organizations to have the ability to describe key capabilities needed to protect organizational missions and business functions, and to subsequently select controls that—if properly designed, developed, and implemented—produce such capabilities. The use of capabilities simplifies how the protection problem is viewed conceptually. Using the construct of a capability provides a method of grouping controls that are employed for a common purpose or to  achieve a common objective.”_\r\n>\r\n> This section later states _“Ultimately, authorization decisions (i.e., risk acceptance decisions) are made based on the degree to which the desired capabilities have been effectively achieved.”_\r\n\r\n> [NIST SP 800-53A*:* Assessing Security and Privacy Controls in Information Systems and Organizations](https://csrc.nist.gov/pubs/sp/800/53/a/r5/final) Section 3.5 states “_When organizations employ the concept of capabilities, automated and manual assessments account for all security and privacy controls that comprise the security and privacy capabilities. Assessors are aware of  how the controls work together to provide such capabilities.”_\r\n\r\n> [The FedRAMP Authorization Act (44 USC § 3609 (a) (1))](https://www.govinfo.gov/app/details/USCODE-2023-title44/USCODE-2023-title44-chap36-sec3609)  requires that the Administrator of the General Services Administration shall _“in consultation with the \\[DHS\\] Secretary, develop, coordinate, and implement a process to support agency review, reuse, and standardization, where appropriate, of security assessments of cloud computing products and services…”_ 44 USC § 3609 (c) (2) further states that _“the \\[GSA\\] Administrator shall establish a means for the automation of security assessments and reviews.”_ These responsibilities are [delegated to the FedRAMP Director](https://www.gsa.gov/directives-library/gsa-delegations-of-authority-fedramp).\r\n\r\n# Introduction\r\n\r\nModern cloud services often use automated or code-driven configuration management and control planes to ensure predictable, repeatable, reliable, and secure outcomes during deployment and operation.\r\n\r\nConsequently, FedRAMP asserts that the majority of a service security assessment can take place continuously via automated validation for simple cloud-native services if the need for a traditional control-by-control narrative approach is removed.\r\n\r\nThe [FedRAMP 20x Phase One Pilot](https://www.fedramp.gov/20x/phase-one/) will test this assertion for a subset of low impact systems by granting conditional FedRAMP Low authorization to services that meet the full Phase One eligibility requirements and qualifications. To qualify for this authorization, cloud services must at minimum provide a machine readable package that demonstrates a continuous, automated validation approach for a significant portion of the FedRAMP Key Security Indicators (KSIs) outlined in this standard.\r\n\r\nThe resulting packages and validation approaches will inform Phase Two and other formal standards for FedRAMP 20x. Services that receive FedRAMP 20x Low authorizations during Phase One will be prioritized for the FedRAMP 20x Moderate pilot in Phase Two.\r\n\r\n# Key Security Indicators\r\n\r\nFedRAMP Key Security Indicators summarize the capabilities that satisfy FedRAMP security requirements aligned to NIST SP 800-53 controls, providing an abstraction layer that is simpler to approach and assess. Each Key Security Indicator includes critical security capabilities that must be met and validated. These capabilities are designed to provide a concrete approach to evaluating cloud security risks that can often be automatically derived from technical configurations and resolved to true or false.\r\n\r\nKey Security Indicators are engineered to address critical limitations in existing security assessment approaches:\r\n\r\n- Simplified capabilities: Reduce lengthy and complex security compliance to clear, actionable, capability-based standards\r\n\r\n- Automation-Friendly: Eliminate reliance on narrative to create a foundation for future automated security assessment processes\r\n\r\n- Flexible Implementation: Enable private innovation to design different methods for validation\r\n\r\nAlthough Key Security Indicators are designed to produce final validations that are true or false, the minimum expectations for validation and assessment will require cloud service providers and third party assessment organizations to provide reasonable evidence supporting the final validation.\r\n\r\nTo maximize innovation, this standard does not propose validation, evidence, or assessment expectations for Key Security Indicators. Instead, minimum expectations for validation, evidence, and assessment will be determined during active FedRAMP 20x pilots in collaboration with cloud service providers, third party assessment organizations, and federal agencies.\r\n\r\nAll FedRAMP 20x packages submitted for assessment based on these standards must be in a machine-readable format that can be regenerated on demand.\r\n\r\n# **Key Security Indicators (FedRAMP Low, Cloud Native)**\r\n\r\nThis release includes the Key Security Indicators that must be addressed to meet security requirements for FedRAMP Low authorization for cloud service offerings that meet the following eligibility criteria:\r\n\r\n1. Deployed on an existing FedRAMP authorized cloud service offering\r\n   1. Using primarily cloud-native services from the host provider\r\n   2. Using only FedRAMP authorized external services\r\n2. Service is provided only via the public internet (browser and/or APIs)\r\n3. Has completed a SOC 2 Type 2 audit or federal agency ATO process within the last 12 months\r\n\r\n## Cloud Native Architecture\r\n\r\n**KSI-CNA:** A secure cloud service offering will use cloud native architecture and design principles to enforce and enhance the Confidentiality, Integrity and Availability of the system.\r\n\r\n**Validation**\r\n\r\nCloud service providers MUST:\r\n\r\n1. Have denial of service (DoS) protection\r\n2. Configure firewalls/proxy servers to limit inbound and outbound traffic\r\n3. Use immutable containers and serverless functions with strictly defined functionality and privileges\r\n4. Design systems as logically segmented micro-services to minimize the attack surface and lateral movement if compromised\r\n5. Use cloud native virtual networks and related capabilities to enforce logical traffic flow controls\r\n6. Execute continuous scanning of cloud native system components\r\n7. Use high availability design principles to maximize uptime\r\n\r\n**Related NIST SP 800-53 Controls:** SC-5, SC-7, SC-12, SC-39, SR-12\r\n\r\n## Service Configuration\r\n\r\n**KSI-SC:** A secure cloud service offering will enforce the use of approved cryptography, continuously verify component integrity, and restrict access to external services.\r\n\r\n**Validation**\r\n\r\nCloud service providers MUST:\r\n\r\n1. Harden and review network and system configurations\r\n2. Encrypt all network traffic\r\n3. Encrypt all federal and sensitive information at rest\r\n4. Manage configuration centrally\r\n5. Enforce system and component integrity through cryptographic means\r\n6. Use a key management capability to execute regular rotation of digital keys\r\n7. Use a consistent, risk-informed approach for applying security patches\r\n\r\n**Related NIST SP 800-53 Controls:** CM-2, CM-4, CM-8, IA-7, RA-7, SC-8, SC-8 (1), SC-13, SC-28, SC-28 (1), SI-3, SI-4\r\n\r\n## Identity and Access Management\r\n\r\n**KSI-IAM:** A secure cloud service offering will protect user data, control access, and implement zero trust practices.\r\n\r\n**Validation**\r\n\r\nCloud service providers MUST:\r\n\r\n1. Enforce phishing-resistant multi-factor authentication (MFA)\r\n2. Enforce strong passwords\r\n3. Use secure API authentication methods via industry standard protocols\r\n4. Use a least-privileged, role-based, and just-in-time security model\r\n\r\n**Related NIST SP 800-53 Controls:** AC-2, AC-3, AU-9, AC-14, IA-2, IA-2 (1), IA-2 (2), IA-2 (8), IA-2 (12), IA-4, IA-5, IA-5 (1), IA-6, IA-8, IA-8 (1) ,IA-8 (2), IA-8 (4), IA-11, PS-2, PS-3, PS-4, PS-5, PS-7, PS-9\r\n\r\n## Monitoring, Logging, and Auditing\r\n\r\n**KSI-MLA:** A secure cloud service offering will monitor, log, and audit all important events, activity, and changes.\r\n\r\n**Validation**\r\n\r\nCloud service providers MUST:\r\n\r\n1. Operate a Security Information and Event Management (SIEM) system for\r\n   centralized, tamper-resistent event, activity, and change logging\r\n2. Regularly review and audit logs\r\n3. Rapidly detect and remediate or mitigate vulnerabilities\r\n4. Perform authenticated vulnerability scanning on publicly accessible components\r\n5. Perform Infrastructure as Code (IaC) and configuration scanning\r\n6. Centrally track and prioritize the remediation of identified vulnerabilities\r\n\r\n**Related NIST SP 800-53 Controls:** AC-7, AU-2, AU-3, AU-4, AU-8, AU-11, AU-12, RA-5, SI-2\r\n\r\n## Change Management\r\n\r\n**KSI-CM:** A secure cloud service provider will ensure that all system changes are properly documented and configuration baselines are updated accordingly.\r\n\r\n**Validation**\r\n\r\nCloud service providers MUST:\r\n\r\n1. Log and monitor system modifications\r\n2. Execute changes though redeployment of version controlled immutable resources  rather than direct modification wherever possible\r\n3. Implement automated testing and validation of changes prior to deployment\r\n4. Have a documented change management procedure\r\n5. Evaluate the risk and potential impact of any change\r\n\r\n**Related NIST SP 800-53 Controls:** CM-6, CM-7, CM-10, CM-11\r\n\r\n## Policy and Inventory\r\n\r\n**KSI-PI:** A secure cloud service offering will have intentional, organized, universal guidance for how every asset, including personnel, is secured.\r\n\r\n**Validation**\r\n\r\nCloud service providers MUST:\r\n\r\n1. Have an up-to-date asset inventory or code defining all deployed assets\r\n2. Have policies outlining their security objectives\r\n3. Maintain a vulnerability disclosure program\r\n4. Build security considerations into the Software Development Lifecycle (SDLC) and aligning with Secure By Design principles\r\n5. Document methods used to automatically evaluate implementations\r\n6. Have a dedicated staff and budget for security\r\n\r\n**Related NIST SP 800-53 Controls:** AC-1, AU-1, CA-1, CM-1, CM-8, CP-1, IA-1, IR-1, PL-1, PL-2, PS-1, RA-1, SA-1, SA-2, SA-3, SA-5, SA-8, SC-1, SI-1, SR-1\r\n\r\n## Third Party Information Resources\r\n\r\n**KSI-3IR:** A secure cloud service offering will understand, monitor, and manage supply chain risks from third party services or components.\r\n\r\n**Validation**\r\n\r\nCloud service providers MUST:\r\n\r\n1. Regularly confirm that services storing Federal information are all FedRAMP authorized and securely configured\r\n2. Identify and prioritize potential supply chain risks\r\n3. Obtain a Software Bill of Materials (SBOM) for third party commercial software components\r\n4. Confirm that third party information resources have a Secure Software Development Attestation with CISA\r\n5. Implement zero trust design principles\r\n\r\n**Related NIST SP 800-53 Controls:** AC-2, AC-20, AC-23, CA-3, CA-9, RA-3 (1), SA-4, SA-9, SA-22, SI-5, SR-2, SR-2 (1), SR-3, SR-5, SR-8, SR-10, SR-11, SR-11 (2)\r\n\r\n## Cybersecurity Education\r\n\r\n**KSI-CE:** A secure cloud service provider will continuously educate their employees on cybersecurity measures, testing them regularly to ensure their knowledge is satisfactory.\r\n\r\n**Validation**\r\n\r\nCloud service providers MUST:\r\n\r\n1. Ensure all employees receive security awareness training\r\n2. Require role-specific training for high risk roles\r\n\r\n**Related NIST SP 800-53 Controls:** AT-2, AT-3, AT-6\r\n\r\n## Incident Response\r\n\r\n**KSI-IR:** A secure cloud service offering will maintain, test, and execute effective Incident Response Plans for routine incidents such as vulnerability discovery, abnormal activity detection, and exfiltration of data.\r\n\r\n**Validation**\r\n\r\nCloud service providers MUST:\r\n\r\n1. Define Recovery Time Objective (RTO) and Recovery Point Objective (RPO)\r\n2. Perform system backups aligned with the RTO and RPO\r\n3. Test the capability to recover from incidents and contingencies\r\n4. Report incidents according to federal requirements\r\n5. Maintain a log of incidents and periodically review past incidents for patterns or vulnerabilities\r\n6. Measure Mean Time To Detect (MTTD) and Mean Time To Resolution (MTTR) for incidents\r\n\r\n**Related NIST SP 800-53 Controls:** CP-2, CP-4, CP-9, CP-10, IR-4, IR-5, IR-6, IR-7, IR-8, PS-8, RA-3, RA-5 (2), RA-5 (11)\r\n\r\n\r\n",
  "author": "pete-gov",
  "created_at": "2025-04-24T15:06:12Z",
  "comments": [
    {
      "id": "DC_kwDOOxfoic4AxY89",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12947261",
      "body": "Just for avoidance of doubt.  This sounds like this must occur 'post initial review', correct\r\n\r\n> Has completed a SOC 2 Type 2 audit or federal agency ATO process within the last 12 months\r\n\r\nMy take on this is, is that you must already be in the continuous monitoring phase, and so the KSIs are more analogous to 'annual assessments' rather than 'initial.'  (with a SOC 2 serving in lieu of an initial FedRAMP Low/LI-SaaS).  \r\n\r\nPlease correct me if I am reading this wrong.",
      "author": "jsantore-cgc",
      "created_at": "2025-04-25T13:01:26Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AxZAG",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12947462",
          "body": "Thank you for your comment (this is not endorsement of the comment).\r\n\r\n> Just for avoidance of doubt. This sounds like this must occur 'post initial review', correct\r\n> \r\n> > Has completed a SOC 2 Type 2 audit or federal agency ATO process within the last 12 months\r\n> \r\n> My take on this is, is that you must already be in the continuous monitoring phase, and so the KSIs are more analogous to 'annual assessments' rather than 'initial.' (with a SOC 2 serving in lieu of an initial FedRAMP Low/LI-SaaS).\r\n\r\nFor public clarification, this particular aspect of the draft standard is aligned with the [FedRAMP 20x Phase One pilot](https://www.fedramp.gov/20x/phase-one/).\r\n\r\nThese Key Security Indicators are intended for both initial assessment _and_ ongoing assessment.\r\n\r\nThe second part of the above statement is targeted at cloud services that seek FedRAMP authorization and have completed a federal agency ATO process at Low or higher _without_ sponsorship for FedRAMP authorization via the Rev 5 Agency Authorization path. This standard could be applied to cloud services who currently have a FedRAMP Li-SaaS or Low authorization, meet the other criteria, and wish to transition from a Rev 5 Agency Authorization.\r\n\r\n\r\n\r\n\r\n\r\n",
          "author": "pete-gov",
          "created_at": "2025-04-25T13:23:26Z"
        },
        {
          "id": "DC_kwDOOxfoic4Axg8U",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12979988",
          "body": "What is the application process like, for CSPs that have a SOC2 type 2?  Do they submit their SOC2 results and immediately get their FedRAMP Low, or do they still need to produce the package in the machine readable format (IE FedRAMP package)? \r\n\r\nI see that the requirement is machine readable format for submission, that can be regenerated on Demand.  Is OSCAL the requirement, or is there a different structure in mind?   \r\n\r\nIs this going to be a strategy that is buildable to the next Impact category?  IE Low must do all KSI's above.  Eventually Moderate will do all of Low and their additional requirements, and High will build off of low and moderate.  Are these controls highlighted above going to be the core controls for for annual assessment (with additional added for Moderate and High)? \r\n\r\nFor validation and assessment, do you plan on continuing to use the Nist 800.53r5A objectives or are there going to be specific assessment objectives to validate the KSI's?  Is this going to tie into continuous monitoring, where we should be associating specific plug-ins or or tests types that should be assessed for monthly re-validation of specific controls (part of monthly scan cycle?).  \r\n",
          "author": "Telos-sa",
          "created_at": "2025-04-29T11:49:00Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxiKU",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12984980",
          "body": "For public clarification, Q&A about the Phase One Pilot should take place in the appropriate working group. There are a couple questions here that align with different working groups. The pilot is exploring where materials produced for commercial compliance frameworks can be applied to FedRAMP KSIs. There is no world in which someone presents a SOC 2 Type 2 audit result and receives FedRAMP Low. The [Phase One Pilot page](https://www.fedramp.gov/20x/phase-one/) has additional information.\r\n\r\nThe RFC process is specifically requesting comments on approach and KSIs.",
          "author": "pete-gov",
          "created_at": "2025-04-29T20:06:40Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AxaMZ",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12952345",
      "body": "In KSI-3IR I believe the word \"commercial\" can be removed from\r\n3. Obtain a Software Bill of Materials (SBOM) for third party commercial software components\r\n\r\nRef: inclusion of \"open source software\" in (CISA):\r\n* [Secure Software Development Attestation form](https://www.cisa.gov/sites/default/files/2024-04/Self_Attestation_Common_Form_FINAL_508c.pdf) (.pdf)\r\n* [Secure by Demand Guide](https://www.cisa.gov/resources-tools/resources/secure-demand-guide)",
      "author": "openprivacy",
      "created_at": "2025-04-26T01:15:25Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Axhj2",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12982518",
      "body": "I know I sound like a broken record but the success of 20x relies heavily on the GRC vendor community and not the organization seeking 20x.   Without the GRC tool, a machine readable format will be extremely difficult.\n\nPerhaps another requirement should be the organization has a GRC tool that can generate the machine readable output. Or explain in detail how they will generate such information.  ",
      "author": "Christcpd",
      "created_at": "2025-04-29T15:25:51Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Axhqh",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12982945",
          "body": "@Christcpd \r\nMandating a GRC tool is tricky, and there are many different flavors, etc.  I'd be loathe to *require* a CSP or 3PAO actually use a tool.  Many/most are not FedRAMP authorized, it's another expense/complexity to manage, etc.  \r\n\r\nDepends on what each specific KSIs is, I don't think you need a GRC tool for this (remember, the old scan xml files were machine readable).  Would it help?  Possibly, but I don't know that I'd require it.  I'd more worry about the 'machine readable formatting standard' though.  I am unconvinced OSCAL is the magic answer, either.\r\n\r\nI will say that as a 3PAO, I found those CSPs that did use a GRC tool were not inherently better prepared or easier to assess than those without (and in some cases, they were worse).\r\n\r\n",
          "author": "jsantore-cgc",
          "created_at": "2025-04-29T16:01:18Z"
        },
        {
          "id": "DC_kwDOOxfoic4Axhro",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12983016",
          "body": "So how do you propose that automation be conducted without the use of a tool?   20x wants to do automated evidence collection on an ongoing basis.  That requires tooling.  Whether it is open source or commercial.  ",
          "author": "Christcpd",
          "created_at": "2025-04-29T16:07:09Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxhuH",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12983175",
          "body": "Let's use this as an example:\r\n\r\n> KSI-CE: A secure cloud service provider will continuously educate their employees on cybersecurity measures, testing them regularly to ensure their knowledge is satisfactory.\r\n>\r\n>Validation\r\n>\r\n>Cloud service providers MUST:\r\n>\r\n>Ensure all employees receive security awareness training\r\n>Require role-specific training for high risk roles\r\n>Related NIST SP 800-53 Controls: AT-2, AT-3, AT-6\r\n\r\nThat's not easily automatable anyway.  Not without a few human checks in there.  I'm not sure what a GRC tool would add for this.  \r\n",
          "author": "jsantore-cgc",
          "created_at": "2025-04-29T16:23:12Z"
        },
        {
          "id": "DC_kwDOOxfoic4Axh3J",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12983753",
          "body": "Actually, that is really easy to automate as many vendors have already done so.  I won't mention names.  But if you Know Before... ;)\r\n\r\nThis is a combination of tools. First is the Learning Management System that automatically assigns training based on triggering event (Onboarding - discovered via IAM integration, quarterly, annual, etc.)    LMS tracks user completion.  LMS can also assign training based on user roles determined from IAM based on user role (Admin, HIPAA Users, etc.)  GRC tool integrates with LMS and gathers training logs noting successes and failures of completion (of which we hope there are none). If there are incompletes, it can send warning notices to admins or directly to impact employees notifying them to complete their training although the LMS should handle that.  GRC tool then packages the findings into a machine readable format with all the other automated checks and balances it conducted.\r\n\r\nSo, while there are some overseer functions that a human can engage, the vast portion of the training process can be automated (and without AI!)  It is already done and in production in several platforms.",
          "author": "Christcpd",
          "created_at": "2025-04-29T17:24:43Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxiLG",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12985030",
          "body": "Depends on what a GRC is. Traditionally, the GRC has served as a front-end database abstraction on top of Word docs and spreadsheets.\r\n\r\nThe promise of OSCAL (a data centric SSP) brings with it the ability to write a collection of scripts that walk the OSCAL tree and perform validations directly.\r\n\r\nThe promise of AI is that a machine can ingest, understand and answer queries regarding those Word docs and spreadsheets.\r\n\r\nAre the scripts a GRC? (I believe this is feasible). Is the AI?  (I don't believe we are there yet.)",
          "author": "openprivacy",
          "created_at": "2025-04-29T20:14:09Z"
        },
        {
          "id": "DC_kwDOOxfoic4Axksd",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12995357",
          "body": "> Depends on what a GRC is. Traditionally, the GRC has served as a front-end database abstraction on top of Word docs and spreadsheets.\r\n\r\nNot in my experience.  To name a few: Drata, Vanta, SecureFrame, Hyperproof, and others.  These are GRC tools that help manage the compliance by organizing it, complying it, integrations with other platforms like EntraID, AWS, Azure, and many, many more.  These are not \"abstractions on top of Word docs or spreadsheets\" by any stretch of the imagination.\r\n\r\nIt is these vendors and GRC tools that will bring true automation to 20x.  Otherwise, you will still have a convoluted process that detracts from efficiency.",
          "author": "Christcpd",
          "created_at": "2025-04-30T14:57:41Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxlRf",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12997727",
          "body": "I would offer that it isn't solely dependent on GRC tools. There is at least one commercial standard (HITRUST) that offers testing results in a JSON export from the testing platform that can be consumed by FedRAMP. ",
          "author": "ryantpatrick",
          "created_at": "2025-04-30T18:56:46Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Axh5t",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12983917",
      "body": "KSI-MLA\r\n\"Rapidly detect and remediate or mitigate vulnerabilities\r\nPerform authenticated vulnerability scanning on publicly accessible components\"\r\n\r\nAs a CISO, I live every day worrying about patching abilities and the entire vulnerability management approach of the companies I assist including my own.  With the tremendous advancement of Information Stealers (InfoStealers) including in the corporate environment, it is no longer viable to just scan \"publicly accessible components\" unless the definition of public accessible components includes each and every desktop, laptop, server, etc that has an Internet connection even if is behind a firewall.  If that is the case, my comment here can be ignored.\r\n\r\nHowever, if by publicly accessible components it is referring only to those assets that the general public can reach, then my point is it should be replaced with corporate assets that pose a risk, based on the organization's risk analysis, for compromise.  To me, and based on the information above, any corporate asset that connects to the internet and can support an authenticated scan, should be scanned if it is within boundary.  \r\n\r\nA CSP often times has virtual desktops within the boundary.  They won't be publicly accessible per se but they certainly can touch other sensitive assets within the boundary so they pose a higher risk than an asset outside the boundary.",
      "author": "Christcpd",
      "created_at": "2025-04-29T17:40:29Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Axi3l",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12987877",
      "body": "**RFC-0006 Feedback: Real-World KSI Implementation Perspective**\r\n\r\nAs a cloud service provider actively building and preparing to submit a machine-readable package under the 20x Phase One pilot, I want to express deep appreciation for this new direction.\r\n\r\nWhile our company is entering the FedRAMP ecosystem for the first time, I personally bring prior experience managing FedRAMP Rev. 4 and Rev. 5 Agency ATOs at the Moderate level. That experience has given me a clear lens into both the value and complexity of the traditional FedRAMP process. It’s also why I find the 20x model — especially the KSI framework — so compelling.\r\n\r\nToo often in legacy FedRAMP efforts, implementation teams are caught in the gap between control interpretation and security intent. I’ve seen firsthand how technically sound architectures still get flagged because they don’t map 1:1 with prescriptive control narratives. The KSI approach resolves this by focusing on capabilities — real, testable outcomes — and abstracts away the ambiguity that often leads to unnecessary audit friction.\r\n\r\nWe’ve structured a machine-readable package around the current KSIs and built a Git-tracked repository of aligned evidence for submission. In doing so, we’ve seen how:\r\n\r\n    The true/false assertions dramatically reduce compliance ambiguity\r\n\r\n    JSON-based structure enables long-term reporting and QA opportunities\r\n\r\n    Smaller, high-performance teams like ours can move faster without compromising assurance\r\n\r\n**Implementation Snapshot: Sample Evidence**\r\n\r\nIn our KSI implementation, each validation result is asserted as true or false and backed by linked evidence. For example:\r\n\r\n**KSI-IAM: Identity and Access Management**\r\n\r\n    MFA enforcement: evidence/ksi-iam/mfa_enforcement.png\r\n\r\n    Strong password policy aligned to NIST 800-63B: evidence/ksi-iam/password_policy_nist_800_63b.pdf\r\n\r\n    Secure API access (OAuth 2.0/SAML): evidence/ksi-iam/saml.png\r\n\r\n    Least privilege model (Permission Sets + SCPs): evidence/ksi-cna/permission_sets.pdf\r\n\r\nThis pattern continues across all nine KSIs using static PDFs, screenshots, policies, and system configurations. We are also building a second folder structure (evidence_v2/) to begin ingesting CLI outputs and API scans as part of future continuous validation reporting.\r\n\r\n**To future-proof our JSON structure, we’ve prototyped lightweight extensions including:**\r\n\r\n    validation_method: Manual vs. automated\r\n\r\n    validation_timestamp: Date of last validation\r\n\r\n    evidence_type: Screenshot, config, policy, etc.\r\n\r\n    service_dependencies: Supporting cloud-native services\r\n\r\n**Suggestion**: It may be helpful to add a short “KSI intent narrative” to each indicator — a single sentence explaining why the capability matters. That kind of clarity would go a long way for new CSPs trying to implement securely without falling into legacy compliance traps.\r\n\r\n**Broader Perspective: Inviting a New Class of CSPs**\r\n\r\nFrom my vantage point, one of the most profound long-term impacts of FedRAMP 20x will be its ability to open the floodgates to a new generation of cloud service providers — particularly small and medium-sized businesses (SMBs), legacy platforms seeking modernization, and commercial-first products looking to enter the federal space.\r\n\r\nThese companies may:\r\n\r\n    Lack a formal GRC team (or even a dedicated compliance function)\r\n\r\n    Have modern, secure architectures that don’t map cleanly to legacy narrative controls\r\n\r\n    Be exploring FedRAMP authorization for the first time as a growth vector\r\n\r\nIn that context, the KSI framework does something revolutionary: it welcomes these providers into the ecosystem without compromising security. By anchoring expectations in outcomes — not lengthy documentation — it gives capable but lean teams a clear, achievable path to compliance.\r\n\r\nThat’s the beauty I see in the 20x approach: it’s not just modernization for the sake of efficiency — it’s modernization for the sake of accessibility, scale, and innovation. And it sends a powerful signal to industry that secure-by-design doesn’t need to be compliance-burdened-by-default.\r\n\r\nIf the intent of FedRAMP is to expand the federal cloud marketplace securely, 20x — and specifically KSIs — are the most promising invitation we’ve seen.",
      "author": "aburroughs",
      "created_at": "2025-04-30T03:36:23Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Axk_5",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12996601",
      "body": "KSI-CNA refers to the CIA triad but the validation sub-points are not arranged in C-I-A order. Obviously some of the validations cross into multiple aspects (eg: micro-services help with confidentiality and integrity) however some clearly fit into one part of the CIA triad. I wonder if rearranging the order of the sub-points would make the KSI feel more organized and understandable. The CIA headings are likely not necessary but included to demonstrate the organization. For example:\r\n\r\n### KSI-CNA\r\n##### Confidentiality\r\n1. Configure firewalls/proxy servers to limit inbound and outbound traffic\r\n2. Design systems as logically segmented micro-services to minimize the attack surface and lateral movement if compromised\r\n##### Integrity\r\n3. Use immutable containers and serverless functions with strictly defined functionality and privileges\r\n4. Use cloud native virtual networks and related capabilities to enforce logical traffic flow controls\r\n##### Availability \r\n5. Have denial of service (DoS) protection\r\n6. Use high availability design principles to maximize uptime\r\n\r\n_Side Note: isn't DoS protection--validation 1--a \"high availability design principle to maximize uptime\"? Maybe validation 1 should be a subset of validation 7._\r\n\r\nValidation 6 \"Execute continuous scanning of cloud native system components\" is somewhat vauge. I'm not sure what kind of scanning this implies. Is it a health check scan (ping) for availability? Is it an integrity and change control scan? Is it a vulnerability scan (confidentiality)? All of the above? \r\n\r\nIn short, rearranging the order of the validations in KSI-CNA could make it more readable and understandable. Clarifying what is meant by \"high availability design principles\" and \"continuous scanning\" would be beneficial as well. \r\n\r\n-- Isaac Teuscher (Paramify)",
      "author": "iteuscher",
      "created_at": "2025-04-30T16:47:47Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AxlJY",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12997208",
      "body": "Why binary answers don't work in an automated assessment.\r\n\r\nConsider this KSI: \"Enforce phishing-resistant multi-factor authentication (MFA)\"  Seems easy to test.  It is either on or off for each account.  If found to be off for any single account, the control \"fails\".  Enforce and Enable carry two different meanings.  Enabled gives the user the choice to enroll.  Enforce means no choice.  Most of the time though this setting is per user and not per organization.  It can't be the latter.\r\n\r\nService Accounts are those accounts used for integrations or performing operations.  It is generally very difficult to Enforce MFA across all Service Accounts.  Yes, you can use certs to a degree but it will not get you 100% in compliance.\r\n\r\nMost controls therefore can't be binary: Yes or No, On or Off, True or False.  That is not enough granularity.  During an audit, an auditor would ask to see that other mitigating controls are in play.  For example, Service Accounts without MFA do not allow interactive login and use extremely long passwords.  \r\n\r\nWhile FedRAMP is not dictating a format to report and are asking for suggestions, this is certainly something to consider for the final reporting.  Especially those participating in the pilot.  \r\n\r\n\"Enforce phishing-resistant multi-factor authentication (MFA)\" answers should be something like \"Fully Complies\", \"Fully Complies with Mitigating Controls\", \"Substantially Complies\", \"Does Not Comply Substantially\".  This introduces granularity into a \"scoring system\" which is the next nature step for anything machine readable.",
      "author": "Christcpd",
      "created_at": "2025-04-30T17:49:30Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ax17l",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13065957",
          "body": "Instead of all or nothing, the pass/fail criterial for each KSI element could be based off a % of compliance (e.g. 85%+ = pass) which would allow for a more nuanced approach.",
          "author": "gmengelberg",
          "created_at": "2025-05-07T17:01:29Z"
        },
        {
          "id": "DC_kwDOOxfoic4Ax2GJ",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13066633",
          "body": "I do want to support the broader goal of 20x: enabling faster, continuous, and more transparent assurance.\r\n\r\nThat said, I want to flag one critical caution regarding the idea of replacing binary control outcomes with nuanced scoring models (e.g., “85% compliance = pass” or “substantially compliant”). While this appears to introduce flexibility, it does introduce risks undermining the integrity of federal assurance baselines.\r\n\r\nFedRAMP was built on the idea that either a control meets the bar, or it doesn't. Allowing partial passes—even with mitigating context—could set dangerous precedents and weaken the clarity that auditors, AOs, and agencies rely on to make trust decisions.\r\n\r\nI strongly support machine-readable evidence and structured compliance outputs that include granularity (e.g., compliant_with_mitigation, partial_scope, etc.). But these should always roll up to a binary pass/fail conclusion for each KSI to preserve auditability and authorization integrity.\r\n\r\nIn short: nuance belongs in the evidence layer, but policy outcomes should remain definitive (Dave Fairburn Jr aka \"The Father of FedRAMP\") would appreciate if at least that aspect of the program remained intact :)\r\n\r\nSeriously though - I offer this feedback as someone who deeply believes in the promise of 20x and wants to ensure its scalability doesn’t come at the cost of clarity or trust.",
          "author": "aburroughs",
          "created_at": "2025-05-07T18:24:50Z"
        },
        {
          "id": "DC_kwDOOxfoic4Ax8vm",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13093862",
          "body": "I totally get your point.  The benefit of a percent-based approach is it provides context into how much a CSP/CSO is missing the mark.  For example, does the CSO implement MFAs on 100% of accounts, 85%, 84%, or 1%.  Pass/Fail does not provide that context; however, Pass/Fail coupled w/ percent compliance does.",
          "author": "gmengelberg",
          "created_at": "2025-05-09T16:24:53Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AxlxD",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-12999747",
      "body": "**Additional Comment – Lessons from Active Implementation**\r\n\r\nAs a follow-up to our initial RFC comment, I’d like to offer deeper insights now that we’re nearing completion of our Low submission under the 20x pilot.\r\n\r\nWe're a small CSP actively building out a machine-readable KSI package in GitHub, and I believe our real-world implementation offers meaningful observations that could inform the PMO and the broader community as this process matures.\r\n\r\n1. **KSI Framework Is Solid — but Prioritization Would Help**\r\nThe current KSIs are well-aligned with core FedRAMP Low capabilities. However, they’re all presented equally. In practice, some (like IAM and MLA) are far more critical to risk posture. A tiered or weighted structure (e.g., Tier 1 Critical, Tier 2 Operational, Tier 3 Administrative) could help CSPs prioritize appropriately.\r\n\r\n2. **KSIs Vary in Their Automation Suitability**\r\nMany KSIs are ideal for technical attestation (IAM, CM, SC), while others (like CE or PI) are inherently more process-driven. Tagging each KSI with a validation modality — e.g., automatable, process-driven, or hybrid — could clarify what’s expected and help CSPs avoid overengineering non-technical areas.\r\n\r\n3. **Binary Assertions Don't Always Reflect Real-World Risk**\r\nCertain validations (e.g., enforcing phishing-resistant MFA) oversimplify the implementation realities for edge cases like service accounts. A more flexible compliance scale (e.g., “fully compliant,” “compliant with mitigations,” “not applicable”) would better support risk-based decisions while staying true to intent.\r\n\r\n4. **KSI-to-Control Mappings Should Be Standardized**\r\nWe've added manual mappings to NIST SP 800-53 controls in our JSON package, which has helped crosswalk our legacy control framework. It would be valuable for the PMO to provide and maintain an official KSI-to-Control mapping table, particularly as Moderate-level KSIs are introduced in Phase Two.\r\n\r\n5. **Evidence Expectations Would Benefit from Clarification**\r\nRight now, it's unclear whether a PDF screenshot, policy doc, Terraform config, or CLI output is considered “sufficient” for each KSI. A KSI-specific evidence reference guide would help CSPs and 3PAOs calibrate their efforts and avoid mismatched expectations.\r\n\r\n6. **Smaller Teams Need a Clear, Realistic Path**\r\nAs a team with no full-time compliance or GRC resources, we've built our pilot submission using GitHub, AWS-native tools, and JSON. The framework is working — but only because we've interpreted the KSIs carefully. A lightweight reference implementation (e.g., a public repo using native tooling and markdown evidence) could go a long way in opening the 20x door for others like us.\r\n\r\n7. **Infrastructure as Code Should Be Acknowledged, Even Without Full Automation**\r\nWe’re using Terraform and GitHub to manage system configuration and track evidence, even though we haven't yet built automated validation pipelines (e.g., GitHub Actions or scheduled scans). For small CSPs, this is often the first step before full CI/CD automation. Encouraging a validation_origin field — e.g., manual, automated, pipeline — would improve clarity and traceability, and would set the stage for eventual continuous monitoring under Rev 5.\r\n",
      "author": "aburroughs",
      "created_at": "2025-05-01T00:19:51Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Axn_d",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13008861",
      "body": "**Building on Our Pilot Participation: Operational Feedback to Strengthen the 20x KSI Model**\r\n\r\nHaving now spent considerable time actively implementing the 20x KSI structure in support of an upcoming pilot submission, we wanted to share additional insights informed by hands-on experience and real conversations with 3PAOs. These are intended to further refine and support the framework’s goal of reducing unnecessary burden while delivering real, verifiable security outcomes. There might be some overlap in this comment from our previous one but the context is with 3PAOs and agencies in mind. \r\n\r\n1. **3PAO Validation Guidance Needed for Consistency**\r\n\r\nUnder traditional FedRAMP, 3PAOs rely on control-level objectives from NIST 800-53A. In 20x, evidence seems to be slated to be derived from automation outputs — CLI scans, IaC configuration states, screenshots, or GitHub pipelines — all valid, but without standardized assessment criteria, difficult to evaluate uniformly.\r\n\r\nWe recommend FedRAMP develop lightweight validation objectives or sufficiency criteria per KSI. This would reduce inconsistency across assessors and clarify what \"adequate evidence\" means in the 20x model.\r\n\r\nTo improve auditability, we propose a validation_origin field in each KSI result to denote how the evidence was generated:\r\n\r\n`\"validation_origin\": \"automated\" // or \"manual\", \"pipeline\", etc.`\r\n\r\nThis improves trust and transparency for both 3PAOs and agency reviewers.\r\n\r\n\r\n2. **Proposal: Automate Posture Awareness via Dashboard**\r\n\r\nTo align with the FedRAMP Authorization Act’s intent for automation (44 USC §3609) and continuous validation, we propose:\r\n\r\n`Encourage CSPs to develop public/private read-only dashboards that render KSI validation status using the existing machine-readable JSON structure. This allows 3PAOs and agencies to monitor security posture without requiring full package re-submission or manual artifact collection. It also aligns with NIST SP 800-53A’s emphasis on observable, testable evidence.`\r\n\r\nWe plan to begin prototyping this capability using GitHub, Infrastructure-as-Code (Terraform), and static site generation — and would be happy to share lessons learned if it proves to be useful.\r\n\r\n\r\n3. **Ensure Agency Adoption Through Control Mapping**\r\n\r\nA concern raised by our 3PAO was agency-level acceptance. Many federal security teams remain grounded in traditional 800-53 control interpretation. If FedRAMP 20x is perceived as “less rigorous” or too commercially abstract, agencies may hesitate to adopt even validly authorized services.\r\n\r\nWe recommend FedRAMP publicly release or endorse a KSI-to-800-53 mapping, even if imperfect. This bridge will help agency Authorizing Officials translate KSIs into familiar language and reduce resistance to accepting 20x-based packages.",
      "author": "aburroughs",
      "created_at": "2025-05-01T23:43:47Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AxoR3",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13010039",
      "body": "### ✅ Clarify “Evidence” Expectations for CSPs and 3PAOs\r\n\r\nThe draft rightly emphasizes machine-readable, regenerable evidence, but leaves too much ambiguity around **what constitutes acceptable evidence**. Suggest FedRAMP provide:\r\n\r\n- A minimal evidence taxonomy per KSI (e.g., CLI output, IaC config, policy excerpt, signed attestation)\r\n- A mapping between “evidence type” and “validation origin” (manual vs. automated vs. pipeline)\r\n\r\nThis will reduce rework and prevent misalignment between CSPs and 3PAOs, especially for small teams using GitOps but not fully automated CI/CD pipelines.\r\n\r\n---\r\n\r\n### ✅ Define and Scope “Zero Trust” Mentions in KSI-IAM and KSI-3IR\r\n\r\nSeveral KSIs reference “zero trust design principles” or “zero trust security model” without defining scope. Recommend:\r\n\r\n- Providing a FedRAMP-aligned baseline for what qualifies as a “zero trust approach” under FedRAMP Low\r\n- Clarifying if ZTA is expected to cover identity brokering, network segmentation, software-defined perimeters, etc.\r\n\r\nOtherwise, “zero trust” may become a vague expectation that varies wildly between CSPs and assessors.\r\n\r\n---\r\n\r\n### ✅ Add “Validation Origin” Metadata to All Machine-Readable KSI Submissions\r\n\r\nTo improve transparency, traceability, and automation-readiness, recommend that each KSI validation include a `validation_origin` field with values such as:\r\n\r\n- `automated` (fully derived via API or IaC)\r\n- `manual` (human-reviewed evidence like policies or screenshots)\r\n- `pipeline` (derived from structured CI/CD runs)\r\n\r\nThis helps 3PAOs and AOs quickly assess rigor and future automation potential.\r\n\r\n---\r\n\r\n### ✅ Add “Rationale” Field for True/False Assertions\r\n\r\nBinary assertions alone lack sufficient context, especially for edge cases (e.g., service accounts lacking MFA). Recommend allowing an optional `\"rationale\"` field per KSI validation:\r\n\r\n```json\r\n\"rationale\": \"MFA not enforced for non-interactive service accounts; compensating controls include long password, IP allow-list, and no console access.\"\r\n```\r\n\r\nThis strikes a balance between machine-readability and risk-context clarity.\r\n\r\n---\r\n\r\n### ✅ Clarify Scope of “CSP” in Training and Awareness KSI (KSI-CE)\r\n\r\nKSI-CE applies to \"all employees,\" but FedRAMP Low cloud-native systems may involve contractors, shared service providers, or off-shore DevOps partners. Please clarify:\r\n\r\n- Whether training requirements apply to only those with boundary access\r\n- Whether CSPs can provide evidence via HRIS exports or LMS dashboards\r\n\r\nOtherwise, CSPs with federated or hybrid workforces may over- or under-scope their training KPIs.\r\n\r\n---\r\n\r\n### ✅ Recommend Crosswalk Table from KSI to FedRAMP Rev 5 Controls\r\n\r\nTo support broader reuse, request FedRAMP publish a **machine-readable crosswalk** showing:\r\n\r\n- Which KSIs map to which 800-53 controls or enhancements (1-to-many)\r\n- Whether that mapping covers full or partial implementation\r\n\r\nThis will help CSPs migrating from Rev 5 packages and improve interpretability for agency AOs.\r\n\r\n---\r\n\r\n### ✅ Add Metadata Field for “Validation Freshness”\r\n\r\nSecurity assertions that are valid today may not be valid tomorrow. Recommend allowing:\r\n\r\n```json\r\n\"validated_on\": \"2025-05-01\"\r\n```\r\n\r\nand/or\r\n\r\n```json\r\n\"expiration_date\": \"2025-06-01\"\r\n```\r\n\r\nThis supports trustworthiness in continuous monitoring and future FedRAMP dashboarding.\r\n\r\n---\r\n\r\n### ✅ Clarify if Third-Party Agents Used by the CSP Are In-Scope for KSI-3IR\r\n\r\nMany CSPs rely on third-party agents (e.g., endpoint detection tools, patch management systems, RUM or APM agents). Please clarify:\r\n\r\n- If these require SBOMs and Secure Software Attestations\r\n- Whether their vendors’ FedRAMP authorization must also be verified\r\n\r\nThis would clarify inclusion thresholds and reduce disagreements over what is “third party.”\r\n\r\n---\r\n\r\n### ✅ Encourage Optional Metadata Fields for FedRAMP Low Packages\r\n\r\nTo support automated dashboards and version control, recommend the machine-readable KSI package support optional metadata fields such as:\r\n\r\n- `package_version`\r\n- `maintainer_email`\r\n- `repo_url` or `evidence_repo`\r\n\r\nThese lightweight fields would improve CI/CD integration, support reuse, and enable future community-based dashboards.\r\n\r\n---\r\n\r\n### ✅ Recommend Standardization of Validation Result Schema Across KSIs\r\n\r\nTo reduce variability in implementation, recommend that FedRAMP standardize the JSON schema for KSI results, including:\r\n\r\n```json\r\n{\r\n  \"ksi_id\": \"KSI-IAM\",\r\n  \"result\": true,\r\n  \"validated_on\": \"2025-05-01\",\r\n  \"validation_origin\": \"automated\",\r\n  \"rationale\": \"MFA enforced via EntraID policy; verified by Azure CLI output.\",\r\n  \"evidence_url\": \"https://repo.internal/evidence/iam/mfa_policy.json\"\r\n}\r\n```\r\n\r\nStandardization at the schema level ensures compatibility with future dashboards, validators, and audit tooling.",
      "author": "austinsonger",
      "created_at": "2025-05-02T04:13:21Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AxvKF",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13038213",
      "body": "For KSI-IR3: Confirm that third party information resources have a Secure Software Development Attestation with CISA\r\n\r\nDoes CISA publish a publicly available resource to consume this information? Something similar to the JSON used to update the FedRAMP marketplace:  - https://raw.githubusercontent.com/GSA/marketplace-fedramp-gov-data/refs/heads/main/data.json. \r\n\r\nI tried requesting an account to the CISA Repository for Software Attestations and Artifacts through: https://softwaresecurity.cisa.gov/request-account\r\n\r\nHowever, you have two options for account types \"Federal User\" or \"Software Producer\" when selecting software producer, you are required to select a vendor from a list of software providers (I'm guessing these might be companies that have submitted SSDF attestations, but not sure). I don't work for any of those vendors and there was no \"other\" field, so I was unable to get an account going. \r\n\r\nA public-facing way to consume this information will be required. Preferably in a way that can be consumed and automated, such as a published JSON.  \r\n",
      "author": "jdettweiler",
      "created_at": "2025-05-05T11:42:32Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AxvaU",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13039252",
          "body": "> For KSI-IR3: Confirm that third party information resources have a Secure Software Development Attestation with CISA\r\n> \r\n> Does CISA publish a publicly available resource to consume this information? Something similar to the JSON used to update the FedRAMP marketplace: - https://raw.githubusercontent.com/GSA/marketplace-fedramp-gov-data/refs/heads/main/data.json.\r\n\r\nAs far as I know, they do not. Or they are not publishing information and developer instructions in [their official user guides](https://www.cisa.gov/sites/default/files/2024-03/CISA_RSAA_User_Guide_18_March_2024.pdf) since I last checked. (I checked again this morning.)\r\n\r\n> However, you have two options for account types \"Federal User\" or \"Software Producer\" when selecting software producer, you are required to select a vendor from a list of software providers (I'm guessing these might be companies that have submitted SSDF attestations, but not sure). I don't work for any of those vendors and there was no \"other\" field, so I was unable to get an account going.\r\n\r\nI had the same observation when I began using it; there are many different personas that fall between those two or a persona that is neither of these two.\r\n\r\n",
          "author": "aj-stein-gsa",
          "created_at": "2025-05-05T13:00:31Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ax4d4",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13076344",
      "body": "@pete-gov If a SOC 2 Type 2 report included a mapping of the KSIs to controls tested during the audit and included testing procedures that covered the KSI validation procedures, could a 3PAO review the report and test results and rely on the report to prove that a KSI was met, assuming the 3PAO agreed with the tests performed and trusted the competency of the auditors that performed the SOC 2 Type 2 audit? Assume for this question, the SOC 2 Type 2 was completed 3 months ago.",
      "author": "troyfine",
      "created_at": "2025-05-08T13:39:35Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ax5E4",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13078840",
          "body": "Thank you for the comment (this is not an endorsement of the comment or commenter). \r\n\r\nFor public awareness, there is some discussion related to this in the related working group: https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/31#discussioncomment-13053134 That working group is a good place to discuss specific scenarios beyond commenting here for FedRAMP's awareness that it is on your mind.",
          "author": "pete-gov",
          "created_at": "2025-05-08T16:43:07Z"
        },
        {
          "id": "DC_kwDOOxfoic4Ax5Fd",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13078877",
          "body": "Thank you for the response.",
          "author": "troyfine",
          "created_at": "2025-05-08T16:46:11Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ax5R-",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13079678",
      "body": "I submitted my comments/questions via the RFC form yesterday but don't see it on here. Can you advise?",
      "author": "greg-egnyte",
      "created_at": "2025-05-08T18:14:51Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ax5aT",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13080211",
          "body": "For public clarification, comments submitted via the RFC form and email will be published for public awareness separately. ",
          "author": "pete-gov",
          "created_at": "2025-05-08T19:25:21Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ax5cz",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13080371",
      "body": "",
      "author": "greg-egnyte",
      "created_at": "2025-05-08T19:51:13Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ax5dN",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13080397",
          "body": "Ah, for public clarification, they _will_ be published separately but have not yet. We will likely publish them in this thread.",
          "author": "pete-gov",
          "created_at": "2025-05-08T19:54:37Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ax7Tw",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13087984",
      "body": "Pete,\r\n\r\nThanks again for the response and again apologies for one more important\r\nquestion. Is there a better place for me to get a response to Phase One\r\nPilot Comments (Questions). Timelines for Phase One Pilot are winding down\r\n(my understanding from attending working groups and reading the website is\r\nthat we have until May 25th to send our submission).\r\n\r\nWe are situated perfectly to be included based on the KSI indicators as we\r\nwill shortly have FedRAMP Ready status and DoD FedRAMP Equivalency\r\ncompliance. I've allocated our internal resources and communicated with our\r\n3PAO about Phase One Pilot duties. Our only concern is that we may not get\r\nresponses in time to inform our submission.\r\n\r\n\r\n\r\nOn Thu, May 8, 2025 at 3:55 PM Pete Waterman ***@***.***>\r\nwrote:\r\n\r\n> Ah, for public clarification, they *will* be published separately but\r\n> have not yet. We will likely publish them in this thread.\r\n>\r\n> —\r\n> Reply to this email directly, view it on GitHub\r\n> <https://github.com/FedRAMP/rfcs/discussions/18#discussioncomment-13080397>,\r\n> or unsubscribe\r\n> <https://github.com/notifications/unsubscribe-auth/BSJAXLXZVA34CNT6TESSORT25OZBLAVCNFSM6AAAAAB3ZJMJRWVHI2DSMVQWIX3LMV43URDJONRXK43TNFXW4Q3PNVWWK3TUHMYTGMBYGAZTSNY>\r\n> .\r\n> You are receiving this because you commented.Message ID:\r\n> ***@***.***>\r\n>\r\n",
      "author": "greg-egnyte",
      "created_at": "2025-05-09T11:05:46Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ax8sx",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13093681",
          "body": "> Pete, Thanks again for the response and again apologies for one more important question. Is there a better place for me to get a response to Phase One Pilot Comments (Questions). Timelines for Phase One Pilot are winding down (my understanding from attending working groups and reading the website is that we have until May 25th to send our submission). We are situated perfectly to be included based on the KSI indicators as we will shortly have FedRAMP Ready status and DoD FedRAMP Equivalency compliance. I've allocated our internal resources and communicated with our 3PAO about Phase One Pilot duties. Our only concern is that we may not get responses in time to inform our submission.\r\n\r\nFor public clarification, our community working groups are the appropriate place for Q&A about the pilot. [Here is a thread in one](https://github.com/FedRAMP/applying-existing-frameworks-cwg/discussions/31).",
          "author": "pete-gov",
          "created_at": "2025-05-09T16:08:52Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ax8xv",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13093999",
      "body": "**What is the coverage of buy-in from agencies?**\r\n\r\nHas fedramp polled agencies on using ksis instead of controls?  Would love to see stats on buy-in from adjudicating officials.  Who is on board and who needs convincing?",
      "author": "anonymous-participant",
      "created_at": "2025-05-09T16:44:06Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AyY_k",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13209572",
          "body": "For public clarification, questions that are seeking answers outside of the formal public comment process can be posted in FedRAMP's Community Working Groups, such as in the Automating Assessment group's [General Q&A for Participation and Submission in the 20x pilot](https://github.com/FedRAMP/automating-assessment-cwg/discussions/27) thread.",
          "author": "pete-gov",
          "created_at": "2025-05-20T16:58:12Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ax8_D",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13094851",
      "body": "What do you mean by \"just-in-time security\"? Are you speaking about a mechanism for \"zero standing privileges\"? While most would agree that is a great solution, it is NOT currently a requirement for FedRAMP on any level.  To insert that as a requirement for LOW systems arbitrarily at this stage seems problematic, especially when the controls do not actually mandate it.  They only mandate defining processes and timelines for granting access to solutions, not \"Thou shalt only have authorization provisioned dynamically upon approval from your ISSM and said access revoked automatically after a pre-established timelines.\"\r\n\r\nAlso, there are several layers of zero standing privileges/ JIT acccess.  Many solutions offer only OS level access - but not necessarily at the CSP IaaS or other systems (not all solutions support that access model).  You're effectively requiring LOW systems to add in multiple security tool and/or change their entire environment to incorporate solutions that do support it.   ",
      "author": "vennemp",
      "created_at": "2025-05-09T18:43:17Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ax9Zd",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13096541",
          "body": "In our case, we interpreted the phrase “just-in-time security model” in KSI-IAM not as a strict mandate to implement commercial zero standing privilege tooling or dynamic provisioning frameworks, but as a design model reflecting the intent behind Zero Trust principles — specifically:\r\n\r\n- Eliminating standing, persistent access to production resources \r\n- Ensuring access is granted only when needed, scoped to a role, and automatically expires\r\n- Logging and auditing every session for full traceability\r\n- Identity verification\r\n- Least privilege\r\n\r\nIn our AWS environment, we’ve configured:\r\n\r\n- IAM Permission Sets via Identity Center for role-based, time-limited/session based access (ultimately still IAM roles under the hood)\r\n- SSM Session Manager only for infrastructure access (no SSH or keys)\r\n- SCPs and IAM boundaries to restrict escalation paths\r\n- CloudTrail and SSM logs for monitoring all access actions\r\n\r\nWe chose IAM Permission Sets over IAM roles because they allow us to centrally manage role-based, time-limited access across accounts without long-lived credentials or unmanaged role sprawl. This we believe supports Zero Trust principles and makes it easier to audit and revoke access — which we believe aligns exactly with KSI-IAM intent.  \r\n\r\nWe described this as a “just-in-time security model” not to imply a formal JIT platform, but to reflect an implementation that avoids persistent access and aligns with Zero Trust posture (JIT) — using only native AWS capabilities, and well within the FedRAMP Low boundary.",
          "author": "aburroughs",
          "created_at": "2025-05-09T23:26:04Z"
        },
        {
          "id": "DC_kwDOOxfoic4AyY_i",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13209570",
          "body": "For public clarification, questions that are seeking answers outside of the formal public comment process can be posted in FedRAMP's Community Working Groups, such as in the Automating Assessment group's [General Q&A for Participation and Submission in the 20x pilot](https://github.com/FedRAMP/automating-assessment-cwg/discussions/27) thread.",
          "author": "pete-gov",
          "created_at": "2025-05-20T16:58:06Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ax-OY",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13099928",
      "body": "> FedRAMP Key Security Indicators summarize the capabilities that satisfy FedRAMP security requirements aligned to NIST SP 800-53 controls, providing an abstraction layer that is simpler to approach and assess. Each Key Security Indicator includes critical security capabilities that must be met and validated. These capabilities are designed to provide a concrete approach to evaluating cloud security risks that can often be automatically derived from technical configurations and resolved to true or false.\r\n\r\nDoes this mean that KSI’s are meant to replace NIST 800-53 controls? As part of the pilot program, will a 3PAO evaluate KSIs against the validation requirements or do will they test KSIs against the referenced NIST 800-53 controls for each KSI and follow the standard assessment objectives for each NIST 800-53 control referenced?\r\n\r\n> ",
      "author": "troyfine",
      "created_at": "2025-05-10T13:45:09Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AyY_f",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13209567",
          "body": "For public clarification, questions that are seeking answers outside of the formal public comment process can be posted in FedRAMP's Community Working Groups, such as in the Automating Assessment group's [General Q&A for Participation and Submission in the 20x pilot](https://github.com/FedRAMP/automating-assessment-cwg/discussions/27) thread.",
          "author": "pete-gov",
          "created_at": "2025-05-20T16:57:56Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AyF6P",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13131407",
      "body": "# General Observations / Feedback\r\n\r\nWe're excited about this new streamlined authorization approach and the potential it has to accelerate adoption of modern, innovative cloud services in the federal government while preserving visibility into the security posture of those services. \r\n\r\nAs we gear up to participate in the Phase One pilot, we've been reviewing all proposed KSIs and validations and have some general observations and feedback\r\n\r\n\r\n---\r\n\r\n### 1) KSIs in RFC-0006 and Continuous Monitoring\r\n\r\nThe proposed KSIs in this RFC ([RFC-0006](https://www.fedramp.gov/rfcs/0006/)) are independent from / unrelated to the KSIs that CSOs would presumably need to report on for continuous monitoring ([FedRAMP Continuous Monitoring KSIs](https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/blob/main/conmon_ksi_report.md#report-details)).\r\n\r\n- **a.** Are the proposed Phase One pilot KSIs only intended for initial authorization, or will they be an integral part of a broader continuous authorization-to-operate strategy?\r\n- **b.** Can we confirm that the ConMon KSIs are out of scope for this pilot, but may be required after authorization?\r\n\r\n---\r\n\r\n### 2) Validation IDs\r\n\r\nIn order to facilitate processing by FedRAMP and other stakeholder, it would be beneficial to establish unique IDs for each required validation.  We proprose the following (***KSI-{ksi_acronym}-{seq_num}***):\r\n```\r\nKSI-CNA-1, KSI-CNA-2, KSI-CNA-3, KSI-CNA-4, KSI-CNA-5, KSI-CNA-6, KSI-CNA-7, KSI-SC-1, KSI-SC-2, KSI-SC-3, KSI-SC-4, KSI-SC-5, KSI-SC-6, KSI-SC-7, KSI-IAM-1, KSI-IAM-2, KSI-IAM-3, KSI-IAM-4, KSI-LA-1, KSI-LA-2, KSI-LA-3, KSI-LA-4, KSI-LA-5, KSI-LA-6, KSI-CM-1, KSI-CM-2, KSI-CM-3, KSI-CM-4, KSI-CM-5, KSI-PI-1, KSI-PI-2, KSI-PI-3, KSI-PI-4, KSI-PI-5, KSI-PI-6, KSI-3IR-1, KSI-3IR-2, KSI-3IR-3, KSI-3IR-4, KSI-3IR-5, KSI-CE-1, KSI-CE-2, KSI-IR-1, KSI-IR-2, KSI-IR-3, KSI-IR-4, KSI-IR-5, KSI-IR-6\r\n\r\n```\r\n\r\n### 3) Validation Methodology Consistency\r\n\r\nWithout more prescriptive guidance around expected or acceptable validation methods for each KSI, there could be significant inconsistency in KSI validations from CSO to CSO. \r\n\r\n- Is the expectation that a 3PAO's attestation that a CSP has satisfied each KSI validation (along with the evidence, all in a machine-readable bundle) be sufficient for FedRAMP to make an authorization decision in this pilot?\r\n\r\n---\r\n\r\n### 4) Handling of \"Partially\" Validated KSIs\r\n\r\nHow will \"partially\" validated KSIs be handled? Does any occurrence of a \"partial\" on a KSI disqualify a CSP from obtaining the low authorization?\r\n\r\n---\r\n\r\n### 5) Qualitative Context for \"Partial\" Validations\r\n\r\nWhile the FedRAMP 20x Pilot Phase One requires submitted packages to provide **True/False/Partial** assertions for each KSI validation, is FedRAMP open to additional qualitative information in the package to provide context? \r\n\r\nFor example, if a CSO has a \"Partial\" status for KSI-CE validation 1, additional information could be provided (comments and supporting evidence) quantifying how compliant the CSO is. This kind of approach could be very useful for FedRAMP, allowing it to set different minimum thresholds for each security impact level. For example:\r\n\r\n- **a.** High impact systems - require 97.5% compliance with KSI-CE validation 1\r\n- **b.** Moderate impact systems - require 95% compliance with KSI-CE validation 1\r\n- **c.** Low impact systems - require 90% compliance with KSI-CE validation 1\r\n\r\n---\r\n\r\n### 6) Submitting Machine-Readable Packages with Traditional Artifacts\r\n\r\nWhile the submitted FedRAMP 20x packages must be machine-readable, is it acceptable for the package to also contain traditional evidentiary artifacts (e.g., screenshots, log samples, etc.) where appropriate?\r\n\r\nAdditionally, are traditional package documents (e.g., SSP including appendices, SAP, SAR, RET, SRTM) not required for pilot submissions?  What are FedRAMP's longer term plans for these package components going forward?\r\n\r\n\r\n---\r\n\r\n### 7) KSI-specific Observations and Feedback\r\n\r\n#### KSI-IAM Validation 4\r\n\r\nThis validation mandates the use of a \"just-in-time\" security model which likely exceeds existing FedRAMP requirements for low impact systems.  Is this a \"hard\" requirement for the pilot and is FedRAMP mandating this going forward?  My colleague already posted a question about this (https://github.com/FedRAMP/rfcs/discussions/18#discussioncomment-13094851) but interested to see if the community response to that comment aligns with FedRAMP's view on this.\r\n\r\n#### KSI-CNA\r\n\r\nSimilar to questions 4 and 5 above, if the KSI's are True/False, how does FedRAMP plan to treat a customer that meets a majority of the list but are not using container or serverless workloads or have a more legacy deployment not fully segmented into micro-services (as mandated by proposed validations 3 and 4 for this KSI)?\r\n\r\n#### KSI-3IR\r\n\r\nHow does FedRAMP (as an oversight body) plan to address/manage the risk acceptance needs for come cloud providers that are dependent upon non-ATO'd services for components of their system (as mandated in validation 1)?\r\n\r\n\r\n---\r\n\r\nWe look forward to working closely with FedRAMP on the Phase One pilot and contributing to the successful implementation of these validations.\r\n\r\n",
      "author": "Rene2mt",
      "created_at": "2025-05-13T13:31:05Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyGRY",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13132888",
      "body": "# KSI-IR Feedback\r\n\r\nSuggestions:\r\n## Remove \"Measure Mean Time To Detect (MTTD) and Mean Time To Resolution (MTTR) for incidents\r\n\r\nThese are both highly subjective, variable, context dependent, and gameable signals. Taking the mean of them makes them even more useless for helping drive better security outcomes.\r\n\r\nWhat does knowing the average of how long it takes a typical attack to be \"detected\" (e.g. \"we are being DDoSed\") tell you about how long it takes to uncover compromise by a APT group? If the time to resolution clock starts after \"detection\" what is \"resolved\"? (E.g. - If a server is compromised, do we mark resolved as when we think we have cleaned up the machine, after we have replaced the machine, or after we have completed analysis to ensure there was not further activity throughout our boundary?)\r\n\r\n## Relabel as `KSI-CP-IR Contingency Planning and Incident Response`\r\n\r\nRTO/RPO are applicable to a subset of incident types and are generally grouped as part of Contingency Planning (CP). Renaming this section to include the most relevant families would align better with what folks are probably used to.\r\n\r\n",
      "author": "pauldoomgov",
      "created_at": "2025-05-13T15:01:19Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AyHQd",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13136925",
          "body": "@pauldoomgov are there discussions about the relative value of mttd and mttr in non-fedramp industry forums?",
          "author": "wisecryptic",
          "created_at": "2025-05-13T22:07:33Z"
        },
        {
          "id": "DC_kwDOOxfoic4AyV93",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13197175",
          "body": "[\"MTTR Is (Still) Lying to You\" by Courtney Nash](https://resilienceinsoftware.org/news/1157532) provides a good overview of the topic with good references to explore.",
          "author": "pauldoomgov",
          "created_at": "2025-05-19T18:14:22Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AyHG7",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13136315",
      "body": "I'd like to reiterate a couple of points that have already been made:\r\n\r\n1. Having an intent statement or basic expectations in terms of evidence would go a long way.\r\n2. Validation IDs would be helpful and help with standardization; suggest a minor tweak to the above and suggest a 2-digit number for ease of sorting (e.g., KSI-CNA-01).",
      "author": "arimojiri",
      "created_at": "2025-05-13T21:02:11Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyHPR",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13136849",
      "body": "Comment on **KSI-PI-05**:\r\nMore clarity would be helpful for KSI-PI-05: _\"Document methods used to automatically evaluate implementations.\"_ Specifically the term \"_implementations_\" is vague. \r\n\r\nMy assumption is that this KSI validation is asking for a written description of how the CSP's evidence artifacts are gathered and automatically evaluated by the CSP. For example: \"Our KSI implementations are evaluated by scripts that call AWS Config and compare our AWS Config output to expected best practices.\" I'm not sure if that is consistent with what FedRAMP is hoping to see for this KSI validation. \r\n\r\nLastly, is this KSI validation intended to be a machine-readable validation or does this specific KSI validation require human readable written documentation?\r\n\r\nThanks,\r\nIsaac Teuscher (Paramify)",
      "author": "iteuscher",
      "created_at": "2025-05-13T21:54:18Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AyY_v",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13209583",
          "body": "For public clarification, questions that are seeking answers outside of the formal public comment process can be posted in FedRAMP's Community Working Groups, such as in the Automating Assessment group's [General Q&A for Participation and Submission in the 20x pilot](https://github.com/FedRAMP/automating-assessment-cwg/discussions/27) thread.",
          "author": "pete-gov",
          "created_at": "2025-05-20T16:59:27Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AyHRR",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13136977",
      "body": "some of the criteria raised a few questions\r\n\r\n### Key Security Indicators commentary\r\nTHANK YOU\r\n### Commentary on FedRAMP Low, Cloud Native)\r\nWill the eligibility criteria change after the pilot? Will this restrict some offerings from getting low if so? Or is the intent that any non cloud native offering that maintains its own datacenters etc. complex enough that it should automatically be rated as moderate?\r\n### Cloud Native Architecture\r\n\r\n> Use immutable containers and serverless functions with strictly defined functionality and privileges\r\n\r\n-  I understand the security advantages of immutable containers, but educate me here: Is the container architecture at a state where we want to say ALL containers are immutable and MUST be immutable? What about legacy architectures where a CSP makes the decision to wrap a legacy service into a container for uniformity or simplicity or management or as a transition step? Is this not included in Low because risk is deemed higher? Sometimes one-off testing is helpful with container instance access. Sometimes an SSH service is wrapped in a container that accesses other infra. Maybe these exceptions are so small and temporary that it won’t matter and the rule should be kept. But I would consider rewriting it: Cloud service providers MUST Use immutable containers by default, mutable containers by exception and…\r\nOr use the language for change management validation 2 which I think is better written\r\n\r\n> Design systems as logically segmented micro-services to minimize the attack surface and lateral movement if compromised\r\n\r\n- Same question for micro-services. Do we want to be prescribing this architecture? If so, I’m assuming this will be loosely defined to account for normal variance and future variance?\r\n### Service Configuration\r\n\r\n> Encrypt all network traffic\r\n\r\n- same question as above for \"encrypt ALL network traffic\". Would recommend a “by default” type language\r\n### Third Party Information Resources\r\n\r\n> Obtain a Software Bill of Materials (SBOM) for third party commercial software components\r\n\r\n- SBOM – how ready is industry to support this? SBOMs are big in federal, but they don’t go by this label in many private sector circles. Furthermore, there may be a possible issue with vendor privacy questions. I see a yellow flag here creating a process change from how this is currently done.\r\n\r\n> Confirm that third party information resources have a Secure Software Development Attestation with CISA\r\n\r\n- CISA attestation – same question. This seems like a fairly simple process, but it is an additional step and one that I don’t believe is enforced widely today. Is the intent to require this for all CSPs in the future beyond the scope of Low impact systems? Was the intent of the CISA attestation to be applied in Tier 2 supply chain providers (i.e. CSP’s vendor)? Is this serving as a simple proxy for a more onerous assessment step for Low only?\r\n",
      "author": "wisecryptic",
      "created_at": "2025-05-13T22:16:51Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyYLy",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13206258",
      "body": "@pete-gov we would like to seek clarification on whether the 20x KSI Measures are intended to streamline the expression of requirements while maintaining alignment with existing federal mandates, or if they reflect a shift away from prescriptive references altogether. If the former, should requirements such as FIPS-validated encryption and federal incident reporting obligations still be considered applicable to cloud service providers operating under the 20x Low baseline? The streamlined language is appreciated, but some clarity on how these foundational mandates fit into the revised framework would be helpful to ensure consistent interpretation and implementation.\r\n\r\nFor instance, the statement that systems must “encrypt all federal and sensitive information at rest” does not reference the longstanding requirement to use FIPS validated cryptographic modules, as mandated under FISMA and OMB Circular A-130. Without this reference, there is potential for confusion regarding acceptable encryption methods, especially among providers newer to federal compliance.\r\n\r\nIn terms of incident response, while it’s clear that timely action is emphasized, there is no mention of specific requirements like the one-hour incident reporting mandate to CISA. Explicitly including such requirements, or pointing to where they are maintained, could help ensure that service providers maintain alignment with federal expectations.\r\n\r\nWe recognize and support FedRAMP’s effort to modernize and simplify compliance through the 20x initiative. The examples discussed above—encryption standards and incident reporting obligations—are intended to illustrate the broader concern that essential, federally mandated requirements may be overlooked if they are not explicitly referenced or clearly tied into the KSI framework. These are just a few areas used for discussion purposes, but the underlying issue extends across the broader compliance landscape. Unless KSIs explicitly integrate or reference the full range of applicable federal mandates, there is a significant risk that cloud service providers and 3PAOs may miss critical obligations that are currently dispersed across numerous government policies, memoranda, and standards. \r\n\r\nEnsuring that KSIs serve as a centralized, authoritative touchpoint for both compliance expectations and implementation clarity would greatly support the success of the 20x model. We appreciate the opportunity to provide this feedback and look forward to continued collaboration on strengthening the FedRAMP program.",
      "author": "mhungate-schellman",
      "created_at": "2025-05-20T12:12:45Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AyYiG",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13207686",
          "body": "For public clarification, FedRAMP will maintain technical assistance, best practices, and other materials _separate_ from standards. This has been noted in more recent RFCs but was not formalized when RFC-0006 was originally published.\r\n\r\n- Standards are base requirements that can be applied in any environment and will change rarely\r\n- Best Practices support standards with methods, techniques, or examples and may change often\r\n- Technical Assistance supports standards with additional technical nuance to support decision making and may change often",
          "author": "pete-gov",
          "created_at": "2025-05-20T14:02:51Z"
        },
        {
          "id": "DC_kwDOOxfoic4AyY9E",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13209412",
          "body": "@pete-gov thank you for the clarification. That said, for CSPs and 3PAOs currently participating in 20x pilot assessments, we would welcome FedRAMP's thoughts on how KSIs are to be applied in practice during the pilot phase—particularly in areas where statutory or policy-driven obligations (e.g., FIPS-validated encryption or incident reporting timeframes) are not explicitly referenced in the KSI language.\r\n\r\nSpecifically, we ask:\r\n1. Should assessors and CSPs assume that these federally mandated requirements remain in scope even if they are not included in the KSIs?\r\n2. Will FedRAMP provide supplemental guidance during the pilot that explicitly maps relevant mandates to the appropriate KSIs or support materials?\r\n\r\nWe raise these questions to ensure alignment and avoid divergence across pilot assessments—particularly given that CSPs and 3PAOs may interpret the KSIs differently in the absence of clear technical references.",
          "author": "mhungate-schellman",
          "created_at": "2025-05-20T16:41:46Z"
        },
        {
          "id": "DC_kwDOOxfoic4AyY_H",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13209543",
          "body": "For public clarification, FedRAMP can respond to Q&A related to the 20x Phase One Pilot in the Community Working Groups. There is [a thread in the Automating Assessment CWG](https://github.com/FedRAMP/automating-assessment-cwg/discussions/27) that would be great for this. If you post there and @me I will ensure there is a timely response.\r\n\r\nSorry, it's a whole government thing, I know it's confusing, but from a rules standpoint the public comment process is an extremely different thing from our community working groups. On the public comment forum we generally need to just accept your statement above as a comment that these questions need to be addressed.",
          "author": "pete-gov",
          "created_at": "2025-05-20T16:54:27Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AyZao",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211304",
      "body": "Public comment from form\r\n\r\n5/5/2025 16:39:41\r\nSalesforce\r\nCloud Service Provider (CSP)\r\n\r\nWhat is the implication of if a KSI is not met? If each KSI is graded as a binary pass/fail, that leaves no room for nuance. Is something like \"Encrypt all network traffic\" the right threshold to set? Proposing that KSIs are not graded on a true/false for every validation, as this (in some spots) is an oversimplification.\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:11:12Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZaq",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211306",
      "body": "pub comment from form\r\n\r\n5/5/2025 16:40:23\r\nSalesforce\r\n\r\n\r\nCloud Service Provider (CSP)\r\nCMMC rolled out with a glossary and FAQ to define many terms. It would be nice to have FedRAMP define many ambiguous terms for us or examples to better guide CSPs. Proposing that FedRAMP groups official definitions of relevant terms in an official repository online.\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:11:23Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZau",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211310",
      "body": "public comment from form\r\n\r\n5/5/2025 16:41:00\r\nSalesforce\r\n\r\n\r\nCloud Service Provider (CSP)\r\nWhat if there's a critical legacy system integrated into our environment, which can't easily be rebuilt & re-deployed as an immutable container without major downtime or risk -- can we document an exception, or is this another strict pass/fail?\r\n\r\nWhat about immutable virtual servers? Why are we pushing containers specifically since not all container technologies/architectures are the same and some are more immutable/stripped down than others.\r\n\r\nProposing that the language is extended beyond immutable containers to include other types of technologies a CSP may be using.\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:11:36Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZax",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211313",
      "body": "public comment from form\r\n\r\n5/5/2025 16:41:26\r\nSalesforce\r\n\r\n\r\nCloud Service Provider (CSP)\r\nWhat counts as logically segmented? Using AWS as an example - does it make economical sense to put each micro-service on its own VPC, or are we looking at using hub-and-spoke style routing within a VPC to segment, or are NACLS/ACLS sufficient?\r\n\r\nProposing that the language clarifies what logically segmented means here.\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:11:52Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZaz",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211315",
      "body": "public comment from form\r\n\r\n5/5/2025 16:42:06\r\nSalesforce\r\n\r\n\r\nCloud Service Provider (CSP)\r\nWhat are we considering continuous for scanning here? Especially if we are using immutable containers. If they are immutable, then why would we need to scan them repeatedly?\r\n\r\nProposing that either 1) continuous is better defined or 2) that the need for \"continuous\" is dropped, as these assets are immutable and thus shouldn't change over time.\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:12:05Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZa1",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211317",
      "body": "public comment from form\r\n\r\n5/5/2025 16:43:06\r\nSalesforce\r\n\r\n\r\nCloud Service Provider (CSP)\r\nHow do we determine if information is \"sensitive\"? Is federal metadata no longer in scope as per RFC 0005?\r\n\r\nProposing that FedRAMP better defines what \"sensitive\" is - if this is the same definition as RFC 0005, then that should be mentioned.\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:12:17Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZa6",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211322",
      "body": "public comment from form\r\n\r\n5/5/2025 16:43:52\r\nSalesforce\r\n\r\n\r\nCloud Service Provider (CSP)\r\nProposing that FedRAMP requires that a SIEM OR A SIMILAR SYSTEM be deployed (such that smaller teams are not required to over-invest on a SIEM).\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:12:29Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZa8",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211324",
      "body": "public comment from form\r\n\r\n5/5/2025 16:44:36\r\nSalesforce\r\n\r\n\r\nCloud Service Provider (CSP)\r\n\"Centrally track and prioritize the remediation of identified vulnerabilities\"\r\n\r\nLarge CSPs see constant new vulns daily. \"Prioritize\" sure, but remediating 100% in tight SLAs is operationally impossible sometimes.\r\n\r\nWhat happens when a vendor's patch is delayed? Or a vuln awaiting a fix? Or if we can only apply fixes within certain operational maintenance windows?\r\n\r\nAny mention of a DR process is absent in this doc.\r\n\r\nProposing that the language is changed from \"remediation\" to \"mitigation\", as some vulnerabilities may undergo risk acceptance, risk transferrence, or deviation.\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:12:47Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZa9",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211325",
      "body": "public comment from form\r\n\r\n5/5/2025 16:45:18\r\nSalesforce\r\n\r\n\r\nCloud Service Provider (CSP)\r\nMinor nitpick, but would prefer to keep numbers out of KSI IDs.\r\n\r\nProposing that \"KSI-3IR\" becomes \"KSI-TPIR\".\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:13:02Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZbA",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211328",
      "body": "public comment from form\r\n\r\n5/5/2025 16:46:01\r\nSalesforce\r\n\r\n\r\nCloud Service Provider (CSP)\r\n\"Obtain a Software Bill of Materials (SBOM) for third party commercial software components\"\r\n\r\nSome vendors may not oblige this. Large CSPs are especially likely to run into this issue, as a large CSP may have dozens or hudnreds of external components in FedRAMP scope.\r\n\r\nIs there room to prioritize your most critical 3rd parties, vs. attestation from everyone in your ecosystem?\r\n\r\nProposing that this is changed to be obtain a SBOM from third-party commercial software components \"that make them available\".\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:13:22Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZbC",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211330",
      "body": "public comment from form\r\n\r\n5/5/2025 16:46:32\r\nSalesforce\r\n\r\n\r\nCloud Service Provider (CSP)\r\n\"Confirm that third party information resources have a Secure Software Development Attestation with CISA\"\r\n\r\nDoes this include the 4 specific exception granted in the Secure Software Development Attestation form?\r\n1. Software developed by Federal agencies;\r\n2. Open source software that is freely and directly obtained directly by a Federal agency;\r\n3. Third-party open source and proprietary components that are incorporated into the\r\nsoftware end product used by the agency; or\r\n4. Software that is freely obtained and publicly available\r\n\r\nProposing that the exceptions are taken into account for this validation.\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:13:35Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZbH",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211335",
      "body": "public comment from form\r\n\r\n5/5/2025 16:47:01\r\nSalesforce\r\n\r\n\r\nCloud Service Provider (CSP)\r\n\"Measure Mean Time To Detect (MTTD) and Mean Time To Resolution (MTTR) for incidents\"\r\n\r\nThis could be harder than it sounds at scale. Defining \"incident\" is non-trivial -- does every low-severity event count?\r\n\r\nProposing that FedRAMP provides guidance on what an incident is.\r\nIncident Response\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:13:48Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZbL",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211339",
      "body": "public comment from form\r\n\r\n5/7/2025 3:04:04\r\nCSP-AB\r\nCloud Service Provider (CSP)\r\n\r\nCloud Native Architecture:\r\nIn general, these seem to describe solutions with intent. Should they be written for the intent and provide examples of the \"how\"? For example, \"1. Protect from DOS attacks\" and leave the how up to CSP, but provide example. \"5. Enforce logical traffic flow. E.g., Setting up security groups and network access control lists\"\r\n\r\n\"Identity and Access Management: Use a least-privileged, role-based, and just-in-time security model\"\r\nInstead say: \"Use a least-privileged, role-based, and/or just-in-time security model\"\r\n\r\nMonitoring, Logging, and Auditing: Perform Infrastructure as Code (IaC) and configuration scanning.\r\nWe concerned that this could lead to an increase in the number of scans required to be submitted to agencies. These agencies rarely use IAC and often do not understand its scanning results. This could create confusion and inefficiencies in our processes. The configuration scanning of CSP infrastructure provided to AOs should be directly linked to a security objective, enabling them to accurately assess the associated risks.\r\n\r\nThird Party Information Resources: Obtain a Software Bill of Materials (SBOM) for third party commercial software components.\r\n1. There is no universally accepted standard for SBOMs, which can lead to inconsistencies and difficulties in interpretation and use across different platforms and stakeholders.\r\n2. Applications are frequently updated, making it difficult to maintain an up-to-date SBOM. The continuous integration and deployment (CI/CD) pipelines used can result in rapid changes to the software components.\r\n3. Solutions often rely on a complex web of dependencies, including third-party libraries and services. Tracking and documenting all these dependencies accurately can be cumbersome\r\n4. SBOM is not an accurate depiction of risk\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:14:08Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZbP",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13211343",
      "body": "public comment from form\r\n\r\n5/7/2025 13:35:24\r\nEgnyte\r\nCloud Service Provider (CSP)\r\n\r\nEgnyte will be FedRAMP Ready, Moderate Impact Level, in June 2025\r\n- Will having an ATO Low be detrimental to us?\r\n- How soon could we be moved to Moderate if we already have our full Body of Evidence and are FedRAMP Moderate Equivalency approved (by DIBCAC)\r\n- Currently, FedRAMP Low Authorized status' are not published on the FedRAMP Marketplace. Will this still be the case if we achieve FedRAMP Low Authorization through the Phase One process.\r\n- What is the process for an agency to grant us an ATO if we have a Phase One ATO? I am assuming agencies will still have to have an AO approve.\r\n- If/When we achieve FedRAMP Moderate Impact Level Authorization under the Phase One program, what is the process for the agency to issue us an ATO. i.e. Will the agencies still have to perform their security assessment before issuing the ATO?\r\n- Will there be a separate section on the Marketplace, (in addition to FedRAMP Ready, FedRAMP In Process, and FedRAMP Authorized sections) for Phase One Authorization listings?\r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-20T20:14:28Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AycF8",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13222268",
      "body": "Organization: jellyfish.co\r\nCloud Service Provider\r\n\r\n# Holistic Feedback\r\n\r\n\r\nThank you for the work on this initiative. I have provided detailed comments after reading through the RFC in its entirety. For context, my perspectives are from that of a lead security engineer concerned with the security of my org, not in compliance activities (although I have experience supporting there). I also have experience in other standards, like Uptane. As such, please consider that engineering-lean in my notes.\r\n\r\n\r\nImportant things:\r\n\r\n\r\n0. Most importantly: as-is this proposal is a bit awkward. It attempts to be lightweight (vs. traditional FedRAMP) by making requirements flexible but by being so ambiguous almost makes it harder. This basically puts the complete onus on auditors to understand the intention and validity of organization's evidence, but does not define the rationale for each validation criteria or requirement.\r\n1. Relatedly, I have seen only two kinds of successful \"certification\" programs: 1) Ones that allow some flexibility in implementation but require auditors to review well-defined controls and push on orgs to understand misses (e.g. \"traditional\" FedRAMP) or 2) very well-defined technical requirements where verification is done (often using tooling) to ensure conformance (see NIST's many resources on \"conformance testing\"). FedRAMP 20x currently sits in the middle, which I believe is a mistake. I'd suggest it becoming more like the conformance testing model.\r\n\r\n\r\nSmaller things:\r\n\r\n\r\n1. The KSIs are presented with \"Validation\" criteria. However, I suggest renaming this to \"Verification\" criteria, as you seem to be looking to answer the question \"Are you building it right\"? (verification) not \"Are you building the right thing?\" (validation).\r\n2. I agree with others that IDs should exist per validation criteria to make it much easier to build automation and cross-reference the standard.\r\n\r\n\r\n# Specific Feedback\r\n\r\n\r\n## Introduction Section\r\n\r\n\r\n> Modern cloud services often use automated or code-driven configuration management and control planes to ensure predictable, repeatable, reliable, and secure outcomes during deployment and operation.\r\n\r\n\r\nYes, but also: portions of such deployments almost always include a non-negligible amount of ad-hoc changes that may affect the security posture of the organization, and yet may not be evident simply by examining code-driven config management or equivalent. As one example, an org who diligently uses terraform + AWS to manage all infrastructure will eventually make ad-hoc changes using the AWS console during incidents, or even while repairing issues with terraform.\r\n\r\n\r\n> Consequently, FedRAMP asserts that the majority of a service security assessment can take place continuously via automated validation for simple cloud-native services if the need for a traditional control-by-control narrative approach is removed.\r\n\r\n\r\nMaybe, but this does come with risk. While you can try to locate manual changes by relying on extra automated tooling to inspect an environment, this is going to be challenging to ensure it is done properly. Infrastructure is often quite distributed, and it would be easy for organizations to \"plug in\" only a portion of their infrastructure such that scans \"look good\".\r\n\r\n\r\nThis also puts a lot of faith in the tooling itself that will be used to generate final packages. For orgs with even slightly elaborate infrastructure, the ability to completely self-manage such tooling is probably unreasonable, and third-parties will be increasingly used to generate evidence packages. This is not strictly a problem, but could encourage perverse incentives. Specifically, it may encourage third-parties to build rules and detections that \"look complete\" rather than actually are. Missed evidence is much less bad than \"too much evidence\" from many orgs perspectives.\r\n\r\n\r\n## Key Security Indicators\r\n\r\n\r\n>  These capabilities are designed to provide a concrete approach to evaluating cloud security risks that can often be automatically derived from technical configurations and resolved to true or false.\r\n\r\n\r\nAs has been noted several times already, I strongly recommend against a boolean narrative here. If the goal is to stay lightweight and flexible, reducing capabilities down to true/false will negate the usefulness of the process and encourage \"gaming\" answers. It also implicitly defines security improperly: security is impact x likelihood (i.e. a numeric value on a gradient), not a \"secure/insecure\" situation.\r\n\r\n\r\nWhile the simplicity of true/false assertions is nice, given the limitations, I'd suggest switching to a simple maturity scale and threshold for \"clearing\". This will make it more useful (an org can more clearly see how mature they are and where they need to go) and also makes it more flexible (\"Moderate\" authorization could, in theory, use the same KSIs with a different threshold).\r\n\r\n\r\n> To maximize innovation, this standard does not propose validation, evidence, or assessment expectations for Key Security Indicators. Instead, minimum expectations for validation, evidence, and assessment will be determined during active FedRAMP 20x pilots in collaboration with cloud service providers, third party assessment organizations, and federal agencies.\r\n\r\n\r\nThis sounds nice but is not satisfying. Without *any* kind of expectation we should expect assessments to be gamed and auditors to be hugely confused. Auditing is a well-known field and I'd encourage more interactions with such auditors during this process to understand what is reasonable. It's not at all clear to me how anyone could audit something that has, essentially, not a single requirement.\r\n\r\n\r\n## Key Security Indicators (FedRAMP Low, Cloud Native)\r\n\r\n\r\n> Using primarily cloud-native services from the host provider\r\n\r\n\r\nThis is too ambiguous for a requirement. What does it mean to \"primarily\" use cloud-native services from the host provider?\r\n\r\n\r\nAlso, what is a \"host provider\"? This isn't defined anywhere. I'm assuming that's the cloud service offering provider?\r\n\r\n\r\n> Using only FedRAMP authorized external services\r\n\r\n\r\nWhat does this mean? Does this refer to core infrastructure or any service that might be relevant to your application (e.g. say you use some analytics SaaS provider - do all of those need to be FedRAMP authorized?)\r\n\r\n\r\n> Service is provided only via the public internet (browser and/or APIs)\r\n\r\n\r\nI'd suggest clarifying this further. Does this mean models where you allow VPC-peering (for example) between orgs as *one possible* model of network connectivity are not allowed? If so, that seems to arbitrarily limit security capabilities of the cloud service in an unnecessary fashion.\r\n\r\n\r\nIs the intention here to limit what connection types are in-scope (i.e. to narrow this to classic \"SaaS\" providers)? If so, it might be better to define this as simply the \"Internet Protocol\".\r\n\r\n\r\nIf the intention is instead to indicate \"on-prem\" deployments are out-of-scope, I would suggest re-wording this to define where primary services are *deployed* not how network traffic is managed.\r\n\r\n\r\n### Cloud Native Architecture\r\n\r\n\r\n> Have denial of service (DoS) protection\r\n\r\n\r\nUnclear what this means and what it's trying to get at. This could mean anything from: \"your service is resilient to short-bursts of high traffic and can reliably deter huge DDoS attacks\" to \"in theory you can add a rule to your security group and block a malicious IP\". This really needs to be presented in terms of what outcomes you are asserting.\r\n\r\n\r\n> Configure firewalls/proxy servers to limit inbound and outbound traffic\r\n\r\n\r\nThis is practically useless as-is. I could just choose to block some arbitrary incoming and outgoing port and I've magically met this requirement.\r\n\r\n\r\n> Use immutable containers and serverless functions with strictly defined functionality and privileges\r\n\r\n\r\nUnclear what \"use immutable containers\" means. Clearly even in container-driven architectures you eventually have to update the container images. Does that count as immutable?\r\n\r\n\r\nAlso unclear what \"use serverless functions\" means. This feels quite arbitrary and doesn't necessarily imply anything about the security posture of a service.\r\n\r\n\r\nFinally, this is written too ambiguously in terms of coverage. If I have one immutable container and one serverless function, even if largely irrelevant to the product, do I meet this requirement?\r\n\r\n\r\n> Design systems as logically segmented micro-services to minimize the attack surface and lateral movement if compromised\r\n\r\n\r\nI like the point of this: encourage segmentation and defense-in-depth but as-is it reads as dictating architecture unnecessarily. Also, it's unclear what a \"micro-service\" actually is.\r\n\r\n\r\n> Use cloud native virtual networks and related capabilities to enforce logical traffic flow controls\r\n\r\n\r\nAgain, too ambiguous to be useful. I could simply create two virtual networks (a production and test one, for example) and claim I have the capabilities to enforce flow controls.\r\n\r\n\r\n> Execute continuous scanning of cloud native system components\r\n\r\n\r\nTotally unclear what this means. What is a \"cloud native system component\"? What does \"scanning\" mean? What does \"continuous\" mean? Do I need to do anything with the results of the scan?\r\n\r\n\r\n> Use high availability design principles to maximize uptime\r\n\r\n\r\nToo ambiguous to be useful. I'd suggest defining this in terms of \"an ability to measure uptime + enough historical data to ensure uptime is greater than <whatever the government expects>.\"\r\n\r\n\r\n### Service Configuration\r\n\r\n\r\n> Harden and review network and system configurations\r\n\r\n\r\nToo unclear what this means. Also, conflating \"hardening\" and \"reviewing\" in one validation criteria is confusing and will be challenging for auditors. Providing evidence of \"review\" implies a partially manual process that doesn't lend itself to automation vs. hardening which might.\r\n\r\n\r\n> Encrypt all network traffic\r\n\r\n\r\nThis needs to be scoped down. As-is this implies you need encrypted traffic (BTW: how should we encrypt?) everywhere. What about cases where multiple local services exist on the same machine? Do you really need to encrypt local-only traffic? What about inside tightly controlled virtual clouds (for example: using load balancers to \"break\" TLS before sending to a series of boxes in a cluster is a common architectural model), is that allowed?\r\n\r\n\r\nClearly \"use TLS 1.2/1.3 for all network traffic that leaves your service's immediate network boundary\" is apt.\r\n\r\n\r\n> Encrypt all federal and sensitive information at rest\r\n\r\n\r\nUsing what? This section noted \"approved cryptography\" but where is that defined?\r\n\r\n\r\n> Manage configuration centrally\r\n\r\n\r\nWhat does this mean? What configuration are we referring to exactly? Infra config? App configs? Service configs (e.g. SSO configs)?\r\n\r\n\r\n> Enforce system and component integrity through cryptographic means\r\n\r\n\r\nUnclear what this means in practice. What is a \"system\"? What is a \"component\"?\r\n\r\n\r\n> Use a key management capability to execute regular rotation of digital keys\r\n\r\n\r\nHow many keys? As-is this implies rotating a single key is sufficient to meet this requirement.\r\n\r\n\r\n> Use a consistent, risk-informed approach for applying security patches\r\n\r\n\r\nSecurity patches to what?\r\n\r\n\r\n### Identity and Access Management\r\n\r\n\r\n> Enforce phishing-resistant multi-factor authentication (MFA)\r\n\r\n\r\nFor whom? Folks in the orgs? Users of the service itself?\r\n\r\n\r\nAlso, for what? Everything?\r\n\r\n\r\n> Enforce strong passwords\r\n\r\n\r\nThis seems very hard to automate evidence for, given passwords are rightfully assigned out-of-band often.\r\n\r\n\r\n> Use secure API authentication methods via industry standard protocols\r\n\r\n\r\nWhat protocols? \"Industry standard\" doesn't mean anything. At minimum we should point to NIST guidance or something.\r\n\r\n\r\n> Use a least-privileged, role-based, and just-in-time security model\r\n\r\n\r\nFor whom does this apply? This will also be hard to validate effectively. If the expectation is that all identities have zero/minimal permissions, and must be granted just-in-time for any given operation, most orgs will probably just create a single \"Admin\" permission folks will be requesting all the time. This could easily become riskier than allowing more freedom for orgs to well-scope permissions and make tradeoffs in usability vs. security.\r\n\r\n\r\n### Monitoring, Logging, and Auditing\r\n\r\n\r\n> Operate a Security Information and Event Management (SIEM) system for\r\ncentralized, tamper-resistent event, activity, and change logging\r\n\r\n\r\nWhat needs to be fed into this SIEM?\r\n\r\n\r\n> Regularly review and audit logs\r\n\r\n\r\nDoes this imply a human needs to do this or is using/writing detection rules sufficient?\r\n\r\n\r\n> Rapidly detect and remediate or mitigate vulnerabilities\r\n\r\n\r\nVulnerabilities in what? Is this referring to known vulnerabilities in supply chain components or does it also refer to architectural weaknesses or vulnerabilities?\r\n\r\n\r\nWhat does rapidly mean?\r\n\r\n\r\n> Perform authenticated vulnerability scanning on publicly accessible components\r\n\r\n\r\nThis is probably too general. Orgs could set up single-rule authenticated scans to meet this requirement but essentially test nothing of interest.\r\n\r\n\r\n> Perform Infrastructure as Code (IaC) and configuration scanning\r\n\r\n\r\nScanning for what purpose?\r\n\r\n\r\n> Centrally track and prioritize the remediation of identified vulnerabilities\r\n\r\n\r\nThis seems partially redundant with item 3 from this section. Also, which vulnerabilities is this referring to? Supply chain? Code? Infrastructure? Config? If all of them, why do they have to be centrally managed?\r\n\r\n\r\n### Change Management\r\n\r\n\r\n> Log and monitor system modifications\r\n\r\n\r\nWould be nice to better define what kinds of modifications need to be logged?\r\n\r\n\r\n> Execute changes though redeployment of version controlled immutable resources rather than direct modification wherever possible\r\n\r\n\r\n\"Wherever possible\" language makes this a useless validation criteria.\r\n\r\n\r\n> Evaluate the risk and potential impact of any change\r\n\r\n\r\nThis doesn't seem particularly apt to be automatable. It might be better to instead require evidence of a process.\r\n\r\n\r\n### Policy and Inventory\r\n\r\n\r\n> Have policies outlining their security objectives\r\n\r\n\r\nWhat is \"their\" in this context? What's a \"security objective\"?\r\n\r\n\r\n> Build security considerations into the Software Development Lifecycle (SDLC) and aligning with Secure By Design principles\r\n\r\n\r\nThis is very ambiguous. I'd suggest pointing to example standards and requiring SDLC docs or processes to reference those standards, which will make this more automatable.\r\n\r\n\r\n> Document methods used to automatically evaluate implementations\r\n\r\n\r\nImplementations of what?\r\n\r\n\r\n> Have a dedicated staff and budget for security\r\n\r\n\r\nIs one intern and a $10 budget sufficient?\r\n\r\n\r\n\r\n\r\n### Third Party Information Resources\r\n\r\n\r\n> Regularly confirm that services storing Federal information are all FedRAMP authorized and securely configured\r\n\r\n\r\nWhat does \"securely configured\" mean?\r\n\r\n\r\n> Identify and prioritize potential supply chain risks\r\n\r\n\r\nHow? Is there a standard we can point to?\r\n\r\n\r\n> Obtain a Software Bill of Materials (SBOM) for third party commercial software components\r\n\r\n\r\nWhy limit this to commercial components? Also, does this refer purely to third-party commercial software we use by deploying a \"binary\"-esque package or does it include services we interact with over HTTP, for example?\r\n\r\n\r\n> Implement zero trust design principles\r\n\r\n\r\nMuch of this is already covered in other parts of this KSI RFC. I propose removing this since it's so ambiguous and there's no real standard for it as far as I can tell. Also, unclear how it relates to third party services specifically.\r\n\r\n\r\n### Cybersecurity Education\r\n\r\n\r\n> Require role-specific training for high risk roles\r\n\r\n\r\nWhat's a high-risk role?\r\n\r\n\r\n\r\n\r\n### Incident Response\r\n\r\n\r\n> Maintain a log of incidents and periodically review past incidents for patterns or vulnerabilities\r\n\r\n\r\nI suggest separating \"maintaining\" a log (easy to obtain evidence for) from \"review past\" incidents which is necessarily a manual step.\r\n\r\n",
      "author": "JosiahOne",
      "created_at": "2025-05-21T16:12:24Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Aycu4",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13224888",
          "body": " As someone leading both security operations and compliance strategy within a live 20x pilot, I read your perspective with deep appreciation—and also with a recognition of where this new model intentionally diverges from the assumptions we’ve long held in the FedRAMP community - at least in my experience. \r\n\r\n**Security Is a Paradox**\r\n\r\nCybersecurity isn't about technology - it's about risk. From a security-minded perspective, it’s important to acknowledge a fundamental truth: some of the most well-funded, tool-saturated organizations still suffer the most damaging breaches. Capital One, SolarWinds, Rockstar Games—the list goes on. If security were purely a function of technical posture, budgets, and checklists, we’d have solved this already. But we haven’t.\r\n\r\nWhy? Because complexity itself can and in a lot of cases becomes a threat vector.\r\n\r\nWhen you overload a system with CSPMs, SIEMs, XDRs, audit trails, endpoint tools, custom rules, and manual exceptions, you don’t get clarity—you get noise. You get tool fatigue. And paradoxically, this breeds fragility. The attack surface grows inward, not outward.\r\n\r\nYears of DefCon has taught many of us that attackers will always be ahead. The goal isn’t to prevent every incident—it’s to minimize blast radius when one occurs. FedRAMP 20x recognizes this and builds a posture that emphasizes impact reduction, trust boundaries, and resilience, not performative compliance.\r\n\r\n**FedRAMP Has Always Been About Practical Tradeoffs**\r\n\r\nIf you go back and listen to Paramify’s interview with Dave Fairburn Jr., often regarded as the father of FedRAMP, you’ll hear how the original FISMA-based model was so heavy it became a paperweight. That was the real FedRAMP once—and it had to be reduced to become usable.\r\n\r\nIn many ways, 20x is doing for today what Dave did then: compressing the signal, cutting the noise, and introducing a path that balances realism with risk awareness. That’s not regression. That’s the DNA of FedRAMP continuing to evolve.\r\n\r\n**Binary Doesn’t Mean Shallow — It Means Scalable**\r\n\r\nYou raised valid concerns about true/false assertions being too simplistic for a nuanced risk model. I agree in principle. But in practice, we’ve always made binary decisions:\r\n\r\n    “Is TLS enabled?”\r\n\r\n    “Are admin sessions scoped?”\r\n\r\n    “Is outbound egress restricted?”\r\n\r\nThese binary KSIs aren't oversimplifications—they’re structurally scannable indicators. They're not asking how well you’ve implemented something—they're asking whether you've met the floor of risk-aligned readiness. That floor is essential to scale trust across agencies and providers alike, especially in the low-impact domain.\r\n\r\n**The Goalpost Has Always Been Too High**\r\n\r\nAnyone who has worked in FedRAMP knows the 18 NIST control families represent only the minimum required implementation. The truth? That “minimum” is often well beyond what most practical cloud-native systems can operationalize without massive overhead.\r\n\r\nSo in this pilot, we’re really only talking about Low systems, where:\r\n\r\n    No PII is processed\r\n\r\n    No high-risk functions exist\r\n\r\n    No sensitive integrations are active\r\n\r\nThis is where we should be innovating—and 20x finally enables that by reducing scope, minimizing overhead, and allowing systems to demonstrate alignment through their architecture, not just their documentation. Moderate I assume will take lessons learned and apply the required deltas to meet the increased risk for the data processed, stored and transmitted at the moderate impact level as per FIPS-199. \r\n\r\n**Spirit > Letter — As It Always Has Been**\r\n\r\nThe spirit of the law as we all know is present in audits, supposes there are multiple ways to do a thing. That is exactly the lens  I think 20x is trying to actualize. And while many of your points (on ambiguity, clarity, auditability) are spot on—and I hope to see those addressed in future refinements—let’s not lose sight of the core innovation:\r\n\r\n20x shifts us from “tell me how secure you are” to “show me the evidence your system was built securely.” (in whatever way you can).\r\n\r\nThat is a better model. It invites agility, automation, and honesty. Frankly it enables Security, DevOps, DevSecOps, SREs, etc to build their own evidence system as it suits them and the environment, resources etc available to them. For instance as a <50 person company we do not have a GRC team, or compliance analysts etc. The conformance type of testing model is precisely what made FedRAMP inaccessible to 80% of the cloud vendor market.\r\n\r\n**Final Thought**\r\n\r\nWe’re early. This is still a pilot. But we’ve already seen in our deployment and others that you can build a Low-authorized system using entirely AWS-native services, Terraform IaC, and strict boundary definitions—without compromising security.\r\n\r\nI believe that’s where 20x shines most: not in defining perfection, but in enabling **good-enough** (nails on chalkboard to SecOps I know) security with maximum architectural clarity and minimum complexity.\r\n\r\nAnd if the community agrees that we still need clearer terminology, better auditor guidance, and tighter evidence definitions—I’m with you. I tell my SecOps guys it's just growing pains in a space that badly needs to grow.",
          "author": "aburroughs",
          "created_at": "2025-05-21T20:13:53Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AycxU",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13225044",
      "body": "**3PAO’s role in the pilot: Will they validate ONLY the KSIs?**\r\n•\tIf yes, does the 3PAO only validate the KSIs and NOT the NIST controls?\r\n•\tIf yes, does the 3PAO generate a report attesting that they validated it?\r\n•\tWhat kind of submission(s) will be necessary from 3PAOs to be authorized?\r\n**“To qualify…provide a machine readable package…for a significant portion of the FedRAMP Key Security Indicators (KSIs)…”**\r\n•\tWhat does the “package” consist of? Just evidence?\r\n•\tWhat if KSI evidence cannot be provided in machine-readable format? Rejected?\r\n•\tWill screenshots, tickets, SOC2 reports, etc. be accepted (not machine-readable)?\r\n**New requirements/controls in RFC 0006 for Low baseline (e.g., AC-23, AT-6).**\r\n•\tWas that the intention?\r\n**Is this “conditional authorization” a new type of ATO FedRAMP is rolling out?**\r\n•\tWhat happens to currently Low authorized CSPs?\r\no\tShould they forgo their Low assessment and do the KSI model? OR\r\no\tShould they continue with their Con Mon?\r\n**RE: cloud native architecture**\r\n•\tWhat is the expectation of defense in depth to which a CSP must adhere?\r\n•\tDoes the FedRAMP Subnetting Whitepaper still apply as guiding principle?\r\n**New KSI states that vulnerability scans now target publicly accessible components.**\r\n•\tPreviously, ALL assets were subject to authenticated vulnerability scanning- correct?\r\no\tUnscanned internal components opens the door to significant security risk.\r\n**Do SBOM principles apply to containerized images pulled into registries from external supply chain providers (e.g. RapidFort, Chainguard)?**\r\n•\tMany CSPs leverage this service as a central repository\r\n•\tCSPs would be burdened instead of the supply chain provider reporting SBOM status of all cataloged images provided to Federal customers as standard oversight practice.\r\n**No Zero-Trust Architecture (ZTA) applied to IA:**\r\n•\tAs a community we should be eliminating inherently unsafe VPN services.\r\n**Wiz and AWS Audit Manager are already doing automated self-auditing**\r\n•\t“Close” to what 20x is looking for BUT these are fundamentally different systems.\r\no\tWiz output is DIFFERENT than AWS Audit Manager output.\r\n•\tWhat is the expected data model to follow and how will FedRAMP ingest results?\r\n•\tRight now, there is no standard or output expectations for automated systems.\r\n•\tAcceptance criteria for post-automation workflow package(s) and deliverables?\r\n**KSI and Modernization**\r\n•\tWho is responsible for curating the standards and adapting to ecosystem changes?\r\n**KSIs and Shared Service Model**\r\n•\tShould there be more focus on CSPs and supply chain(s) rather than CSP consumers?\r\n•\tISC2’s CCSP focuses much of its content on understanding shared service model.\r\n•\tFedRAMP has yet to adopt this, impacting strength for evaluating security inheritance.\r\n•\tThere is no KSI that focuses on the shared service model.\r\n•\tCSPs complain that FedRAMP is expensive. Understood- resulting from re-scrutinizing a subset of inherited controls and no due diligence pressure on the underlying CSP to fix.\r\no\tExample: virtual hosts provided by underlying CSPs for container services.\r\no\tMost underlying CSPs provide images that customers have no ability to edit.\r\no\tONLY customer responsibility is to ensure they are hitting “update” button on time\r\n•\tWhile aggressive scans are run on these nodes and instruction is given to fix issues or work with the CSP if no capability to edit exists, FedRAMP does not ensure suppliers fix.\r\n•\tDeeper suppliers providing secure images (e.g. RapidFort, Chainguard) are not FedRAMP accredited or audited; yet, can be the most fundamentally important contributor to the security of the ecosystem.\r\n**3PAOs with Automation or GRC systems.**\r\n•\tKSIs can be met through an automated \"SRTM\"\r\no\tRequest for Information (RFI) front-end from 3PAOs allows for submission of implementation state and evidence (as applicable)\r\no\t3PAO would evaluate the uploaded KSI(s) responses and artifacts\r\n\tCompleted SRTM: machine-readable KSI report for FedRAMP 20x.\r\n\tOutput results into GitHub as markup language\r\n\tOutput of automation scripts is factored into the overall markup report\r\n•\tReduces the need for external or zipped artifacts.\r\n•\tGitHub already used and understood by FedRAMP\r\n•\tMachine readable output in a format FedRAMP is using.\r\no\tThis process can accelerate the FedRAMP program exponentially and meets all the fundamental goals of the RFC.\r\no\tWorkload for FedRAMP is highly minimized.\r\n\tFedRAMP gets markup report (Github) with 3PAO evaluation with artifacts.\r\n\tFedRAMP ONLY needs to review the report and approve the report.\r\no\tGithub does everything you need.\r\n\tPreserves integrity of the reports (all changes are tracked)\r\n\tA bottomless repository\r\n\tIntegrates with every automation known to man.\r\n•\tScripts used can also be opened as a community pool.\r\no\tProcess can pre-reject packages if they fail KSIs so FedRAMP saves time.\r\n\t“Approve” button OR “Reject” button with some rationale input.\r\no\tVisual dashboard showing FedRAMP what the queue looks like.\r\n\tFedRAMP can log in themselves, see dashboards, and mark certain CSPs as priority.\r\n**KSI-Specific Questions:**\r\n•\tKSI-CNA, Part 2: Configure firewalls/proxy servers to limit inbound and outbound traffic.\r\no\tIs there a priority to focus on internal traffic, external to internal traffic, or both?\r\n•\tKSI-IAM, Part 2: Enforce strong passwords.\r\no\tPasskeys, biometrics, hardware security keys, SSO, and behavioral biometrics are replacing traditional passwords. Consider enforcing strong passwords by migrating beyond traditional passwords with modern authentication methods.\r\no\tWhat are the parameters for “strong passwords” (upper/lower, alphanumeric, special character, length, etc.)?\r\n•\tFor KSI-MLA, Part 2: Regularly review and audit logs.\r\no\tWhat is the time frame meant by “regular”?\r\n•\tKSI-SC, Part 1: Harden and review network and system configurations.\r\no\tIs there a specific standard required to be used (CIS, STIG, etc.)?\r\n•\tKSI-SC, Part 2: Encrypt all network traffic.\r\no\tDifficult for internal-originating DNS queries as well as Certificate Revocation List distribution. Both of these common data flows are unencrypted.\r\n\tCloud platforms (AWS, Azure, GCP) don't offer a cloud-native method for encrypting these data flows- only installing an on-prem solution such as BIND or a Windows Server running the DNS role.\r\n\tEncrypting these data flows isn't a new requirement- required by Executive Orders as well as NIST SP 800-207\r\n•\tStill not implemented by any FedRAMP CSP.\r\n•\tNumerous KSI’s – Encryption (FIPS 140)\r\no\tDo the encryption requirements (FIPS not noted) need to be FIPS 140-2 and/or FIPS 140-3 (and no historical)?\r\n",
      "author": "drewforbes",
      "created_at": "2025-05-21T20:27:44Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ayf9k",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13238116",
          "body": "For public clarification, questions that are seeking answers outside of the formal public comment process can be posted in FedRAMP's Community Working Groups, such as in the Automating Assessment group's [General Q&A for Participation and Submission in the 20x pilot](https://github.com/FedRAMP/automating-assessment-cwg/discussions/27) thread.",
          "author": "pete-gov",
          "created_at": "2025-05-22T18:43:07Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ayc0D",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13225219",
      "body": "GovRAMP  recommends a data-driven approach to formulating the KSIs. For example:\r\n\r\n- Reassessing NIST 800-53 controls linked to each Key Security Indicator (KSI) to leverage the associated MITRE ATT&CK risk protection values. This enables a data-driven prioritization of the most impactful security measures.\r\n\r\n- Applying a weighted scoring model to KSIs using the MITRE ATT&CK Framework to prioritize the most critical cyber threats and defenses.\r\n\r\n",
      "author": "Leah-GovRAMP",
      "created_at": "2025-05-21T20:50:33Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AydfF",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13227973",
      "body": "In the RFC it says SOC2 or a Federal ATO a requirement, however, on the website it says there are no specific eligibility requirements. \n\nWe do not have either but have gotten several CSPs through the FedRAMP ATO process and handle their ConMon and would like to participate.",
      "author": "ajay-stratus",
      "created_at": "2025-05-22T01:44:58Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ayf9l",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13238117",
          "body": "For public clarification, questions that are seeking answers outside of the formal public comment process can be posted in FedRAMP's Community Working Groups, such as in the Automating Assessment group's [General Q&A for Participation and Submission in the 20x pilot](https://github.com/FedRAMP/automating-assessment-cwg/discussions/27) thread.",
          "author": "pete-gov",
          "created_at": "2025-05-22T18:43:19Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AygA-",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13238334",
      "body": "## Public comment received via email:\r\n\r\nWe commend GSA on the initial set of Key Security Indicators (KSIs) and the approach for continuous\r\nmonitoring as proposed in FedRAMP 20x. A key benefit of FedRAMP 20x will be increased transparency\r\nand choice in the federal cloud services marketplace, as well as the expedited arrival of new market\r\nsolutions. The choice of viable solutions can be enhanced if vendors can meaningfully differentiate their\r\nsolutions for security and monitoring, thereby increasing competition, so that agencies can make risk-\r\ninformed authorization decisions tailored for their needs and environments.\r\n\r\nDrawing from Deloitte’s experience throughout the progression of FedRAMP since inception (supporting\r\ncloud service providers (CSPs), federal agencies, and as a third-party assessment organization or 3PAO), as\r\nwell as insights from implementation of outcomes-based approaches to security monitoring in the\r\ncommercial sector, we believe even greater flexibility in the KSIs will promote even more innovation and\r\nsecurity as FedRAMP 20x moves forward. To achieve this, we recommend the community build on the\r\n\r\nFedRAMP 20x KSIs and monitoring approach by increasing the granularity of the KSIs and leveraging a non-\r\nprescriptive, performance outcome-based framework such as the NIST Cybersecurity Framework (CSF) 2.0 to accelerate authorizations, transition away from potentially burdensome requirements, facilitate\r\nautomation, and consolidate performance reporting.\r\n\r\nDiscussion Point\r\n\r\nWhile the proposed KSIs establish a strong foundation for outcomes-based, automation-enabled,\r\napproaches to security authorization and monitoring, the specific validations proposed may be too binary,\r\nand ultimately limit how both vendors and federal agencies implement requirements. The validations\r\nprovide only a one-size-fits-all approach based on risk tier (e.g., Phase 1: Low, Lite Software as a Services\r\n(SaaS)) rather than allowing CSPs and agencies to tailor requirements to specific business needs. This\r\nincludes not being able to prioritize different ways to achieve the outcomes and related KSIs, or monitor\r\nthem differently based on an organization’s risk environment.\r\n\r\nThe refreshed FedRAMP 20x approach will greatly accelerate a CSP’s entry into the FedRAMP Marketplace\r\nby streamlining the outcomes that must be demonstrated for FedRAMP. The currently drafted validations\r\nwill provide some degree of information to agencies and departments to make risk-informed authorization\r\ndecisions for a given cloud service. We believe that this innovative structure proposed in FedRAMP 20x can\r\nbe enhanced by providing more granularity in the validations to allow greater choice, flexibility, and risk\r\nawareness.\r\n\r\nRecommended Approach\r\n\r\nWe recommend that GSA prioritize use of flexible industry recognized frameworks, such as the NIST CSF\r\n2.0, for CSPs and agencies to demonstrate requirements and perform monitoring. Through this approach,\r\nGSA can allow vendors to present their own validations and capabilities for automated monitoring, instead\r\nof standardizing those expectations as part of FedRAMP 20x. This may include using the NIST CSF 2.0 to\r\nestablish Community and Industry Profiles for government authorization of commercial cloud services,\r\nwhich can be used by CSPs and agencies to use those profiles as the basis for implementing KSIs and\r\nassociated capabilities for monitoring. It would also enable CSPs and agencies to validate or assess KSIs\r\ndifferently for purposes of initial FedRAMP authorization than for ongoing monitoring, improving efficiency\r\nand customization based on agency needs.\r\n\r\nFrameworks like the CSF have been successful in the commercial industry; can be aligned to federal and\r\nother industry security requirements; and provide a common structure for outcomes-based, risk-informed\r\ncybersecurity management. Specifically, it can:\r\n\r\n• Accelerate Authorization. The CSF enables GSA to prioritize key security outcomes as a foundation\r\nfor FedRAMP 20x continuous monitoring and leave approaches for validation open -- without\r\nhaving to restrict monitoring to a small set of key security metrics/validations. This can facilitate\r\ngreater tailoring and customization by CSPs and agencies based on their unique service offerings\r\nand business needs, which will enable agencies to streamline authorizations to better fit their\r\nenvironments.\r\n\r\n• Promote Technology-Enabled Approaches and Automation. Using the CSF, industry can identify\r\ncritical security technologies (e.g., implementing Privileged Access Management) associated with\r\noutcomes, which go beyond individual KSIs. This can help agencies make authorization decisions\r\nbased on common, shared security technologies to optimize cost and effectiveness by promoting\r\nmulti-cloud security solutions and shared services that accelerate CSP authorization.\r\n\r\n• Enhance Efficiency. The CSF can help GSA to optimize assessment efficiency over the cloud\r\nauthorization lifecycle by enabling it to distinguish between expectations for initial authorization\r\nand ongoing monitoring. By differentiating approaches for initial and ongoing assessment, GSA can\r\ndramatically improve efficiency of authorizations. In many cases, monitoring to ensure previously\r\nvalidated capabilities remain in place can achieve agency risk management objectives alone; it may\r\nnot be necessary regularly re-test the underlying capability—particularly for low-risk systems.\r\n\r\nImportantly, these recommendations do not require GSA to change what has been developed so far for\r\nFedRAMP 20x. It just enables CSPs and agencies to meet FedRAMP 20x through a broader, more\r\ncustomizable framework. This can even help GSA to streamline the FedRAMP process further by limiting\r\nthe effort needed from GSA in later phases of the FedRAMP 20x development.\r\n\r\nDeloitte appreciates the opportunity to provide comments and feedback to GSA on FedRAMP 20x.\r\nWe would be happy to discuss them in more detail at your convenience.",
      "author": "pete-gov",
      "created_at": "2025-05-22T19:11:40Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AygHQ",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13238736",
      "body": "I really must commend @JosiahOne on an absolutely spot-on comment. What a tremendous and thorough evaluation, I could not agree more. \r\n\r\nIn general, it seems like the consensus in the comments is that the KSIs, as documented, are not specific enough to be actionable. I hate to ask this question, but:\r\n\r\n```\r\nWhat is the point of the KSIs?\r\n```\r\nIn order to be actionable, a 3PAO is going to have to default to reviewing the `Related Controls` associated with the KSI, determining which control is related to which KSI subpart and then dusting off 800-53A as the criteria to `validate the KSI`. That seems like testing the controls with more steps. \r\n\r\nThere are a total of **104** related controls in the KSIs as documented in the RFC (AT-6, and AC-23 aren't in any current baselines). So, the KSIs account for two-thirds of the **156** Low Baseline controls. I'm not sure that if gauging the security baseline of the system requires evaluating two-thirds of the required controls, the KSIs are really achieving the task they were designed to address. \r\n\r\nWould it not be easier to simply identify a subset of controls (maybe pair down the currently selected 104) that are considered to be indicative of a system's ability to implement all controls (e.g., strong change management, CI/CD pipelines, risk management, findings management, etc.), and develop methods to automatically report and validate those controls? Essentially, establish that an organization has the `ability to implement meaningful processes to predict that controls are implemented as intended` and use that as the security benchmark. \r\n\r\nInstead of trying to create novel systems that report on KSIs, which is essentially requiring many CSPs to rewrite the automation they've created for control reporting to align to KSIs, why don't we just report on the subset of controls we all agree are meaningful and indicative of overall system security? \r\n\r\nI do appreciate that these KSIs are seemingly pushing CSPs towards being able to report on the `state` of their system on a far more frequent basis, but there's no reason why that can't be achieved through the use of the 800-53 controls. With the rise of AI-based tooling (e.g., AI agents, MCP servers, etc.) the ability to pull data from as close the `source` as possible to represent actual system state and present that data on a continuous basis has never been greater. \r\n\r\nIn addition, continuing to leverage controls will prevent CSPs from having to create multiple packages when going through agency authorizations. I don't know how many agencies are going to buy into the KSIs as an indicator of authorization readiness, but I can guarantee that some won't. As a CSP, that means I'll have to create tooling to address the KSIs and then maintain tooling that also supports NIST 800-53 controls so that I can generate one package for FedRAMP, and an entirely different package that needs to be submitted to the agency. If FedRAMP utilizes a subset of controls;\r\n\r\n- 800-53 controls are already a known commodity that agencies are familiar with; and\r\n- If they don't agree with the subset of controls, worse comes to worst they are just going to ask a CSP to provide coverage of additional controls, which will be easier to accomplish than having to completely switch frameworks. \r\n\r\nAgain, I really like the push towards understanding system state that the KSIs seem to be driving towards, just not really seeing the point of establishing an entirely new framework to achieve the goal. \r\n\r\n",
      "author": "jdettweiler",
      "created_at": "2025-05-22T20:06:55Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AygJ9",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13238909",
          "body": "and I must commend @jdettweiler for this statement because it gets to the heart of the point of KSIs.\r\n> I do appreciate that these KSIs are seemingly pushing CSPs towards being able to report on the **state** of their system\r\n\r\n(emphasis his, but slightly different formatting)\r\n\r\nAre the KSIs designed to report state, or designed to **include supporting evidence directly**\r\nI think there's some confusion on this.  Is the submittal supposed to be a validated dashboard, or raw evidence itself for review?  It seems like most of the draft proposals are focusing on state, and that's not necessarily bad, but I'm not sure it's universally clear that that's the intent (if in fact, that is the intent).\r\n\r\n\r\n",
          "author": "jsantore-cgc",
          "created_at": "2025-05-22T20:30:30Z"
        },
        {
          "id": "DC_kwDOOxfoic4AygQb",
          "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13239323",
          "body": "For public clarification, questions that are seeking answers outside of the formal public comment process can be posted in FedRAMP's Community Working Groups, such as in the Automating Assessment group's [General Q&A for Participation and Submission in the 20x pilot](https://github.com/FedRAMP/automating-assessment-cwg/discussions/27) thread.",
          "author": "pete-gov",
          "created_at": "2025-05-22T21:15:27Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AyilU",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13248852",
      "body": "Thank you for drafting this RFC. My comments are inlined in _italics_\r\n \r\n\r\n> ...These capabilities are designed to provide a concrete approach to evaluating cloud security risks that can often be automatically derived from technical configurations and resolved to true or false.\r\n\r\n_A capability that aggregates multiple controls across assets should be considered not met (FALSE) as soon as any single control on any asset fails. For example, if you have ten assets and nine are encrypted but one is not, the overall Key Security Indicator (KSI) fails (should be FALSE)—regardless of the 90% success rate. This binary “all-or-nothing” approach aligns with the “weakest link” principle in security: a single security failure can compromise the entire system._\r\n\r\n_Alternatively, you could apply a weighted or percentage-based model—treating some KSIs as strictly binary (pass/fail) and others on a graduated scale based on their criticality—but for clarity and simplicity (KISS principle), my recommendation is all-or-nothing method whenever possible._\r\n\r\n> Cloud service providers MUST:\r\n\r\n_For readers's clarity, I suggest to note somewhere in this RFC that the term “MUST” is  being used in this RFC as defined in [RFC 2119](https://datatracker.ietf.org/doc/html/rfc2119)._\r\n\r\n> 3. Use immutable containers and serverless functions with strictly defined functionality and privileges\r\n\r\n_Because containers run on VMs—and most IaaS platforms offer managed VM services—this wording misleadingly suggests that CSPs can ignore the VM’s security configurations and that they need to only focus on building container images or serverless functions. Maybe, we can say: \"Use immutable infrastructure - any change requires rebuild/redeployment of the infrastructure component, be it a container/VM image or a function\". This won't apply for the case where VMs are managed by Fedramp-authorized IaaS e.g. Fargate ECS or Fargate EKS in the AWS world._\r\n\r\n> 2. Execute changes though redeployment of version controlled immutable resources  rather than direct modification wherever possible\r\n\r\n_To stress the importance of immutability. I would suggest to change \"direct modification\" to \"direct in-place modification\"_\r\n \r\n\r\n> 6. Have a dedicated staff and budget for security\r\n\r\n_I’m not sure how this could be fully automated —perhaps by querying the number of employees in the security department. For smaller organizations that only have one or two dedicated security professionals, maybe define a minimum security-staff threshold to ensure adequate coverage._\r\n\r\n> 3. Obtain a Software Bill of Materials (SBOM) for third party commercial software components\r\n\r\n_The current phrasing implies that SBOMs are only required for third-party components (e.g., appliances from vendors etc). In reality, every piece of software you build depends on external libraries, so we should require a verifiable SBOM for all running components._",
      "author": "faarshad",
      "created_at": "2025-05-23T16:30:08Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyjBM",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13250636",
      "body": "Providing branding guidance on how to reference both the 20x process and KSIs would be helpful to ensure consistent use of the terms. For example 20x (lowercase) or 20X (capital)? For referencing a KSI validation should we use KSI-CNA-1 CNA-1, CNA.1, CNA 1 etc? \r\n\r\nThanks,\r\nIsaac Teuscher (Paramify)",
      "author": "iteuscher",
      "created_at": "2025-05-23T19:58:24Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Aykzh",
      "url": "https://github.com/FedRAMP/community/discussions/3#discussioncomment-13257953",
      "body": "FedRAMP’s 20x vision of objective, real time, evidence driven oversight, is exactly what Cybersecurity Performance Management (CPM) was designed to deliver. First highlighted by Gartner® as a high benefit approach for dynamically reducing and communicating cyber risk, CPM complements, and scales with, established frameworks such as RMF, ISO 27001, NIST CSF, CMMC, CIS Controls, and CISA CPGs. It gives organizations a practical, performance centric layer that unifies those standards into a single, continuously managed picture of cyber readiness.\r\n\r\nTo operationalize CPM, TDI has developed a rich catalogue of Cybersecurity Performance Indicators (CPIs), quantitative, goal based metrics that stream telemetry from existing tools into actionable insight on risk, compliance, maturity, and ROI. CPIs can monitor any aspect of security; for the proposed KSI MLA they might track “% assets successfully sending logs to SIEM” or “% IaC repositories passing policy as code checks.” These metrics update automatically and trend over time, enabling continuous improvement instead of periodic fire drills.\r\n\r\nThink of KSIs as the headline scores executives and regulators care about, and CPIs as the engine room gauges that feed those scores. CPM links the two, translating raw technical evidence into clear KSI health indicators and pinpointing exactly which control needs attention whenever a headline drifts. This keeps everyone, from the engineer to the SOC, to the C suite, working from the same data, proving outcomes and driving targeted fixes without guesswork.\r\n\r\nGRC suites, built around document workflows, and rigid control mappings struggle to meet this real time mandate without costly retrofits. Automated CPM platforms like TDI’s CnSight are purpose built for FedRAMP’s new direction: they ingest API feeds from the tools industry already uses, compute CPIs continuously, and present tailored views for engineers, risk managers, and Authorizing Officials. \r\n\r\nAs a bonus, CPIs can serve as a universal metrics layer across accreditation bodies such as FedRAMP, DoD (including the latest Software Fast Track (SWFT) initiative), and civilian agencies. Moreover, CPIs extend well beyond software assurance, tracking performance metrics across on-premises infrastructure, endpoints, and more. They effectively mirror NIST control families, CIS Critical Security Controls, and Zero Trust Pillars and Activities. This high level of interoperability delivers maximum visibility and trust, enabling true reciprocity across organizations and standards, paving the way for faster authorizations and continuous monitoring that maintains security readiness.\r\n\r\nBy adopting a CPM-style metric fabric, FedRAMP can move beyond paperwork and static attestations to real-time security insights, ultimately accelerating the approval of cloud products. This means cost effective and efficient delivery of secure, innovative solutions into the hands of federal government, to benefit the American people. ",
      "author": "jkdean",
      "created_at": "2025-05-24T16:21:32Z",
      "replies": []
    }
  ]
}