{
  "id": "D_kwDOOxfoic4Af-MG",
  "url": "https://github.com/FedRAMP/community/discussions/4",
  "title": "FedRAMP RFC-0007: Significant Change Notification Standard (Closed)",
  "body": "# RFC-0007 Significant Change Notification Standard\r\n\r\n> - Status: Closed\r\n> - Created By: FedRAMP PMO\r\n> - Start Date: 2025-04-24\r\n> - Closing Date: 2025-05-24\r\n> - Short Name: rfc-0007-significant-change-notification\r\n\r\n## Where to Comment\r\n\r\nMon May 26 09:53:32 EDT 2025\r\n\r\nThis RFC is now closed to public comment. Many thanks to all the participants!\r\n\r\n## Summary\r\n\r\nThe Significant Change Notification Standard asserts that authorizations granted to cloud service providers include the authority to make changes that are in the best interest of agency customers without asking permission from an authorizing official in advance, in most cases.\r\n\r\nThis draft standard establishes a tiered notification framework that differentiates between adaptive changes (significant but routine) and transformative changes (major functionality changes). Adaptive changes may be made as appropriate without consulting with agency customers, while transformative changes require consultation with agency customers in advance. Cloud service providers are still expected to follow procedures in their security plans and collaborate with third-party assessment organizations to verify outcomes.\r\n\r\nChanges that increase or decrease the impact level rating for the cloud service (e.g. from low to moderate or from high to moderate) are not covered under the Significant Change Notification Standard as these changes require reauthorization.\r\n\r\n## Motivation and Rotationale\r\n\r\nThe existing FedRAMP standard for Significant Change Requests creates a devastating bottleneck that slows government adoption of new cloud technology and features, raises costs for government customers by increasing the burden of operating a cloud service for government customers, encourages the operation of separate service instances for government customers, hinders agency sponsorship of FedRAMP authorizations, and decreases the effective security of cloud services by obstructing proactive innovation.\r\n\r\nFedRAMP asserts that cloud service providers, supported by trusted third-party assessment organizations, must be trusted to continuously improve their systems responsibly. This draft standard acknowledges that cloud service offerings can and should make significant changes without requesting federal agency review of engineering decisions or third-party assessment. This change aligns with guidance in OMB Circular A-130 and NIST SP 800-37 Rev 2 to substantially reduce the burden of lead agency authorizing officials and reusing agency authorizing officials by encouraging them to focus on their overall risk posture instead of redundant reviews of complex engineering decisions.\r\n\r\nDue to executive branch restrictions on the production of significant guidance and policy materials, this draft proposes a basic standard that replaces the previous Significant Change Process with a simple and reasonable approach that can be applied by cloud service providers, third-party assessment organizations, and agency officials. The Significant Change Notification Standard avoids excessive detail identifying types of potential significant changes to support FedRAMP’s ongoing shift from compliance-based decision making and assessment to security-based decision making and assessment.\r\n\r\n## Explanation\r\n\r\nThe full draft standard is approximately 5 pages and is available for review in the following formats:\r\n\r\n- [Basic web formatting on fedramp.gov](https://fedramp.gov/updates/rfcs/0007)\r\n- Basic text markdown on GitHub (below)\r\n- PDF file:  [rfc-0007-significant-change-notification.pdf](https://github.com/FedRAMP/rfcs/raw/main/rfc/assets/0007-significant-change-notification.pdf)\r\n- DOCX file:  [rfc-0007-significant-change-notification.docx](https://github.com/FedRAMP/rfcs/raw/main/rfc/assets/0007-significant-change-notification.docx)\r\n\r\n## Discussion Requested\r\n\r\nThis draft standard is open for any public comment. FedRAMP encourages fast, informal comments from any member of the public. The public may submit multiple comments and may respond to other public comments. All comments from the public sent via email will be made public.\r\n\r\nThe FedRAMP Rev 5 Continuous Monitoring Working Group will simultaneously host discussions on potential best practices and implementation of machine readable Significant Change Notifications based on this draft standard.\r\n\r\n---\r\n\r\n# RFC-0007 Significant Change Notification Standard\r\n\r\nThursday, April 24, 2025\r\n\r\n---\r\n\r\n# Background\r\n\r\n> [OMB Circular A-130: Managing Information as a Strategic Resource](https://obamawhitehouse.archives.gov/sites/default/files/omb/assets/OMB/circulars/a130/a130revised.pdf) Appendix I states _“under ongoing authorization, reauthorization is typically an event-driven action initiated by the authorizing official or directed by the Risk Executive (function) in response to an event or significant change that increases information security or privacy risk above the previously agreed-upon agency risk tolerance.”_\r\n\r\n> [NIST SP 800-37 Rev. 2: Risk Management Framework for Information Systems and Organizations: A System Life Cycle Approach for Security and Privacy](https://csrc.nist.gov/pubs/sp/800/37/r2/final) Appendix F similarly states that _“under ongoing authorization, reauthorization is in most instances, an event-driven action initiated by the authorizing official or directed by the senior accountable official for risk management or risk executive (function) in response to an event that results in security and privacy risk above the level of risk previously accepted by the authorizing official.”_ This section also states that _“Organizations establish criteria for what constitutes significant change based on a variety of factors.”_\r\n\r\n> [The FedRAMP Authorization Act (44 USC § 3609 (a) (7))](https://www.govinfo.gov/app/details/USCODE-2023-title44/USCODE-2023-title44-chap36-sec3609) directs the Administrator of the General Services Administration to _“coordinate with the FedRAMP Board, the Director of the Cybersecurity and Infrastructure Security Agency, and other entities identified by the Administrator, with the concurrence of the \\[OMB\\] Director and the \\[DHS\\] Secretary, to establish and regularly update a framework for continuous] monitoring…”_ This responsibility is [delegated to the FedRAMP Director](https://www.gsa.gov/directives-library/gsa-delegations-of-authority-fedramp).\r\n\r\n# Introduction\r\n\r\nThis FedRAMP standard moves away from the historical presumption that all significant changes to FedRAMP authorized cloud service offerings require prior federal approval and reauthorization by a “lead agency.” Agencies must follow OMB policy and NIST standards when adopting FedRAMP authorized cloud services, including performing a full review and risk assessment based on the materials within a FedRAMP authorization package.\r\n\r\nFedRAMP asserts that authorization to operate a cloud service establishes an agreed-upon agency risk tolerance that expects the provider to continuously improve the service without triggering reauthorization for most significant changes, and that third-party assessment organizations provide the necessary rigor to identify the risks of such changes on behalf of the authorizing officials. FedRAMP further asserts, as a program responsible for a government-wide approach to the use of cloud services, that no single agency should block improvements to shared services when those improvements may be used by other agencies.\r\n\r\nThis updated standard creates a new Significant Change Notification standard that replaces all previous FedRAMP guidance related to Significant Change Requests for all FedRAMP authorizations and certifications, including the current Rev 5 Agency Authorization process and FedRAMP 20x. Best practices and technical assistance to help stakeholders follow this standard will be provided separately.\r\n\r\nThis standard does not supersede any agreement signed between a federal agency and a cloud service provider that sets additional requirements beyond those required by FedRAMP.\r\n\r\n# Definitions\r\n\r\nThe following definitions apply to all FedRAMP materials:\r\n\r\na. “**Significant change**” has the meaning given in [NIST SP 800-37 Rev. 2](https://csrc.nist.gov/pubs/sp/800/37/r2/final) or any successor document. As of April 2025 that means “a change that is likely to substantively affect the security or privacy posture of a system.”\r\n\r\n1.  FedRAMP excludes routine recurring activities that are part of ongoing operations or vulnerability mitigation and remediation from the criteria for determining significant changes. Such changes are NOT considered significant changes for the purposes of this standard.\r\n\r\nb. “**Adaptive change**” means any significant change that adjusts existing components or functionality of the cloud service offering. This is the least impactful type of significant change.\r\n\r\nc. “**Transformative change**” means any significant change that adds, replaces, or removes major components and functionality of the cloud service offering.\r\n\r\nd. “**Impact categorization change**” means any significant change that is likely to increase or decrease the impact level rating for the cloud service (e.g. from low to moderate or from high to moderate). This is the most impactful type of significant change.\r\n\r\n# **Significant Change Notification Standard**\r\n\r\nThe FedRAMP Significant Change Notification (SCN) Standard establishes standard requirements that cloud service providers MUST follow to maintain FedRAMP authorization when making significant changes to FedRAMP authorized cloud services.\r\n\r\n1. Providers MUST NOT make impact categorization changes via the FedRAMP significant change process; security objective changes require re-authorization.\r\n\r\n2. Providers MUST follow the procedures documented in their security plan to plan, test, perform, assess, and document changes.\r\n\r\n3. Providers MUST assess all planned changes to determine if they may be a significant change.\r\n\r\n4. Providers MUST determine if the significant change is an adaptive change, a transformative change, or an impact categorization change, and follow appropriate procedures; providers MUST use the most impactful significant change type that likely applies.\r\n\r\n5. Providers MUST keep historical significant change notifications available to agency customers until the service completes its next annual assessment.\r\n\r\n6. Providers MUST maintain auditable records of these activities and make them available to FedRAMP, agencies, and contracted 3PAOs.\r\n\r\n7. Providers MUST make ALL significant change notifications and related audit records available in similar human-readable and compatible machine-readable formats.\r\n\r\n8. All parties SHOULD follow FedRAMP’s best practices and technical assistance on significant change assessment and notification where applicable.\r\n\r\n## If the significant change is an **adaptive change**, also:\r\n\r\n9. Providers MUST notify FedRAMP and agency customers within 14 calendar days AFTER making adaptive changes.\r\n\r\n10. Providers MUST notify agency customers at the next monthly monitoring meeting AFTER making adaptive changes.\r\n\r\n## If the significant change is a **transformative change**, also:\r\n\r\n9. Providers MUST have a 3PAO review the scope and impact of the planned change BEFORE making significant changes; providers MUST NOT proceed with significant changes without 3PAO concurrence.\r\n\r\n10. Providers MUST work with a 3PAO to develop a security assessment plan BEFORE making transformative changes.\r\n\r\n11. Providers MUST discuss the planned change during two sequential monthly monitoring meetings BEFORE making transformative changes.\r\n\r\n12. Providers MUST notify FedRAMP and agency customers at least 14 calendar days in advance of the first monthly monitoring meeting BEFORE discussing planned transformative changes.\r\n\r\n13. Providers MUST notify FedRAMP and agency customers within 1 calendar day AND at the next monthly monitoring meeting AFTER making transformative changes.\r\n\r\n14. Providers MUST have a 3PAO begin assessment of the results no later than 1 calendar day AFTER making transformative changes; this assessment SHOULD be completed within 7 calendar days AFTER making transformative changes.\r\n\r\n15. Providers MUST publish updated service documentation and other materials to reflect transformative changes within 3 calendar days AFTER making transformative changes.\r\n\r\n16. Providers SHOULD automatically OPT OUT agency customers of transformative changes where possible and appropriate.\r\n\r\n17. Providers SHOULD delay or roll back change implementation based on significant increases in unmitigated risk that exceed their documented thresholds.\r\n\r\n# **Application of the Significant Change Notification Standard**\r\n\r\nCloud service providers may notify FedRAMP and agencies in a variety of ways as long as the mechanism for notification is clearly documented and easily accessible.\r\n\r\nA. Providers MUST follow additional requirements related to significant changes that are part of a contractual or other agreement with specific agency customers.\r\n\r\nB. Providers SHOULD be responsive to agency customer requests for additional information, standardized formatting, delivery mechanisms, and other requests that improve the agency’s experience and ability to assess the security of a system.\r\n\r\nC. Providers and 3PAOs SHOULD follow the guidelines and best practices in any technical assistance provided separately by FedRAMP regarding the application of the Significant Change Notification Standard.\r\n\r\nD. 3PAOs MUST independently notify FedRAMP when Providers do not follow this standard appropriately.\r\n\r\nE. Agencies SHOULD use the assessment and information provided in the significant change notification to make continuing authorization decisions regarding the cloud service offering.\r\n\r\nF. Agencies SHOULD provide concerns directly to the provider during continuous monitoring meetings in advance of transformational changes or in writing after an adaptive change.\r\n\r\n# **Exceptions to the Significant Change Notification Standard**\r\n\r\nCloud service providers MAY be required to delay significant changes beyond the standard notification period and/or be required to submit significant changes for review by FedRAMP or an Authorizing Official as a condition of a formal FedRAMP Corrective Action Plan or other agreement with a federal agency.\r\n\r\n# **Significant Change Notification Requirements**\r\n\r\nAll Significant Change Notifications MUST include at least:\r\n\r\n- Service Offering FedRAMP ID\r\n- 3PAO Name (if applicable)\r\n- Type of change (CSP definable)\r\n- Related POA\\&M (if applicable)\r\n- Short description of change\r\n- Reason for change\r\n- Summary of service components and controls affected\r\n- Copy of the business or security impact analysis (including 3PAO concurrence, if applicable)\r\n- Name and title of approver\r\n\r\nCloud service providers MAY include additional relevant information in Significant Change Notifications.\r\n\r\n## Adaptive Changes\r\n\r\nSignificant Change Notifications for adaptive changes MUST ALSO include at least:\r\n\r\n- Date of Change\r\n- Summary of steps that were taken to verify and assess controls after implementation\r\n- Summary of any new risks identified and/or POA\\&Ms resulting from the change (if applicable)\r\n\r\n## Transformative Changes\r\n\r\nSignificant Change Notifications sent BEFORE transformative changes MUST ALSO include at least:\r\n\r\n- Planned change date\r\n- Rollback plan (high level)\r\n- If the change is opt in, include the risk associated with the change even if the agency does not opt in\r\n- How to opt in (if applicable)\r\n- Steps that will be taken to verify and assess controls after implementation\r\n- Detail on service components and controls affected\r\n- Copy of the security assessment plan\r\n\r\nSignificant Change Notifications sent AFTER transformative changes MUST ALSO include at least:\r\n\r\n- Date of Change\r\n- Steps that were taken to verify and assess controls after implementation\r\n- Summary of any new risks identified and/or POA\\&Ms resulting from the change (if applicable)\r\n- Copy of the security assessment report\r\n\r\n\r\n\r\n",
  "author": "pete-gov",
  "created_at": "2025-04-24T15:07:25Z",
  "comments": [
    {
      "id": "DC_kwDOOxfoic4AxXJ3",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12939895",
      "body": "I emailed this in before the comments section was opened up, but posting here for discussion:\r\n\r\nIn the Definitions section, it’s still unclear to me how to determine if certain things would fall under an “adaptive change” or a “transformative change”.  For example, if I have an application sitting on Win 2020 in my boundary and I want to upgrade that same app to live on top of Win 2022, am I “adjusting existing components” (Adaptive) ? Or am I replacing a major component (Transformative)?  If I’m in AWS GovCloud and I add in another AWS service, is that adjusting, or adding? Does what the service is make a difference here?  I think having some clarifying examples will help. \r\n \r\nFor the Significant Change Notification Standard, item #7 – does this mean that all notifications must be in both human-readable and compatible machine-readable formats, and that also related audit records must be in both human and machine readable formats? Or is it that notifications should be human readable and audit records machine readable? Is there a required machine readable format for these?  And will this mean that CSPs cannot complete an SCR (after this policy is adopted) if they do not have the capability to provide the correct machine readable format? \r\n \r\nFor “If the Significant change is a transformative change” –  the numbering appears to be off in relation to the prior sections.   Also, can there be some more clarity on how a CSP is able to have a change assessed given the timelines noted for the tranformative change can be made vs when it needs to complete assessment?  In the past various options have been floated for assessment of  “new” components – such as installing it in the boundary in a way that doesn’t touch or impact customers, or installing in an ‘equivalent’ non-FedRAMP environment and having that assessed as a best-effort. Are these acceptable going forward? Does this section imply it should be assessed prior to being installed in the boundary, such that what is being assessed is a ‘similar’ installation or component possibly with caveats? Or should it be installed in the boundary, but then assessed immediately and quickly? What if installation takes a week to configure – the clock for “after making the change” start after all the installation work is completed? After it is officially declared “live”? Or the moment the new component is in any way enabled/installed in the boundary even if it is not fully configured or functional yet? \r\n",
      "author": "kamamanh",
      "created_at": "2025-04-24T21:05:45Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AxXN_",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12940159",
          "body": "I will address a few early points for public clarification and awareness but otherwise we appreciate and have noted your comments (this is not intended as an endorsement of these comments).\r\n\r\n> For the Significant Change Notification Standard, item \\#7 – does this mean that all notifications must be in both human-readable and compatible machine-readable formats, and that also related audit records must be in both human and machine readable formats?\r\n\r\nFor public awareness, intent is that a CSP make this available in both formats, as some agency customers may prefer one or the other. We expect robust discussion in the [Rev 5 Continuous Monitoring Working Group](https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/30) around ways to solve this efficiently.\r\n\r\n> For “If the Significant change is a transformative change” – the numbering appears to be off in relation to the prior sections. \r\n\r\nFor public awareness, numbering is a placeholder in this draft, but the way it starts at 9 for both Adaptive and Transformative changes is intended to convey that these are separate paths. After reviewing 1-8, if it's an Adaptive change, you review 9 & and 10. If it's a Transformative change, you review 9 - 17.",
          "author": "pete-gov",
          "created_at": "2025-04-24T21:38:26Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxXgN",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12941325",
          "body": "I too am curious about things like adding AWS services.  The question also comes up when we add additional features to our product that doesn't change security or privacy.",
          "author": "KHFedR",
          "created_at": "2025-04-25T01:18:04Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxY-F",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12947333",
          "body": "Thank you for your comment (this is not intended as endorsement of this comment and comments related to specific commercial products or services does not constitute endorsement, recommendation, or favoring by GSA).\r\n\r\n> I too am curious about things like adding AWS services. The question also comes up when we add additional features to our product that doesn't change security or privacy.\r\n\r\nFor public clarification, there are likely many situations where adding a new AWS service is adjusting existing components or functionality and does not amount to addition, replacement, or removal of **major** components or functionality. There are likely many situations where the opposite is true. Even for the exact same AWS service, there will be times when a cloud service offering's architecture means adding use of it is adaptive while for another it could be transformative.\r\n\r\nFor discussion purposes and not as a formal decision or other FedRAMP policy, consider:\r\n\r\n(1) A cloud service offering logs general event metadata about activity in an Amazon RDS database that is a rarely used feature to show the history of a file to end users (not for auditing). Engineering determines that moving this information into Amazon Redshift makes sense to reduce costs, increase reliability, and add flexibility. This change would likely proceed as an adaptive change if the Provider's experts agree it is adjusting existing components or functionality that are not major.\r\n\r\n(2) A cloud service offering stores federal customer information, including CUI, inside an Amazon RDS database that is the primary source of truth and capability for the service offering. Engineering determines that moving this information into Amazon Redshift make sense to reduce costs, increase reliability, and add flexibility. This change is quite clearly a transformative change that adds, replaces, or removes **major** components and functionality of the cloud service offering.\r\n\r\nThe difference is unrelated to the addition of an AWS service; it is entirely dependent on the architecture of the cloud service offering. \r\n",
          "author": "pete-gov",
          "created_at": "2025-04-25T13:10:04Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxZDH",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12947655",
          "body": "@pete-gov I get the point of this example:  You're replacing a major component of an environment that directly has government data.  \r\n\r\nThat said, I think the actual migration is fairly straightforward, and to actually test this change is relatively easy since you're staying in the AWS ecosystem.\r\n\r\nAccess control is likely similar/same as with RDS, and managed through common IDP mechanisms, so just validate this is true.\r\nLogging is through AWS CloudTrail, CloudWatch to existing SIEM.  No change other than validating Redshift stuff is ingested.\r\nCrypto is likely a checkbox and end points.\r\nBackups are likely through existing AWS mechanisms (e.g. snapshot to S3 or whatever).\r\nProbably a few more things, but relatively easily tested.\r\n\r\nI might be oversimplifying, but not by much.  If I were a 3PAO in this, this change could be tested in an hour or two.  The paperwork would take longer than the validation.\r\n\r\nI'm glad you brought this example up, though, because while ease of testing/complexity of change in and of itself isn't a criteria for evaluating a change, there is inherently less risk for a non complex change.  Do we care about this in evaluating these?  My gut feel is yes. \r\n\r\nThis example is a lift-and-shift from an apple to essentially, a slightly different apple.  As opposed to a change from an apple to an orange-and-banana architectural change.\r\n\r\nSo for similar examples:  migrating from a VM to a container, or from a self hosted database to an RDS database.  As opposed to implementing an entirely new widget processing function requiring new endpoints, databases, and business logic compute resources.\r\n\r\nBoth are transformative changes by this definition, but one is a much bigger deal than the other.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
          "author": "jsantore-cgc",
          "created_at": "2025-04-25T13:38:05Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxfRQ",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12973136",
          "body": "Much of the questions I had were similar, so I will not rehash those.  \r\n\r\nBut I did have a few additional elements I would like to understand more.  \r\n## New Service Feature Onboarding Process\r\n1. Where does the CSO or feature onboarding process fall?  Is this process also going to be replaced as part of the new significant change assessment? (Seems like this is also absolete with this release, but wanted to get confirmation). \r\n  [New CSO or Feature Onboarding](https://www.fedramp.gov/assets/resources/templates/FedRAMP-New-CSO-or-Feature-Onboarding-Request-Template.docx)\r\n\r\n## Maintaining Package disparity by Agency.  \r\n1. If the Significant Change is Transformative, (Section 16 of if a transformative change) what is the prescribed method for maintaining a package of agency customer wants to opt out of the significant change?   \r\n2. Since the 'Lead Agency' wouldn't be solely owning the risk of the change, and no agency can block a change that is needed or being driven by other agencies, is it the responsibility of each agency to accept their own risk, and maintain what deviations they have made from the central FedRAMP Package?  \r\n3. How should the CSP report and maintain these deviations?  The requirement states that the notifications are retained until next Annual Assessment.  Would a successful completion of an annual assessment require re-basing of all deviations from agencies that had opted out of previous significant changes?\r\n\r\n## KSI or Checklist to determine Significant Change Type.\r\nPete, you had a great example above of how the adaptive change could be quick, since the service is a major feature and has access to government data, the Significant Change is Transformative, but the assessment is quick. Is there going to be a qualifier checklist that will help the CSPs determine what type of significant change they should perform?  \r\n1.  The expectation would be that the assessment needs to be completed within 7 days of the change.  Is that a good indicator that a re-assessment needs to occur?  Or is the recommendation to deploy the changes sequentially until complete?  \r\n2. Are you tying the major components to the definitions in the CP?  Or is it based on information types? Or are there other indicators that would be leveraged to identify?  \r\n3. Does impact level of system play into categorization of change type? \r\n",
          "author": "Telos-sa",
          "created_at": "2025-04-28T18:31:47Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxfVp",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12973417",
          "body": "Thank you for your comments (this is not an endorsement of the comments). Some of these are questions that would not be answered during a public comment phase, however I have clarified for the public a few points below.\r\n\r\n> @Telos-sa   1. Where does the CSO or feature onboarding process fall?  Is this process also going to be replaced as part of the new significant change assessment? (Seems like this is also absolete with this release, but wanted to get confirmation).\r\n\r\nFor public clarification, this process would no longer apply as a bespoke FedRAMP requirement.\r\n \r\n> If the Significant Change is Transformative, (Section 16 of if a transformative change) what is the prescribed method for maintaining a package of agency customer wants to opt out of the significant change?\r\n\r\nFor public clarification, this standard does not account for an agency flat out requiring that a cloud service provider create a separate cloud service offering for their own use if they do not like a proposed significant change. Responding to an agency rejecting a proposed significant change would be a business decision for the cloud service provider.\r\n\r\n\r\n ",
          "author": "pete-gov",
          "created_at": "2025-04-28T19:02:40Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxgIG",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12976646",
          "body": "Hi Pete, just want to make sure I understood your response:\r\n\r\n> > @Telos-sa   1. Where does the CSO or feature onboarding process fall?  Is this process also going to be replaced as part of the new significant change assessment? (Seems like this is also absolete with this release, but wanted to get confirmation).\r\n> \r\n> For public clarification, this process would no longer apply as a bespoke FedRAMP requirement.\r\n\r\nBy \"this process\" are you saying the CSO or feature onboarding process will not apply, period? Or do you mean that if new features will not have an impact on how existing features operate, the Significant Change Notification process will not apply?\r\n\r\nAs an easy/public/direct example: If cloud.gov wanted to start brokering Azure AI or AWS Bedrock or GCP Gemini or some other IaaS equivalent (in addition to [the existing brokered services it provides now](https://cloud.gov/docs/services/intro/#provisioning-managed-services-through-the-marketplace)) and there's no overlap in the cloud.gov components doing the brokering, what if any FedRAMP process would apply?\r\n\r\n(Disclaimer: I am not actually on the cloud.gov team, just familiar with their offerings.)",
          "author": "mogul",
          "created_at": "2025-04-29T04:54:09Z"
        },
        {
          "id": "DC_kwDOOxfoic4AxiJT",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12984915",
          "body": "Thank you for your comment (this is not an endorsement of the comment). This is a bit awkward because public comment is not supposed to be Q&A. 🤣 \r\n\r\n> By \"this process\" are you saying the CSO or feature onboarding process will not apply, period? Or do you mean that if new features will not have an impact on how existing features operate, the Significant Change Notification process will not apply?\r\n\r\nFor public clarification, the Significant Change Notification Standard  does not include a bespoke \"new feature\" or \"new service onboarding\" process. These are just changes that would follow the SCNS.\r\n\r\n",
          "author": "pete-gov",
          "created_at": "2025-04-29T19:57:51Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AxXim",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12941478",
      "body": "The new FedRAMP RFC on Standardizing Significant Change Requests (SCRs) is a step in the right direction for clarity—but it surfaces a critical tension:\r\n\r\nWhat prevents a 3PAO from classifying routine changes as SCRs to expand scope and fees?\r\n\r\nThis framework introduces a clear conflict of interest, as the 3PAO serves as:\r\n    1 - The gatekeeper deciding what qualifies as significant,\r\n    2 - The validator of the remediation work, and\r\n    3 - The whistleblower if something goes wrong.\r\n\r\nAs we push for faster, AI-enabled continuous monitoring and automation, this kind of structural misalignment could stall innovation and inflate costs for vendors trying to do the right thing. Curious how others are thinking about accountability and balance in this model.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
      "author": "blockaytech",
      "created_at": "2025-04-25T01:43:06Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AxY6g",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12947104",
          "body": "I will address a few early points for public clarification and awareness but otherwise we appreciate and have noted your comments (this is not intended as an endorsement of these comments).\r\n\r\n> What prevents a 3PAO from classifying routine changes as SCRs to expand scope and fees?\r\n\r\nFor public clarification, this draft proposes the Provider determine if changes are significant, and if so, if they are adaptive or transformative. See (2), (3), (4). 3PAOs are not responsible for classifying changes under this draft standard. \r\n\r\nAuditable records of these determinations by a Provider must be made available under (6) as appropriate (typically during annual assessment or other unplanned audit).",
          "author": "pete-gov",
          "created_at": "2025-04-25T12:46:37Z"
        },
        {
          "id": "DC_kwDOOxfoic4Axe55",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12971641",
          "body": "What happens when a CSP determines something adaptive but during annual assessment, the 3PAO disagrees? Will they (3PAO) at that time add the transformative change into the annual assessment so there will not be any additional testing and or delay? Would the CSP have to shut down the transformative change until the assessment is completed?",
          "author": "wahlay5497",
          "created_at": "2025-04-28T15:39:22Z"
        },
        {
          "id": "DC_kwDOOxfoic4AyEAB",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13123585",
          "body": "> Providers MUST have a 3PAO review the scope and impact of the planned change BEFORE making significant changes; providers MUST NOT proceed with significant changes without 3PAO concurrence.\r\n\r\nand\r\n\r\n> D. 3PAOs MUST independently notify FedRAMP when Providers do not follow this standard appropriately.\r\n\r\nboth give the 3PAO undue leverage in the significant change process to determine self-serving outcomes.",
          "author": "wisecryptic",
          "created_at": "2025-05-12T21:59:26Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AxXix",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12941489",
      "body": "While I agree with the tiered notification framework and a trust-first compliance model, RFC-0007 introduces an unintended risk by placing third-party assessment organizations (3PAOs) in the dual role of validator and enforcer.\r\n\r\nThe current structure risks creating incentives for overclassification of changes as “transformative,” leading to increased costs and delays for cloud service providers—without a commensurate improvement in risk posture.\r\n\r\nBefore pushing live FedRAMP needs to:\r\n-  Clearly define examples of non-transformative changes to reduce overreach\r\n-  Create a mechanism for independent dispute resolution on 3PAO-concurrence disagreements\r\n-  Require 3PAOs to transparently document their classification rationale and billing scope for each SCN\r\n-  Consider standardized pricing benchmarks for SCN-related assessments to discourage inflation\r\n\r\nTrust and accountability should run both ways—in service of a faster, smarter, and fairer compliance ecosystem.\r\n",
      "author": "ej-east",
      "created_at": "2025-04-25T01:46:02Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AxY59",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12947069",
          "body": "I will address a few early points for public clarification and awareness but otherwise we appreciate and have noted your comments (this is not intended as an endorsement of these comments).\r\n\r\n> The current structure risks creating incentives for overclassification of changes as “transformative,” leading to increased costs and delays for cloud service providers—without a commensurate improvement in risk posture.\r\n\r\nFor public clarification, this draft proposes the Provider determine if changes are significant, and if so, if they are adaptive or transformative. See (2), (3), (4). \r\n\r\nRequirements (9) and (10) under transformative changes do not apply to adaptive changes. Adaptive changes and transformative changes are different and have branching requirements.\r\n",
          "author": "pete-gov",
          "created_at": "2025-04-25T12:42:16Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AxY_X",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12947415",
      "body": "@ej-east and @blockaytech \r\nRegarding 3PAO as gatekeeper.  I think these concerns are valid, and look scary on paper.  In practice, I'm not sure it will work out that way.\r\n\r\nSome thoughts:\r\n1) CSP determines what the change level is.  3PAO only has to review and concur, and to use a quasi sounding legal phrase, I'd expect the threshold to be 'approval not to be unreasonably withheld.'  Also, remember there are multiple 3PAOs, so while I don't recommend using that as a way to venue shop, you probably could.  And per @pete-gov's comments above :\r\n\r\n> or public clarification, this draft proposes the Provider determine if changes are significant, and if so, if they are adaptive or transformative. See (2), (3), (4). 3PAOs are not responsible for classifying changes under this draft standard.\r\n> \r\n> Auditable records of these determinations by a Provider must be made available\r\n\r\nSo the 3PAO is not acting in a vacuum as the final arbiter; just a temporary proxy for an AO in that regard.  In other words, this can be challenged if necessary, based on the records of the change determination.\r\n\r\n2) It makes sense for the 3PAO to assess/validate the transformative change.  This is effectively the pre-FedRAMP 20x state of things anyway. \r\n\r\n3) Yeah, I agree that I do not like 3PAO as whistleblower.  I might tweak that piece such that the CSP would need to 'pass' the SCR assessment without any showstopper issues.  Ultimately, though, the final SAR typically has 'recommends for continued authorization' or not.  And in the rare negative case, typically that doesn't get presented officially until the CSP remediates things to a recommendable state.  Either that, or there are already conversations with the AOs in the first place.  I'm not sure how best to take this out of 'whistleblower' status, but I think 'recommendable' is more in line with the intent here.  \r\n\r\nI do like the 'notification' in lieu of prior 'approval' though, generally speaking.  ",
      "author": "jsantore-cgc",
      "created_at": "2025-04-25T13:19:18Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AyEAp",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13123625",
          "body": "@jsantore-cgc I'm a fan of your thoughts. That being said, I would like the limits and guardrails around 3PAOs more explicit. Just because one 3PAO is a good-faith player (generally I think the majority are in a given situation) doesn't hinder the others from self-serving drift.",
          "author": "wisecryptic",
          "created_at": "2025-05-12T22:03:11Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AxhjK",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12982474",
      "body": "> Providers MUST have a 3PAO begin assessment of the results no later than 1 calendar day AFTER making transformative changes; this assessment SHOULD be completed within 7 calendar days AFTER making transformative changes.\r\n\r\n1. I get that we are trying to quickly move things along, but this could also further delay changes given that most of the 3PAOs time you must book way in advance.  This could force CSPs to roll out changes that are not fully ready if they already have an agreed upon date with the 3PAO that they don’t want to miss that window even if their change isn’t 100% ready or this could delay rolling out changes until a 3PAO has availability and agreed to show up if a CSP was conservative with their estimate as when the feature would be ready. \r\nI would suggest making this time window a bit larger, to at least a week or ideally a month rather than 1 day.  At minimum I would really push for a greater window for transformative changes when an agency customer can opt out (or must opt in) as it is optional feature of a CSO.  Like if you are within 3 months of an annual assessment for an optional transformational change it would be much more efficient to just have the testing during the annual assessment rather than running back to back assessments. \r\n\r\n2. Is the expectation here that a 3PAO would end testing and produce a SAR within 7 calendar days?  Understand this says SHOULD but SCR testing is typically 3-4 weeks from start of actual testing to final SAR report from what I have seen when you add in all the report writing, timing of pen test, finalizing draft documents (bit more on this below).  I would want to make sure that this is setting realistic expectations. \r\nFor example when a change is tested as part of an annual assessment the testing will not be done in a week but rather 2 months. \r\n\r\n> All Significant Change Notifications MUST include at least: / Copy of the business or security impact analysis (including 3PAO concurrence, if applicable)\r\n\r\n3. For transformational changes have we thought about creating a trimmed down combined SAP and SAR template that could include a section for a business/security impact analysis from the CSP?  SAP and SARs are pretty bulky documents that could use some trimming anyway (different topic).  But to increase the speed maybe we can decrease the paperwork to just topics that matter for the change.  Like this template could also include all the items a Significant Change Notifications must include and creates a standardized formatting.  I would assume this would make it easier for agencies if they are used to seeing the same template from all CSPs.   \r\n",
      "author": "kcarr91",
      "created_at": "2025-04-29T15:22:15Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Axh3P",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-12983759",
      "body": "While we definitely welcome changes to the Significant Change Process, We have some concerns with the proposed process, especially around transformative changes:\r\n\r\n> 10. Providers MUST work with a 3PAO to develop a security assessment plan BEFORE making transformative changes.\r\n> 14. Providers MUST have a 3PAO begin assessment of the results no later than 1 calendar day AFTER making transformative changes; this assessment SHOULD be completed within 7 calendar days AFTER making transformative changes.\r\n\r\nRequiring a full Security Assessment Plan (SAP) and Security Assessment Report (SAR) for every transformative change introduces unnecessary inefficiencies and may be unworkable within the prescribed timelines. Instead, we recommend:\r\n-    Transformative changes require advance notification (e.g., 30 days), unlike adaptive changes.\r\n-    A 3PAO should perform a Security Impact Analysis (SIA) to be submitted within 30 days after the change (rather than a full SAP/SAR assessment).\r\n \r\nA Security Impact analysis allows 3PAOs to evaluate and refine their assessment approach based on the actual impact, rather than being locked into a static SAP. The current model doesn’t reflect modern agile practices or cloud-native architectures, where iterative testing is often more effective than pre-defined control testing.\r\nThis also encourages assessors to apply critical thinking around the nature and scope of changes—e.g., determining which controls are actually impacted—rather than defaulting to exhaustive reassessment of controls like AC-2, which may have no material change.\r\n\r\nFor many controls, a targeted check is more appropriate. For example:\r\n-    RA-5: Simply verifying that new or modified components are included in monthly vulnerability scans should be sufficient.\r\n-    Many common controls may remain unchanged and should only require fast validation of continued coverage.\r\n\r\nUnder this model, a full SAP/SAR would still be appropriate during the next annual assessment cycle which already leverages those, avoiding duplication and reducing overall assessment burden while still maintaining security rigor.\r\n\r\n> 11. Providers MUST discuss the planned change during two sequential monthly monitoring meetings BEFORE making transformative changes.\r\n> 12. Providers MUST notify FedRAMP and agency customers at least 14 calendar days in advance of the first monthly monitoring meeting BEFORE discussing planned transformative changes.\r\n\r\nRequiring 14 days’ advance notice before the first of two monthly meetings effectively creates a 2.5–3 month lead time before a change can be implemented. This is likely to slow adoption of important improvements and contradicts the stated goal of accelerating secure access to modern cloud technologies.\r\n\r\nWe recommend the following adjustment (in addition to the prior ones regarding transformative changes):\r\n-    Require only one Collaborative ConMon meeting to discuss transformative changes.\r\n-    Require 7 calendar days of prior notification before the Single Collaborative ConMon meeting, consistent with DHS vulnerability reporting timelines already in use.\r\n\r\nThis would still provide agencies and 3PAOs with early visibility into planned changes, while significantly reducing the time-to-implement. It would also better align approval timelines with actual risk, as determined by the Collaborative ConMon group and based on the Security Impact Analysis or other submitted documentation. This approach supports agility without compromising oversight.\r\n",
      "author": "cb-axon",
      "created_at": "2025-04-29T17:25:16Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AxoQ2",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13009974",
      "body": "🛑Clarify Delegated Authority of 3PAOs and Boundaries of Concurrence🛑\r\n\r\nWhile RFC-0007 allows CSPs to determine the nature of a change (adaptive vs. transformative), it also requires 3PAO concurrence before proceeding with transformative changes.\r\n\r\nThis effectively reintroduces an approval gate under a different label. Please clarify:\r\n\r\n- Whether 3PAOs may override a CSP’s risk determination\r\n- What recourse CSPs have if 3PAOs delay, dispute, or refuse to concur on a justified transformative change\r\n- Whether FedRAMP will provide escalation or arbitration support in such cases\r\n\r\nWithout clear dispute resolution or scope constraints, this model could undermine the goal of reducing bottlenecks and unintentionally elevate 3PAOs as de facto regulators.",
      "author": "austinsonger",
      "created_at": "2025-05-02T04:01:13Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AxoQ8",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13009980",
      "body": "🔄Define the Role of CSP DevSecOps Pipelines in SCN Automation🔄\r\n\r\nThe current standard does not address how SCNs may integrate with CI/CD or DevSecOps pipelines. Modern CSPs deploy changes frequently via infrastructure-as-code and automated test pipelines. \r\n\r\nRecommend:\r\n\r\n- Clarifying if SCN artifacts can be auto-generated through pipeline triggers\r\n- Providing sample OSCAL-compatible or JSON templates for SCN submission\r\n- Stating whether SCNs must be manually certified by a human or can be machine-signed (e.g., via digital service account)\r\n\r\nAligning SCNs with modern deployment practices is critical for reducing friction and ensuring continuous compliance.",
      "author": "austinsonger",
      "created_at": "2025-05-02T04:02:06Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AyEB9",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13123709",
          "body": "I get the impression that the policy is trying to be future resilient by not being over prescriptive",
          "author": "wisecryptic",
          "created_at": "2025-05-12T22:16:38Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AxoRB",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13009985",
      "body": "🧭 Require a Risk-Based Time Horizon Instead of Fixed Meeting Timelines 🧭\r\n\r\nRequiring two sequential monthly meetings for all transformative changes imposes an artificial time constraint that may not align with the actual risk posed by the change.\r\n\r\nRecommend allowing timeframes to be:\r\n\r\n- Risk-adjusted based on impact and affected controls (e.g., 1 week for low-impact auth method update, 2 months for DB architecture change)\r\n- Tied to system impact level or change type\r\n\r\nThis would better match the stated goal of moving from compliance-based to security-based assessment.",
      "author": "austinsonger",
      "created_at": "2025-05-02T04:03:17Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AxoRH",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13009991",
      "body": "🧩 Add “Change Dependency” Metadata for Interconnected Services 🧩 \r\n\r\nSCNs often impact interconnected systems or shared service components.\r\nRecommend FedRAMP require SCNs to list:\r\n\r\n- Whether the change is dependent on, or affects, other FedRAMP-authorized systems\r\n- Any shared service (e.g., IAM, logging, encryption) that may cascade impact\r\n\r\nThis allows agencies and assessors to understand aggregate risks across systems that share core architecture or infrastructure (e.g., multi-tenant IDPs or message queues).",
      "author": "austinsonger",
      "created_at": "2025-05-02T04:04:11Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AxoRO",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13009998",
      "body": "📉 Provide Explicit Exemption Path for “Security-Only Hardening” Changes 📉 \r\n\r\nNot all significant changes raise risk — some, like control hardening, reduce it (e.g., tightening firewall rules, removing legacy protocols).\r\n\r\nRecommend FedRAMP add a clause stating:\r\n- If a change exclusively increases security without altering functionality or exposure, it may be exempted from transformative treatment\r\n- This must be documented and certified in the SCN\r\n\r\nThis aligns with Rev 5 and OMB A-130’s emphasis on managing actual risk posture, not procedural formality.",
      "author": "austinsonger",
      "created_at": "2025-05-02T04:05:02Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AxvQ3",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13038647",
          "body": "@austinsonger based on the definitions section of the proposed solution, the examples that you provided would fall into Vulnerability Mitigation and should already be classified as a routine change. \r\n\r\nSince the exclusionary list is so short, it leaves a bit of room for interpretation, and I think that is where the charter and AO agreement comes in.  For instance, minor releases of all of the pre-existing services and applications should be routine, and performed with patch management.  Even some version changes may be considered routine, (going from python 2.7 to python 3.12 in a support feature that doesnt impact the CIA of CUI). But switching baselines because of EOL, while a security change, should also be considered a major change that requires re-assessment.  \r\n\r\n```\r\nDefinitions\r\n\r\nThe following definitions apply to all FedRAMP materials:\r\n\r\na. “Significant change” has the meaning given in [NIST SP 800-37 Rev. 2](https://csrc.nist.gov/pubs/sp/800/37/r2/final) or any successor document. As of April 2025 that means “a change that is likely to substantively affect the security or privacy posture of a system.”\r\n\r\n    FedRAMP excludes routine recurring activities that are part of ongoing operations or vulnerability mitigation and remediation from the criteria for determining significant changes. Such changes are NOT considered significant changes for the purposes of this standard.\r\n```",
          "author": "Telos-sa",
          "created_at": "2025-05-05T12:17:15Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ax4wf",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13077535",
      "body": "> \"FedRAMP excludes routine recurring activities that are part of ongoing operations or vulnerability mitigation and remediation from the criteria for determining signiﬁcant changes. Such changes are NOT considered signiﬁcant changes for the purposes of this standard.\"\r\n\r\nUse of \"vulnerability mitigation and remediation\" language is very broad and may contradict scenarios that would trigger an adaptive and/or transformative change defined later in the document. For example, a CSP may need to introduce an entirely new tool or technology to \"remediate\" an identified vulnerability - which seems like it would fit as an adaptive or transformative change. FedRAMP should consider updating the language to specify routine changes as \"....ongoing operations or vulnerability patching...\".\r\n\r\n> Providers MUST follow the procedures documented in their security plan to plan, test, perform, assess, and document changes. \r\n\r\nThe reference to a CSP's \"security plan\" is unclear.  FedRAMP should consider elaborating on the expectations for what should be included within the security plan.\r\n\r\n> 5. Providers MUST keep historical signiﬁcant change notiﬁcations available to agency customers until the service completes its next annual assessment. \r\n> 6. Providers MUST maintain auditable records of these activities and make them available to FedRAMP, agencies, and contracted 3PAOs.  \r\n> 7. Providers MUST make ALL signiﬁcant change notiﬁcations and related audit records available in similar human-readable and compatible machine-readable formats.\r\n\r\n> 12. Providers MUST notify FedRAMP and agency customers at least 14 calendar days in advance of the ﬁrst monthly monitoring meeting BEFORE discussing planned transformative changes. \r\n> 13. Providers MUST notify FedRAMP and agency customers within 1 calendar day AND at the next monthly monitoring meeting AFTER making transformative changes. \r\n\r\nIt is unclear how CSPs should notify agencies and 3PAOs about significant changes.  FedRAMP should consider providing standardized guidance for significant change notifications. This will help reduce the work on agencies needing to monitor multiple repositories and/or email for all CSPs being consumed.\r\n\r\n> Providers MUST have a 3PAO review the scope and impact of the planned change BEFORE making signiﬁcant changes; providers MUST NOT proceed with signiﬁcant changes without 3PAO concurrence.\r\n\r\nThis language does not clearly specify the activities that should take place during a 3PAO review and what should qualify as \"concurrence\". FedRAMP should consider specifying the activities that should take place during the 3PAO scope and impact review.  For example, the language should include whether the review should be technical and/or documentation focused and whether penetration testing should be considered.\r\n\r\n> 14. Providers MUST have a 3PAO begin assessment of the results no later than 1 calendar day AFTER making transformative changes; this assessment SHOULD be completed within 7 calendar days AFTER making transformative changes. \r\n\r\nNot all changes are created equal.  Imposing a time constraint (i.e., 7 days) for the completion of the 3PAO assessment does not account for large, complex changes. FedRAMP should consider updating this language to focus only on the 3PAO assessment start date vs. end date. For example: \"14. Providers MUST have a 3PAO begin assessment of the results no later than X calendar day AFTER making transformative changes.\" \r\n",
      "author": "mhungate-schellman",
      "created_at": "2025-05-08T15:10:47Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyECx",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13123761",
      "body": "### Overall\r\nFirst, thank you for taking such effort in making a better significant change process. This is likely the biggest rock weighing down the TCO of a FedRAMP program.\r\nThe biggest high-level challenge with the significant change process is the ability of just one agency to hamstring a CSP’s budget and timeline as well as all other agency customers and contractors, and potentially even private sector customers by denying or delaying a change that should be approved. While I don’t necessarily expect a policy scoped to how to perform a significant change to address this, I would not be providing honest feedback to skip this elephant in the room. While it may not be possible with current architectures to achieve this, this is the fundamental issue with the current process along with the excessive time and cost.\r\nAs I understand it, Significant change was defined as a broad term and was meant to be interpreted by agency Subject Matter Experts (SMEs) for their particular system. Hence NIST 800-37 r2 offers a blanket definition that agencies were meant to apply specifically to systems. As such, expert judgment is built into the significant change process for it to work properly. That means that there cannot be a strictly codified classification which I believe this document is congruent with.\r\nAn overarching area of potential misinterpretation of this policy is a reminder that the definition that to be a significant change, the change must affect the security or privacy of the system. If there is no security or privacy impact, it doesn’t matter how big or small the change is, it is not a significant change. If on the other hand, the change is as simple as including a few lines of code that opens an auto-broadcast connection of agency data, those few lines of code, ceteris paribus, would be a significant change.\r\n\r\n### Commentary on Definitions\r\nI like the 4 definition standard\r\n\r\n### Commentary on Clarity/confusion\r\nPoint 1: it feels contradictory to say in the definition section that ‘impact categorization change’ is a significant change, but then in (1) that these changes cannot be done via the significant change process. Impact categorization is also referenced later in the process.\r\nSome additional notes on this, the sum of which is seeking an answer of whether the way this document has been written is considering how an impact categorization change actually happens. \r\n-\tGenerally when going from low to moderate, or from moderate to high, an agency is not re-authorizing a system. Typically it would be a new agency giving a new authorization of the system.\r\no\t Increasing the impact doesn’t require a change to a current agencies’ authorization – that agency can still authorize it only for that level of data while a new agency can authorize at a new level. While it may be confusing, it is the agency’s prerogative, and not required to change\r\no\tDecreasing the impact of a categorization change is trickier. I have never been involved in this situation. There are situations where this would not require a re-authorization, but normally the CSP would lose or shrink the customer in this case\r\no\tIn either of these cases, it seems strange to say the significant change process doesn’t apply. At the very least, this could be clarified to indicate that this policy does not cover that type of change and the full FedRAMP process should be followed.\r\npoint 7: to require both human readable and machine readable formats, while not overly onerous, seems early for its time. A machine-lite process could conceivably store a significant change event in a csv file which could be rendered via machine ingress or an excel visual, but to require ALL notifications (every communication about a significant change?) and related audit records (all records associated with a change?) available in BOTH human and machine readable formats feels overly burdensome or not clear enough.\r\nSuggest rewording (if the PMO and community really feel it propitious to jump into machine readable formats today) would be as follows:\r\n\t“Providers MUST make a human readable and machine readable format of a record of the change and the date of the latest notification”.\r\n\r\n### Recommended modifications\r\nI appreciate the thought of the transformative change section, but as constituted, I feel it will lead to contradictions for many changes.\r\nWhile transformative changes technically have security and privacy change embedded in the definition per the 800-37, the definition in the policy document is worded so as to focus primarily on the size of the change to the system, not the change to the privacy and security. This raises the question in my mind: how often does FedRAMP expect a system to go through a transformative change? As written, it should be an extremely rare event for almost all providers. If this is not the case, I would like to make sure this focuses on security and privacy changes, not changes en gros as the intention from fedramp and course correct to that.\r\n-\t3PAOs should be in the service of CSP’s in serving the Agency – they should not be the gatekeepers. As worded currently, there will likely be a new arrangement between 3PAOS and CSPS not included in most SOWs. It is also unclear just how much work the CSP vs the 3PAO needs to do.\r\n-\tA transformative change may be rolled out over days/weeks/or even months. During different stages, different CIA functions may be deployed, verified, potentially rolled back, potentially delayed, and redeployed.\r\n-\tSometimes an emergency change is necessary to be deployed before a 60-90 day window. While most of these will likely be routine or adaptive, I can think of examples that could fit the definition of transformative\r\n-\tNotifications and publication instructions are highly prescriptive – This feels like it is drifting from what provides value to what can be quantified.\r\n-\tI personally dislike notifying FedRAMP of changes through the same path as agencies. Impersonally, it seems contradictory to be offloading responsibilities from FedRAMP, but then onloading this notification to FedRAMP. I think FedRAMP should have access to the records through the connect.gov repository but not be otherwise in the notification loop unless otherwise required by agencies.\r\n-\tThere is a paradox that I don’t see addressed inherent in the process – changes can only be assessed after they have been implemented in the operational production environment, but risk exposure is already realized at that point. This means the 3PAO is not assessing a risk that could affect the environment, the 3PAO is always assessing a risk that is already affecting the environment and determining the impact.\r\nBased on this, here are my recommended changes to Application of the Significant Change Notification Standard. Strike entire transformative change section and replace with:\r\n\r\nIf the significant change is a transformative change, also:\r\n(9). Providers MUST notify the agency prior to deploying the change as follows:\r\n-\tWhere possible, Providers SHOULD notify agency customers of regularly planned and scheduled transformative changes for the following authorization cycle or as soon as the change has reached an internal approval threshold\r\n-\tAs a standard practice, providers MUST notify agency customers within 60 days of beginning a deployment of the environment.\r\n-\tBy exception, providers MAY provide a notification later than 60 days, but in such cases, providers MUST:\r\no\tDescribe why the 60 day threshold was not adhered to\r\no\tDescribe the justification for the urgency of the change\r\no\tDescribe how other security or procedural standards will not be comprised for the duration of the change.\r\n(10) Providers SHOULD include a 3PAO note with the notification. If requested by an agency, Providers MUST include a 3PAO note on the change.\r\n{discussion: motivations should be balanced here. Agencies, even acting in good faith, will lean on the safest route possible, raising cost and slowing momentum. 3PAOS, even acting in good faith, will lean over time to assess more and more, raising cost and slowing momentum. Providers, even acting in good faith, will lean on finding the fastest route possible to release new improvements as long as they don’t lose customers over it.\r\nHow to balance these so that the agencies don’t choke progress, the 3PAOS don’t wring it, and the providers don’t bypass it?\r\nWorking backward, a 3PAO note should be as light of a lift as possible commensurate with the change early in the process. During first notification, this should be a light advisory note: - describe impact, risks, etc. to the system, and potentially a recommendation if the 3PAO. If the Provider feels like a note is not necessary, there should be ample time for an agency to respond and approve or ask for one, and preferably with a specific request so that the agency has more skin in the game with a measurable outcome.\r\nBased on the 3PAO note, the proposed change, and the proposed plan, every party is better informed on what should be required the next 60 days and what is not.}\r\n(11) Providers MUST include a proposed tentative assessment date.\r\n{discussion: it is not ideal to create one-off assessments unless absolutely necessary. It is much better to roll a change into an annual assessment.The question arises ‘how long should a gap exist between a system change and an assessment? This should be proposed by the Provider, recommended or not recommended by the 3PAO, and made clear and transparent to the Agency, with bias towards annual assessment roll-ups. Remember, by the time an 3PAO assesses anything, the risk is already realized in the system; the 3PAO isn’t stopping risk from entering the environment, it is identifying risk that has already entered the environment. This may require some negotiation but should be flexible.}\r\n(12) Providers MUST remind agency customers at least 14 calendar days in advance of deployment. \r\n(13) Providers SHOULD remind agency customers 30 days in advance of deployment.\r\n(14) Providers SHOULD automatically OPT OUT agency customers of transformative changes where possible and appropriate.\r\n(15) Providers SHOULD delay or roll back change implementation based on significant increases in unmitigated risk that exceed their documented thresholds.\r\n\r\n### Application of the significant change notification standard\r\nI acknowledge that 3PAOS have a responsibility to accurately report on if FedRAMP is being adhered to, but I disagree with the wording of point D. I would rewrite it as follows:\r\nD. 3PAOs MUST independently notify FedRAMP when in their assessment, a provider is introducing material risk in the administration of their significant change process.\r\n\r\nSignificant change notification requirements: name and title of approver should default to system owner, other title by exception.\r\n",
      "author": "wisecryptic",
      "created_at": "2025-05-12T22:23:41Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyF8h",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13131553",
      "body": "# General Observations / Feedback\r\n\r\nGreat to see this more agile approach to dealing with CSO changes!  Here are a few areas where we have questions or need clarification:\r\n\r\n### 1) Drift Between AO Authorization and Services Provided\r\n\r\n- There is a potential drift between what an AO has authorized (e.g., during initial authorization) versus what services the CSO currently provides to customers. Under this new approach, aside from \"Impact Categorization changes\", will changes (e.g., new features, services, etc.) generally be considered \"authorized\"?  And for \"Transformative changes\" where the CSP must have prior consultation with agencies, do CSPs require any (agency/FedRAMP) approvals before preceding with the change?\r\n\r\n### 2) Definitions of \"Adaptive\" vs. \"Transformative\"\r\n\r\n- Will FedRAMP provide more guidance to support these definitions? For example, upgrading from one version of a Linux distribution to another version is probably an adaptive change. However, what if the change is from one Linux distribution to a completely different one, or even from Linux to Windows? Some examples of common significant changes and how they align with the new proposed change categories would be very helpful.\r\n- Similarly, a new feature or service within a CSO is likely to be considered \"transformative,\" but what if it leverages the same security controls as other previously authorized services and analysis shows it is in fact a low risk?\r\n\r\n### 3) Consultation with Agencies for \"Transformative\" Changes\r\n\r\n- If a CSP has authorizations from multiple agencies, is the CSP expected to coordinate with each customer agency prior to making the change? This process could result in significant delays.\r\n- If a CSP has authorizations from multiple agencies and some subset of their customer agencies are affected by the planned/proposed change, what is the expected path forward for the CSP?\r\n\r\n### 4) Transformative Change Bullet 11\r\n\r\n- The two sequential months specified in Bullet 11 for transformative changes may be overly restrictive. What if the transformative change is required for remediation?\r\n\r\n### 5) What Qualifies as a \"Notification\"?\r\n\r\n- Notifying each agency customer individually may be burdensome for the CSP. Would a publish/subscribe feed where the CSP publishes SCRs to a thread, and subscribed customers are automatically notified, suffice? This approach could simplify the requirements (Bullets 11-13), allowing the CSP to post their notification X days before making the change, with a follow-up notification X days after the change has been made. The second notification could reference security details, such as new vulnerabilities related to the change (which could be provided as part of that month's ConMon).\r\n\r\n### 6) Timely Communication\r\n\r\n- Formalize significant change notifications requiring inclusion of the following: \r\n  1. A notification date\r\n  2. A (planned or actual) change date  \r\n  This will enable 3PAOs to easily assess if notifications are sent in accordance with the timelines set by FedRAMP in their significant change notification standard.\r\n\r\n---\r\n\r\n# Recommendations\r\n\r\n### 1) Assess CSP's Process for Handling Significant Changes\r\n\r\n- One approach could be to have CSP's processes for handling significant changes assessed by a 3PAO (e.g., during the initial authorization or at an annual assessment if already in ConMon) in order to provide assurance to agencies and FedRAMP that CSP security operations and change management are satisfactory. Once the process is assessed and approved, the CSPs would only be required to notify agencies of pending or new changes.\r\n\r\n- Instead of predefining change categories (e.g., adaptive vs. transformative), why not emphasize the **Security Impact Analysis (SIA)** as the method to identify significant versus non-significant changes? \r\n  - If the CSP’s SIA indicates the change would have a **high** security impact, the CSP must:\r\n    - Have the change approved by an executive (e.g., CISO)\r\n    - Include a plan for remediation\r\n    - Provide an attestation letter from a 3PAO\r\n    - Include the SIA as part of the next ConMon monthly deliverable\r\n    - Notify the AO(s) prior to the change, per RFC-0007.\r\n  \r\n  - If the CSP’s SIA indicates the change would have a **moderate** security impact, the CSP must:\r\n    - Have the change approved by an executive (e.g., CISO)\r\n    - Include a plan for remediation\r\n    - Provide an attestation letter from a 3PAO\r\n    - Include the SIA as part of the next ConMon monthly deliverable\r\n    - Notify the AO(s) after the change is made (e.g., as part of the next ConMon deliverable).\r\n\r\n\r\n",
      "author": "Rene2mt",
      "created_at": "2025-05-13T13:38:32Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AyF_O",
          "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13131726",
          "body": "@Rene2mt This is cool.  \r\nI *really* like the idea of using the SIA, and to that end, I'd recommend a structured SIA template or heuristic to make this standard.  I think by standardizing the SIA, it would also solve confusion between Adaptive vs Transformative changes.\r\n\r\nI also like the idea of vetting a process by a 3PAO.  If you follow this well defined and assessed process, then the result of that process only requires a soft touch attestation vs a full assessment.  \r\n\r\nThis aligns somewhat with the clunky former 'FedRAMP Service Onboarding' process, where you validate that most of the environment remains static, and services (changes) are defined by specific categories.",
          "author": "jsantore-cgc",
          "created_at": "2025-05-13T13:49:47Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AyZT3",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13210871",
      "body": "I have a concern with “D. 3PAOs MUST independently notify FedRAMP when Providers do not follow this standard appropriately.”\r\n\r\nI fully understand that 3PAOs must ensure that FedRAMP security controls are correctly implemented, and that is what the AA is designed for. I am not talking about Major components or major functional changes.  CSP may determine that a change is Adaptive, and a 3PAO might say it is Transformative. There is a financial incentive for the 3PAO for a Transformative change and concern by the CSP for not agreeing, for fear of being “reported.” \r\n\r\nIt should be up to the CSP, based on a SIA, to make the determination (see below RFC-009), and if determined to be adaptive, then the assessments for the changes will be rolled into the annual.\r\n\r\nPart of the purpose of the AA is if FedRAMP standards are being appropriately followed, and the AA should be the forum for the 3PAO to make any notifications.\r\n\r\nReferring to “RFC-0009 Significant Change Notification Technical Assistance” \r\n_\"The cloud service provider is solely responsible for determining when the FedRAMP Significant Change Notification Standard should be applied and for determining if a significant change is an adaptive change, transformative change, or impact categorization change. Cloud service providers do not need to consult with third-party assessment organizations if the provider determines the change is adaptive.\"_\r\n\r\n",
      "author": "JeffWillis-MIS",
      "created_at": "2025-05-20T19:21:56Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZW7",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13211067",
      "body": "The definitions should be updated to be consistent with the definitions of RFC-0009 https://www.fedramp.gov/rfcs/0009/\r\n\r\nThe 0009 definitions are more consistent with the real world and eliminate some of the ambiguity. \r\n",
      "author": "JeffWillis-MIS",
      "created_at": "2025-05-20T19:44:19Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Aycrb",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13224667",
      "body": "GovRAMP supports the modernization of the significant change process to align with technological progress. We recommend:\r\n•\tPublishing clearer guidance distinguishing adaptive from transformative changes.\r\n•\tBeing available for calls with a CSP to help determine whether the change is adaptive or transformative.\r\n•\tPublishing guidance for how adaptive changes will be verified.\r\n•\tCreating a repository to document future determinations, establishing precedents and promoting consistency.\r\n",
      "author": "Leah-GovRAMP",
      "created_at": "2025-05-21T19:58:32Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Aycyn",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13225127",
      "body": "Providers MUST follow the procedures documented in their security plan to plan, test, perform, assess, and document changes.\r\n\r\n> The SSP might not be fully up-to-date with the specific security considerations relevant to a new feature or service. Applying existing procedures without tailoring them could result in inadequate testing and assessment unique to the new functionality.\r\n\r\nProviders MUST have a 3PAO review the scope and impact of the planned change BEFORE making significant changes; providers MUST NOT proceed with significant changes without 3PAO concurrence.\r\n\r\n> Providers should be responsible for scope and impact assessments and preparation for meeting applicable FedRAMP, including SCR requirements. Introducing a 3PAO review too early in the process decreases a Provider’s internal ownership of development and potentially adds cost (internally and with the 3PAO) and time to the development process. \r\n\r\nProviders MUST work with a 3PAO to develop a security assessment plan BEFORE making transformative changes.\r\n\r\n> See comment for 11.\r\n\r\nProviders MUST discuss the planned change during two sequential monthly monitoring meetings BEFORE making transformative changes.\r\n\r\n> Recommend that transformative changes that add major functionality, but can be hidden from agency customers, not be subject to these timelines before making the change. Rather, that this notification timeline be followed before making the new functionality available to the agency customer.\r\n\r\nProviders MUST notify FedRAMP and agency customers at least 14 calendar days in advance of the first monthly monitoring meeting BEFORE discussing planned transformative changes.\r\nProviders MUST notify FedRAMP and agency customers within 1 calendar day AND at the next monthly monitoring meeting AFTER making transformative changes.\r\nProviders MUST have a 3PAO begin assessment of the results no later than 1 calendar day AFTER making transformative changes; this assessment SHOULD be completed within 7 calendar days AFTER making transformative changes.\r\n\r\n> Recommend timelines be expanded or allow for exceptions in the event the change type is significant enough to require more time to address this requirement\r\n> Recommend business day, instead of calendar day, given that changes can take place during off-hours.\r\n\r\nProviders MUST publish updated service documentation and other materials to reflect transformative changes within 3 calendar days AFTER making transformative changes.\r\n\r\n> Recommend timelines be expanded or allow for exceptions in the event CSP personnel are not able to meet proposed deadlines if change type is significant enough to require more time to address this requirement\r\n\r\nProviders SHOULD automatically OPT OUT agency customers of transformative changes where possible and appropriate.\r\n\r\n> This should not be the case provided transformative changes are replacing functionality that is vital for the operation of the service offering and appropriate SCR procedures have been executed appropriately.\r\n\r\nProviders SHOULD delay or roll back change implementation based on significant increases in unmitigated risk that exceed their documented thresholds.\r\n\r\n> Rollback of change implementation should follow providers internal change management procedures (provided they meet generally accepted/best practice requirements). Otherwise, unmitigated risks should align with continuous monitoring and POA&M processes.\r\n\r\nCopy of the business or security impact analysis (including 3PAO concurrence, if applicable)\r\n\r\n> Will minimum requirements be established for what an impact analysis will need, or will it be up to the CSP/3PAO to determine if existing processes are adequate to avoid duplication of efforts or having to recreate company-wide procedures based on undefined criteria?\r\n\r\n",
      "author": "sfc-gh-schaudhry",
      "created_at": "2025-05-21T20:39:33Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyjSn",
      "url": "https://github.com/FedRAMP/community/discussions/4#discussioncomment-13251751",
      "body": "A transformative change requires days before 14 days and two sequential monthly monitoring meetings prior to the change. Then after the change the 3PAO has only 7 days to complete the SAR. I do not understand how CSPs/3PAOs can complete both Initial and Remediation scans during the 7 day window; then process the results; get it through quality assurance; and publish the SAR in 7 days.",
      "author": "Peter-Harroun",
      "created_at": "2025-05-23T22:26:16Z",
      "replies": []
    }
  ]
}