{
  "id": "D_kwDOOxfoic4Af-Ma",
  "url": "https://github.com/FedRAMP/community/discussions/7",
  "title": "FedRAMP RFC-0010: FedRAMP Scope Interpretation Technical Assistance (CLOSED)",
  "body": "\r\n# RFC-0010 FedRAMP Scope Interpretation Technical Assistance\r\n\r\n> - Status: Open\r\n> - Created By: FedRAMP PMO\r\n> - Start Date: 2025-05-15\r\n> - Closing Date: 2025-06-15\r\n> - Short Name: rfc-0010-scope-technical assistance\r\n\r\n## Where to Comment\r\n\r\n- Discussion Forum: [https://github.com/FedRAMP/rfcs/discussions/31](https://github.com/FedRAMP/rfcs/discussions/31)\r\n- Public Comment Form: [https://forms.gle/MkHUDacjLmXQswYf9](https://forms.gle/MkHUDacjLmXQswYf9)\r\n- Email: pete@fedramp.gov with the subject \"RFC-0010 Feedback\"\r\n\r\n## FedRAMP Guidance Types\r\n\r\n- **Standards** are base requirements that can be applied in any environment and will change rarely\r\n- **Best Practices** support standards with methods, techniques, or examples and may change often\r\n- **Technical Assistance** supports standards with additional technical nuance to support decision making and may change often\r\n\r\n\r\n## Summary\r\n\r\nThis Request for Comment (RFC) seeks public input on draft interpretive technical assistance for OMB Memorandum M-24-15, Section 3, \"Modernizing the Federal Risk and Authorization Management Program (FedRAMP).\" This technical assistance provides additional technical nuance to support agency decision-making regarding the categories of cloud services excluded from FedRAMP requirements. The draft document offers interpretive guidance with illustrative examples for each of the five exclusion categories defined in M-24-15, along with a summary table to aid consistent application across federal agencies.\r\n\r\n## Motivation\r\n\r\nOMB Memorandum M-24-15 updated FedRAMP's scope and mandated the publication of clarifying guidance to aid agencies in interpreting the defined exclusion categories. Section 3 of M-24-15 states: \"FedRAMP, in consultation with OMB, will publish guidelines for interpreting the categories above, with supporting examples that clearly illustrate what types of services are in and out of scope.\"\r\n\r\nThis draft technical assistance has been developed to fulfill that requirement by providing the necessary technical nuance to help agencies navigate and make consistent determinations about FedRAMP applicability.\r\n\r\nTo ensure maximum reusability of this technical assistance across agencies and encourage thoughtful implementation, the guidance provides key criteria that agencies can apply when evaluating cloud services. This approach allows agencies to focus resources on services that genuinely require FedRAMP authorization while avoiding unnecessary burden for services that fall outside the scope of FedRAMP.\r\n\r\n## Explanation\r\n\r\nThe full draft technical assistance is approximately 5 pages and is available for review in the following formats:\r\n\r\n- [Basic web formatting on fedramp.gov](https://fedramp.gov/updates/rfcs/0010)\r\n- Basic text markdown on GitHub (below)\r\n- [PDF file: rfc-0010-scope-interpretation-technical-assistance.pdf](https://github.com/FedRAMP/rfcs/raw/main/rfc/assets/0010-FedRAMP-scope-interpretation-technical-assistance.pdf)\r\n- [Word file: rfc-0010-scope-interpretation-technical-assistance.docx](https://github.com/FedRAMP/rfcs/raw/main/rfc/assets/0010-FedRAMP-scope-interpretation-technical-assistance.docx)\r\n\r\n\r\n## Discussion Requested\r\n\r\nFedRAMP is seeking feedback on all aspects of this draft technical guidance. We encourage specific comments on, but not limited to, the following areas:\r\n\r\n- Are exclusion explanations clear, concise, and easy for a non-technical reader to understand?\r\n- Are the sections \"When FedRAMP Doesn’t Apply\" and \"Key Tests\" accurate and provide practical guidance for making determinations?\r\n- Is the distinction between \"Out of Scope\" and \"In Scope\" clearly illustrated with relatable examples for various cloud service models?\r\n- Does the guidance offer sufficient clarity on how to handle hybrid scenarios or situations where only a portion of a service falls under FedRAMP requirements?\r\n- Are there any terms used that could be interpreted differently across agencies, and if so, are definitions or further explanations needed?\r\n- Are there areas involving AI or other emerging technologies that require additional information to inform agency evaluation of FedRAMP scope applicability? \r\n\r\n---\r\n# RFC-0010 FedRAMP Scope Interpretation Technical Assistance\r\n\r\nThursday, May 15th, 2025\r\n\r\n---\r\n\r\n# Background\r\n\r\nOMB Memorandum [M-24-15 \"Modernizing the Federal Risk and Authorization Management Program (FedRAMP)](https://www.fedramp.gov/assets/resources/documents/FedRAMP_Policy_Memo.pdf) updated FedRAMP's scope, defining categories of services excluded from its requirements. To ensure consistent application of these exclusions across agencies, the memorandum requires the publication of clarifying guidance, stating in section 3 “*FedRAMP, in consultation with OMB, will publish guidelines for interpreting the categories above, with supporting examples that clearly illustrate what types of services are in and out of scope.*”\r\n\r\nThe information is provided for public awareness. Reference to any commercial product does not constitute endorsement by GSA. For more information, please see [FedRAMP Disclaimers](https://www.fedramp.gov/disclaimers/).\r\n\r\n# Introduction\r\n\r\n[M-24-15 \"Modernizing the Federal Risk and Authorization Management Program (FedRAMP)](https://www.fedramp.gov/assets/resources/documents/FedRAMP_Policy_Memo.pdf) establishes that agencies must apply FedRAMP when acquiring cloud services to create, collect, process, store, or maintain Federal information on behalf of a Federal agency, unless the service meets specific exclusion criteria outlined in the policy. This requirement enables standardized security assessment reuse and consistent monitoring across the federal government, promoting efficiency and enhancing security posture.\r\n\r\nFedRAMP does not apply to all internet-based services used by agencies. M-24-15 Section 3 clearly defines specific categories of cloud services that are out of scope. Furthermore, agencies may use the same service offering differently based on mission needs, and each agency must determine FedRAMP applicability based on their specific implementation, use case, and risk profile.\r\n\r\nThis technical assistance clarifies the initial step of determining if FedRAMP requirements apply to a cloud service, based on the agency's specific use and the out-of-scope categories defined in M-24-15. While M-24-15 includes various processes and flexibilities for services requiring authorization, this guidance focuses solely on interpreting the scope exclusions.\r\n\r\nBest practices and technical assistance MUST NOT be used as a checklist. All examples are for discussion purposes ONLY. This technical assistance is designed for reasonable people to have reasonable discussions about FedRAMP applicability based on their specific use of a cloud service. \r\n\r\nThis Technical Assistance document will be continuously updated to reflect evolving interpretive needs based on M-24-15's scope requirements. This includes updates to reflect any additional excluded categories identified by the FedRAMP Board with Federal CIO concurrence, or exceptions made by the FedRAMP Director with OMB approval. \r\n\r\n# Determining FedRAMP Scope \r\n\r\nThis guidance provides practical examples to help agencies navigate FedRAMP applicability decisions to ensure consistent implementation of M-24-15 across the federal government. The examples below illustrate how to interpret each of the out-of-scope categories defined in Section 3 of the OMB Memorandum. This guidance is not intended to be a complete listing of all possible examples or exclusions. Agencies must perform their own analysis and may find that some use cases may fall into multiple exemption categories outlined below\r\n\r\n### Information systems that are only used for a single agency’s operations, hosted on cloud infrastructure or platform, and are not offered as a shared service or do not operate with a shared responsibility model;\r\n\r\n**When FedRAMP Doesn’t Apply:** The service is exclusively for a single agency's operations and not intended for reuse or reconfiguration by other agencies.\r\n\r\n**Key Tests:**\r\n\r\n* Single agency operational and configuration responsibility  \r\n* No assessment to reuse  \r\n\r\n**Examples:**  \r\n\r\n* Agency custom applications deployed to FedRAMP authorized IaaS   \r\n* Agency deployed instances of an app from a FedRAMP authorized PaaS vendors App Storefront  \r\n* Agency mission systems operated by a single agency with no shared operation or configuration responsibility  \r\n    \r\n**Out of Scope Detailed Example \\- Data.gov:** GSA operates data.gov, a cloud hosted platform which allows agencies to share open datasets. While multiple agencies can contribute datasets, GSA maintains full responsibility for the systems configuration, operations, and authority to operate. \r\n    \r\n> **Analysis:** Single operator; no shared platform responsibility.\r\n\r\n    \r\n**In Scope Detailed Example \\- USDA AgCloud Managed Platform Services (AMPS):** AMPS is a fully-managed DISC platform designed to give customers a supported and secure way to cloud computing. AMPS includes security services, patching services, administration services, and inheritable Authority to Operate (ATO) security controls for these managed services. Simply stated, AMPS provides the infrastructure on which customers may deploy their applications.AMPS provides a standardized, secure cloud platform that allows agencies to quickly deploy applications without managing the underlying IT infrastructure. By offering a shared, pre-configured environment with consistent security standards, AMPS assumes responsibility for the underlying platform, while customer agencies manage their applications.\r\n\r\n> **Analysis:** Reusable platform; shared responsibility model.\r\n\r\n### Social media and communications platforms used in accordance with agency social media policies\r\n\r\n**When FedRAMP Doesn’t Apply:** The service is not an authoritative repository for federal information, and its unavailability would not result in the loss of federal information.\r\n\r\n**Key Tests:**\r\n\r\n* Used in accordance with agency social media policies including compliance with Federal Records Act  \r\n* Primary purpose is external communication  \r\n* Not used as an authoritative source for federal information  \r\n* All federal information in the communication platform is intended for public use  \r\n    \r\n**Examples:**  \r\n\r\n* Agency social media accounts (e.g., X, Facebook/Meta) including platform AI features (like content suggestions, public analytics, and sentiment analysis) that do not respond on behalf of the agency  \r\n* Scientific collaboration platforms (protocols.io)  \r\n    \r\n**Out of Scope Detailed Example \\- Scientific Collaboration:** Agency researchers use protocols.io to communicate with the scientific community and share information. If protocols.io went away, the agency wouldn’t lose any federal information so the platform isn’t within the scope of FedRAMP. \r\n\r\n> **Analysis:** External communication using public information; not an authoritative source.\r\n\r\n    \r\n**In Scope Detailed Example \\- Government Collaboration:** Agency teams use collaboration platforms (e.g., Slack, Teams) for internal and cross-agency work, processing and storing sensitive, non-public federal information. Handling this information on behalf of agencies necessitates FedRAMP authorization. \r\n\r\n> **Analysis:** Handles internal, non-public federal information.\r\n\r\n### Search Engines\r\n\r\n**When FedRAMP Doesn’t Apply:** The search engine is used primarily for public information discovery and does not store, index, or maintain internal federal information on behalf of the government.\r\n\r\n**Key Tests:**\r\n\r\n* Primary function is public information discovery  \r\n* Does not collect or maintain federal information for agencies  \r\n* Users instructed not to input sensitive federal information  \r\n    \r\n**Examples:**  \r\n\r\n* Public web search engines (e.g., Google, Bing, Lycos) using only public or non-sensitive federal information  \r\n* Public AI Chatbots (e.g., ChatGPT, Claude, Grok) using only public or non-sensitive federal information\r\n\r\n**Out of Scope Detailed Example \\- AI search chatbot:** An agency uses a public AI Chatbot search to troubleshoot technical issues with a video conferencing system. Search queries of public or non-sensitive federal information may be logged by the vendor, but not FOR the agency. Because no internal data is accessed or trained on, FedRAMP doesn’t apply.\r\n\r\n> **Analysis:** Searches public information; does not collect or maintain internal federal information for the agency.\r\n\r\n\r\n**In Scope Detailed Example \\- Internal Data Search:** An agency uses a shared cloud service to index and search internal repositories containing non-public federal information (e.g., documents, emails, databases). Because the service collects, processes, and maintains internal federal information on behalf of the agency, FedRAMP authorization is required.\r\n\r\n> **Analysis:** Collects, processes, and maintains internal agency data for the agency.\r\n\r\n### Widely available services that provide commercially available information to agencies, but do not collect Federal information\r\n\r\n**When FedRAMP Doesn’t Apply:** The commercial information service does not collect or maintain federal information on behalf of the government.\r\n\r\n**Key Tests:**\r\n\r\n* Provides commercial services to agencies and the general public   \r\n* May temporarily process federal information (such as an address) to provide a response, and may maintain records of past requests, but does not collect or maintain federal information for the government   \r\n  * The agency does not require the service to retain or provide access to this information after the transaction or service delivery is complete  \r\n* Risk of unexpected exposure of federal information is accepted because the positive impact on the agency’s mission is greater than the impact of the government’s use of the system being exposed  \r\n    \r\n**Examples:**  \r\n\r\n* Map services  \r\n* Public Certificate Authorities (e.g., Let's Encrypt, DigiCert) and DNS Resolvers  \r\n* Document and Address verification services  \r\n* Non-IT service providers such as airline ticketing or ride sharing systems\r\n\r\n**Out of Scope Detailed Example \\- Janitorial Services Scheduling:** An agency sends building information and access information to a cloud scheduling portal used by their janitorial service company. The company uses the information to ensure that buildings are serviced and that janitors can access the building.\r\n\r\n> **Analysis:** Acquired non-IT service; cloud tool use is incidental; does not maintain federal information for the agency.\r\n\r\n\r\n**Out of Scope Detailed Example \\- Verification Services:** An agency uses an address-validation service API which returns a true/false “match” and then discards the data. The service doesn’t retain the federal information and there is little risk as the service is authoritative for the information provided (addresses), making it a service that falls outside the FedRAMP scope.\r\n\r\n> **Analysis:** Provides commercial data; temporarily processes federal information; does not maintain federal information for the agency.\r\n\r\n\r\n**In Scope Detailed Example \\- Verification Services (Identity):** An agency uses a cloud Identity Verification service requiring users to submit PII. The service collects, processes, and stores this sensitive federal information (PII) on behalf of the agency to perform identity proofing and for later review. Maintaining federal PII for an agency function necessitates FedRAMP authorization. \r\n\r\n> **Analysis:** Collects and stores sensitive federal PII on behalf of the agency.\r\n\r\n### Ancillary services whose compromise would pose a negligible risk to Federal information or information systems, such as systems that make external measurements or only ingest information from other publicly available services\r\n\r\n**When FedRAMP Doesn’t Apply:** The agency determines, through a specific risk analysis, that the compromise or failure of the ancillary service would pose a negligible risk to federal information or information systems based on the agency's specific use. This determination may vary by agency and use case.\r\n\r\n**Key Tests:**\r\n\r\n* Makes external measurements or ingests only public information  \r\n* Doesn’t control or have privileged access to agency systems  \r\n* A failure or compromise would not compromise the delivery of agency services   \r\n    \r\n**Examples:**  \r\n\r\n* Basic upstream traffic filtering/DDoS (no decryption, negligible availability requirements)  \r\n* Basic CAPTCHA services on public facing non-sensitive sites and forms   \r\n* Public web analytics and uptime monitoring (Pingdom, StatusPage)  \r\n* Unauthenticated vulnerability and code scanning tools for public facing components or code  \r\n\r\n**Out of Scope Detailed Example \\- Public Monitoring Tool:** An agency uses an external service to monitor its non-critical public website/API availability via pings, logging uptime, and sending alerts. \r\n\r\n> **Analysis:** Externally measures public endpoints; does not ingest or store sensitive federal data.\r\n\r\n    \r\n**In Scope Detailed Example \\- Integrated Monitoring System:** An agency integrates an Application Performance Monitoring (APM) service into its internal applications. This service collects sensitive federal data like distributed traces and detailed logs from internal sources, often via installed agents or privileged API access to other internal systems.\r\n\r\n> **Analysis:** Handles internal, non-public federal information; possesses privileged access to internal systems.\r\n\r\n  \r\n\r\n\r\n# Summary Table\r\n\r\n| Exclusion Category (from M-24-15, Sec 3) | When FedRAMP Doesn't Apply (Core Condition) | Key Tests / Considerations |\r\n| :--------------------------------------- | :--------------------------------------------- | :------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ |\r\n| **1\\. Single Agency Systems:** Info systems for only one agency's operations, hosted on cloud, not offered as a shared service or using a shared responsibility model | The service is exclusively for a single agency's operations and not intended for reuse or reconfiguration by other agencies | • Single agency has full operational & configuration responsibility<br>• No assessment intended for reuse by others |\r\n| **2\\. Social Media & Communications Services:** Used according to agency social media policies | The service is not an authoritative repository for federal information, and its unavailability would not result in the loss of federal information | • Used per agency policy (incl. Records Act)<br>• Primary purpose: external communication<br>• Not authoritative source for federal info<br>• All federal info within is intended for public use |\r\n| **3\\. Search Engines** | The search engine is used primarily for public information discovery and does not store, index, or maintain internal federal information on behalf of the government | • Primary function: public info discovery<br>• Does not collect/maintain federal info for agencies<br>• Users instructed not to input sensitive federal info |\r\n| **4\\. Widely Available Commercial Information Services:** Provide commercially available info to agencies; do not collect federal info (on behalf of the government) | The commercial information service does not collect or maintain federal information on behalf of the government | • Provides commercial services<br>• May temporarily process fed info (e.g., address) but doesn't collect/maintain for the government<br>• Agency never needs its info back from the service<br>• Risk of exposure accepted (mission impact \\> exposure risk) |\r\n| **5\\. Ancillary Services (Negligible Risk):** Compromise poses negligible risk to federal info/systems (e.g., external measurement, public info ingestion) | The agency determines through risk analysis that the failure or compromise of the ancillary service poses negligible risk to federal info and systems. Risk assessment is agency-specific | • Makes external measurements or ingests only public info<br>• Doesn't control or have privileged access to agency systems<br>•A failure or compromise would not compromise the delivery of agency services |",
  "author": "rpalmer-gsa",
  "created_at": "2025-05-15T14:14:47Z",
  "comments": [
    {
      "id": "DC_kwDOOxfoic4AyPyH",
      "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13171847",
      "body": "First off, kudos.  This is one of the cleanest, clearest guidance docs I have seen from FedRAMP.  Thank you.  Please use this as a model.\r\n\r\nThere are a few issues worth considering:\r\na- an agency customer (so the business users, not their security group) thinks 'must be FedRAMPed' even though by the above guidance FedRAMP wouldn't apply.  This is the disconnect between a well meaning consumer treating FedRAMP as a hard requirement even when FedRAMP does not apply.  I have, in the past, to alleviate concerns with government customers who aren't savvy enough to understand, provided an attestation of 'non-applicability of FedRAMP' (particularly for COTS products that would be installed in the agency customer's own cloud environment.)   An on-prem solution does not require FedRAMP.   Any way to educate agencies, especially in the sales/procurement cycle about when FedRAMP doesn't apply, would be much appreciated.\r\n\r\nb- Add-on components that may be cloud native.  Consider an agency on prem solution (either physically on prem, or in agency cloud environment), but there's a new mobile device connector allowing tablets to somehow integrate with that that solution.  I assume the add-on and associated supporting infrastructure would not itself require FedRAMP authorization, even if it's cloud hosted.  \r\n\r\nc- It is worth explicitly calling out the 'rolodex exception' on contact information so it is not deemed Federal Data requiring protection.  By \r\nRolodex exception, I mean names and contact information.  This is more PII specific, but worth addressing.\r\n\r\n> 2.3 Exception of Business Rolodex Information OMB M-07-16, Footnote 6, establishes the flexibility for an organization to determine the sensitivity of its PII in context using a best judgment standard.  The example provided in footnote 6 addresses an office rolodex and recognizes the low sensitivity of business contact information used in the limited context of contacting an individual through the normal course of a business interaction.  The Privacy Overlays refers to this example from OMB M-07-16, Footnote 6, as the “Rolodex Exception.”  PII meeting the “Rolodex Exception” typically presents a very low risk to privacy for the individual or the organization and will not trigger implementation of the low, moderate, or high Privacy Overlays for a system containing only this type of information.  Consistent with NIST and CNSS tailoring guidance, the “Rolodex Exception” is a scoping decision that, when applicable, helps organizations avoid unnecessary expenditures of resources based on a risk determination for this limited subset of PII. `    \r\n>\r\n>For the purposes of implementing the low, moderate, and high Privacy Overlays, PII that may be included in this “Rolodex Exception” is limited to the following business contact information: \r\n>• Name (full or partial) \r\n>• Business street address \r\n>• Business phone numbers, including fax \r\n>• Business e-mail addresses \r\n>• Business organization `\r\n>\r\n> An example of an information system which may meet the parameters of the Rolodex Exception include office rosters that contain only business contact information.   Before choosing to apply the Rolodex Exception, an organization must consider the sensitivity of the PII based on the complete context in which it appears. Business contact information alone can be sensitive under certain circumstances, such as in association with a tax return or on a list of individuals under investigation for fraud, waste, and abuse. Consider, also, whether the contact information includes a blend of business and personal information (e.g., a business phone number may be a personal device, or a business address may be a residential address of a home office). If, after exploring contextual considerations, the organization determines that a system’s use of the business contact information is limited to business contact purposes, then the organization may apply the Rolodex Exception.\r\n(https://www.commerce.gov/sites/default/files/opog/privacy_overlays_entire_document.pdf)\r\n(There may be a better canonical source than this, but you get the idea.  This was the first one I found)\r\n\r\n\r\n",
      "author": "jsantore-cgc",
      "created_at": "2025-05-16T14:21:15Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyZnM",
      "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13212108",
      "body": "**1.  Clarify “Shared Responsibility Model” Language in Category 1**\r\nThe distinction between a single-agency system and a shared responsibility model is a critical scope determinant. However, the current phrasing may be ambiguous for hybrid deployments.\r\n\r\nSuggestion: Include an example where a system is deployed by one agency but leverages reusable modules or containerized services that may later be shared. Clarify whether intent for reuse triggers “shared responsibility” considerations even if only one agency is currently using the system.\r\n\r\n**2. Address FedRAMP Scope for AI Services Consuming Public vs. Internal Data**\r\nThe guidance on search engines and AI chatbots is a strong start, but the rapid adoption of AI services (especially LLMs and foundation models) warrants further elaboration.\r\n\r\nSuggestion: Include examples for AI services integrated into agency workflows (e.g., classification, summarization, or autonomous action-taking) and how FedRAMP scope applies when these services:\r\n\r\n1. Process public-only prompts\r\n2. Train on or store internal agency data\r\n3. Act autonomously on agency systems\r\n\r\n**3. Encourage Structured Boundary Documentation via OSCAL or Machine-Readable Format**\r\nTo support consistent application and encourage reuse across agencies, the interpretation guidance should endorse structured documentation formats such as OSCAL.\r\n\r\nSuggestion: Reference OSCAL system and component definition models for documenting out-of-scope exclusions and scope logic (e.g., metadata flags such as \"out-of-scope\": true with justification). This supports future FedRAMP automation and assessment reusability.\r\n\r\n**4. Expand on “Negligible Risk” and Risk Analysis Requirements for Ancillary Services**\r\nThe ancillary services section leaves discretion to agency-specific risk determinations, but there is a risk of inconsistent application.\r\n\r\nSuggestion: Recommend using a basic impact analysis or checklist aligned to FIPS-199 categorization for evaluating whether a service poses negligible, moderate, or elevated risk to confidentiality, integrity, or availability. This adds structure while preserving flexibility.\r\n\r\n**5. Clarify the Scope Interaction with Non-FedRAMP CDNs and Edge Services**\r\nMany CSPs rely on third-party CDNs or edge compute platforms (e.g., Fastly, Cloudflare) to accelerate delivery of agency applications. It's unclear how these should be categorized when they do not store federal data but handle encrypted or sensitive traffic.\r\n\r\nSuggestion: Include explicit examples of:\r\n\r\n1. A non-FedRAMP CDN acting as a pass-through with no decryption → out of scope\r\n\r\n2. A CDN performing TLS termination, WAF rules, or caching sensitive responses → in scope\r\n\r\nThis guidance will greatly aid CSPs, 3PAOs, and agencies in scoping FedRAMP efforts appropriately, reducing unnecessary burden while maintaining high assurance levels. The decision trees, test questions, and illustrative examples strike a pragmatic balance.\r\n\r\nI support formalizing this guidance as dynamic Technical Assistance under FedRAMP and encourage ongoing updates as new cloud patterns and technologies evolve.\r\n\r\nThank you again for the opportunity to provide feedback and for FedRAMP’s commitment to modernizing cloud security and compliance in alignment with M-24-15.",
      "author": "rgutwein",
      "created_at": "2025-05-20T21:30:03Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AyZqS",
          "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13212306",
          "body": "Thanks so much for the feedback!\r\n\r\nRegarding your first point on clarifying the \"Shared Responsibility Model\": To ensure we understand correctly, could you provide a bit more detail about the specific scenarios you envision? For instance, are you thinking more about shared infrastructure services an agency might use internally and then offer to other agencies? Or are you speaking about the sharable nature of the software modules/containers themselves? What parts of the assessment would be reusable?\r\n\r\nAcross the other questions and scenarios you outline, we have worked to define \"Key Tests\" as a way to help agencies navigate situations and scenarios that aren't explicitly outlined. Do you find that the \"Key Tests\" offer a solid foundation for making determinations based on the scenarios you outline in items 2,4, and 5? Are there ways we can improve the concept of \"Key Tests,\" or outline additional tests that may be missing?\r\n\r\nFinally, do you have thoughts on what might be needed to clarify the interaction between the Scope of FedRAMP Technical Assistance (this) and the [Minimum Assessment Scope RFC-0005](https://github.com/FedRAMP/rfcs/discussions/17).",
          "author": "rpalmer-gsa",
          "created_at": "2025-05-20T22:05:42Z"
        },
        {
          "id": "DC_kwDOOxfoic4AyZz8",
          "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13212924",
          "body": "@rpalmer-gsa \n\nRegarding the Shared Responsibility Model clarification: Yes, the intent was to encourage clearer delineation of when reuse or multi-agency consumption transitions a system into FedRAMP scope, particularly in modular or containerized architectures. For example, an application may be developed by one agency for exclusive use today, but designed with reusable microservices or containerized components (e.g., Docker images, Terraform modules) that another agency could eventually leverage. It would be helpful to confirm whether intent to reuse or potential for reuse (even if unrealized) influences the scoping determination, especially if those components are already decoupled for broader adoption.\n\nOn Key Tests, I do think they offer a strong initial framework, and I support their expansion. It might help to anchor each test in structured logic, potentially aligning to OSCAL fields (e.g., authorization-boundary, information-type, out-of-scope: true, etc.) to support automation and reproducibility across agencies and tooling. This could also support consistent reuse in hybrid use cases.\n\nAs for the interaction between this guidance and the Minimum Assessment Scope RFC-0005, a helpful clarification could involve scoping boundaries for third-party services (e.g., CDNs, AI tools) that may not store federal data, but impact confidentiality or availability due to privileged positioning (e.g., TLS termination, traffic analysis, WAF enforcement). This may sit at the intersection of both guidance documents and would benefit from further harmonization.\n\nThanks again for the opportunity to contribute. ",
          "author": "rgutwein",
          "created_at": "2025-05-20T23:57:32Z"
        },
        {
          "id": "DC_kwDOOxfoic4AzGMj",
          "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13394723",
          "body": "interesting discussion. AI seems fairly easy to classify today but I would be interested to see how that may evolve, especially when when AI talks to another AI",
          "author": "wisecryptic",
          "created_at": "2025-06-06T23:08:21Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AyySm",
      "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13313190",
      "body": "Great document.  Lots of excellent examples.  \"Agency teams use collaboration platforms (e.g., Slack, Teams)\"  More of these types of examples.  The more the better.  As @jsantore-cgc pointed out, I too have had to have deep discussions with people around FedRAMPing their environment because they didn't understand and the examples were lacking.  I would suggest expanding this document or including an appendix that highlights other out of scope examples.\r\n\r\nAs for AI, I would approach that as a completely separate item from Search Engines. It is so widespread and quickly becoming ubiquitous, it really is a different animal than a search engine.  AWS has a Generative AI Security Scoping Matrix that breaks the AI use cases to 5 different scopes (1-5).  You can see it here: https://aws.amazon.com/ai/generative-ai/security/scoping-matrix/  Scope 1-3 all use public of pre-trained models.  4-5 train or augment on your data.\r\n\r\nIn this AI section, calling out the use of Federal Data in prompts will be paramount to proper scoping as well.  Example: Worker uploads a Word document to ChatGPT asking it to create an executive summary.  In Scope?  Out of Scope?  That document is now stored in the AI for use by that user in the future.  It doesn't train the model but the model can reflect on it for future responses.\r\n\r\nCircling back, the use of everyday examples is awesome.  AI could use lots of examples all on its own.",
      "author": "Christcpd",
      "created_at": "2025-05-29T18:56:48Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AzGMw",
      "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13394736",
      "body": "great document. Thanks for including AMPS as an example.\r\nconcerning social media platforms, I have some food for thought on hybrid social platforms - places like telegram, locals, whatsapp etc. these are unique in that sometimes communications are broadcast to the public, sometimes to distinct public groups, sometimes to a single end user that is external to normal agency communications. These are special cases where PII or other sensitive data may be appropriate to release, but it doesn’t make sense to in-scope the entire service, only to understand and implement certain protections around the communication, particularly in policy and encryption areas. As described in the guidance, Agency-to-Agency communications or Agency-to-partner communications should be classified differently than these agency-to-external communications.",
      "author": "wisecryptic",
      "created_at": "2025-06-06T23:11:38Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AzKyL",
      "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13413515",
      "body": "1. **The “Single Agency Systems” section needs clarification for IaaS-based multi-tenant deployments that are logically isolated but technically reside on shared infrastructure.**\r\n    - Suggested Language: Clarify whether “not offered as a shared service” refers to logical or physical isolation, and whether reuse of templates or architecture invalidates exclusion.\r\n\r\n2. **AI model platforms often allow users to input sensitive data to tune or retrain models.**\r\n    - Suggestion: Add a scenario around MaaS offerings that include persistent storage of model weights updated using federal data.\r\n\r\n3. **The phrase “authoritative repository for federal information” is used across multiple sections.**\r\n    - Suggestion: Include a glossary or consistent definition for “authoritative source” vs. “transient processor” to avoid misinterpretation across agencies.\r\n\r\n4. **Agencies increasingly use external cloud services for inference-only workloads (e.g., ML model execution on Fed data without training).**\r\n    - Request: Add clarification on whether FedRAMP is required when a CSP model runs inference on internal data, even if the model itself isn’t fine-tuned or retained.\r\n\r\n5. **Several observability or scanning tools use installed agents or API tokens to monitor systems.**\r\n    - Recommendation: Clarify that agent-based integrations or privilege elevation would disqualify a tool from being treated as “negligible risk” or ancillary, even if used passively.\r\n\r\n6. **Commercial Info Services – Address Temporarily Stored PII**\r\n    - Clarify whether temporary retention of PII (e.g., email, address, name) by commercial services like ride-share APIs, for billing or fraud prevention, crosses the FedRAMP applicability threshold.\r\n\r\n7. **Add a Flowchart for Determining FedRAMP Applicability**\r\n    - The current “Key Tests” sections are helpful but verbose. A simple decision flowchart or matrix would make it easier for agencies to operationalize this guidance, especially during ATO onboarding or acquisition reviews.\r\n\r\n\r\n\r\n\r\n",
      "author": "austinsonger",
      "created_at": "2025-06-09T20:22:06Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AzQ9n",
      "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13438823",
      "body": "Great Document !! Please expand scope to address below areas as well, if possible for more clarity.\r\n\r\n1. Clarify SaaS vs PaaS vs IaaS Applicability\r\nThe RFC would benefit from explicit guidance distinguishing FedRAMP applicability across SaaS, PaaS, and IaaS service models. In practice, vendors frequently misinterpret whether hosting on a FedRAMP-authorized PaaS or IaaS is sufficient for compliance. Including examples for each model, especially in shared responsibility contexts, would help CSPs and agencies align expectations during procurement and authorization planning.\r\nSuggestion: Expand the guidance with examples of how FedRAMP scope differs for SaaS vs PaaS vs IaaS services. Many vendors struggle to understand when their platform or integration points bring them into scope based on service model responsibilities.\r\n\r\n2. Address Bring Your Own License (BYOL) Use Cases\r\nPlease consider addressing BYOL scenarios, where an agency deploys a COTS product in its own FedRAMP'ed cloud environment, using licenses from a vendor. These cases often create confusion over whether the vendor must pursue a FedRAMP authorization even though the software is not hosted or managed by them. Clear guidance would help vendors respond appropriately to procurement inquiries and prevent misapplication of FedRAMP requirements.\r\nSuggestion: Clarify how FedRAMP applies when agencies procure software through BYOL and deploy it in their own cloud environments. Vendors are often asked to “FedRAMP” these cases even when they don’t host or manage the service.\r\n\r\n3. Add Clarification for Use of Cloud APIs\r\nIt would be helpful to provide guidance on systems that interface with cloud services solely through APIs. If an agency system transmits limited federal data through public APIs—such as for metadata lookups, analytics, or messaging—does that constitute processing that falls under FedRAMP scope? Adding examples and risk-tiered thresholds for API use would clarify applicability.\r\nSuggestion: Address scenarios where an agency system makes API calls to a cloud service that processes limited federal data. Is occasional data transit via public APIs enough to require FedRAMP authorization?\r\n\r\n4. Provide Examples for Temporary or Non-Persistent Use\r\nPlease consider clarifying how FedRAMP applies to short-term or non-persistent uses of cloud services, such as in pilot projects, proof-of-concept deployments, or internal innovation sprints. Agencies and vendors are uncertain whether brief use with limited federal data triggers FedRAMP requirements. Explicit exemptions or scoping guidelines for such ephemeral deployments would be helpful.\r\nSuggestion: Include guidance for services used briefly or in pilot form (e.g., beta testing, Non-Prod environments, mock testing). Agencies and CSPs often debate if temporary usage triggers FedRAMP.\r\n\r\n5. Clarify Responsibilities for Federal Integrators\r\nMore clarity is needed around system integrators who build and manage custom workloads for agencies on top of FedRAMP-authorized infrastructure (e.g., AWS, Azure). What responsibilities fall to the integrator vs. the infrastructure provider regarding FedRAMP scope and controls? This is especially relevant for tailored government solutions that reuse platform services.\r\nSuggestion: System integrators often host agency workloads on FedRAMP-authorized infrastructure but provide custom components. More clarity is needed on how their services are scoped and assessed.\r\n\r\n6. Address Use of AI Assistants Integrated with FedRAMP'ed Tools\r\nAs AI-powered assistants such as MS Copilot, Google Gemini, ChatGPT may become integrated into FedRAMP-authorized tools, it's increasingly important to clarify whether their data access, inferencing, or autonomous actions introduce new scope boundaries. These assistants may handle prompts containing sensitive federal data or act within an application environment, raising concerns aligned with Executive Order 14110 (Safe, Secure, and Trustworthy AI) and OMB M-24-10 (Advancing Governance, Innovation, and Risk Management for Agency Use of AI).\r\nI recommend this guidance explicitly reference above EO and OMB memorandums to ensure that embedding AI assistants in authorized tools does not create inadvertent compliance or data privacy issues. Practical examples involving AI summarization, document processing, or task automation within federal environments would help agencies and vendors apply FedRAMP in line with emerging AI governance frameworks.\r\nAdditionally, alignment between FedRAMP scope definitions and evolving AI use case categorization frameworks (e.g., those from NIST and DHS) could improve consistency in oversight, especially when AI features interact with sensitive data or execute decisions.\r\nSuggestion: As AI assistants such as MS Copilot, Google Gemini, ChatGPT get integrated into FedRAMP-approved productivity suites, guidance should clarify whether their data access or actions change the compliance boundary.",
      "author": "vedigaurav",
      "created_at": "2025-06-11T21:43:32Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AzZpO",
      "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13474382",
      "body": "comments received via email from Microsoft:\r\n\r\n| Current Language/ Section                                                                                                                                                                                                                                                                                                                                    | Proposed Language/Comment                                                                                                                                                                                                                                                                                                                                 |\r\n| ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\r\n| Social media and communications platforms used in accordance with agency social media policies                                                                                                                                                                                                                                                               | We propose including communication policies alongside with social media policies.                                                                                                                                                                                                                                                                         |\r\n| This technical assistance is designed for reasonable people to have reasonable discussions about FedRAMP applicability based on their specific use of a cloud service.                                                                                                                                                                                       | We propose updating this to: The technical assistance provided here cannot address all potential scenarios and represents only a subset of examples to foster meaningful discussion around applicability. It remains the agency responsibility to identify all relevant issues that they must consider in making their decisions regarding applicability. |\r\n| When FedRAMP Doesn’t Apply: The service is not an authoritative repository for federal information, and its unavailability would not result in the loss of federal information.                                                                                                                                                                              | if this statement is also true for data.gov it should be referenced there as well for clarity i.e., data.gov is not the authoritative source of datasets shared; nor would its unavailability result in the loss of federal information. That type of confluence will help readers see the similarities between examples.                                 |\r\n| Out of Scope Detailed Example - AI search chatbot: An agency uses a public AI Chatbot search to troubleshoot technical issues with a video conferencing system. Search queries of public or non-sensitive federal information may be logged by the vendor, but not FOR the agency. Because no internal data is accessed or trained on, FedRAMP doesn’t apply | Agencies will need to ask thoughtful questions here to understand how internal data may (and may not) be used in combination with AI queries. As such, we propose updating this to: In scenarios where no internal agency data is accessed or otherwise utilized by the AI chatbot FedRAMP doesn't apply.                                                 |",
      "author": "pete-gov",
      "created_at": "2025-06-15T13:15:36Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AzZpQ",
      "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13474384",
      "body": "comments received via email from Schellman:\r\n\r\n| Comment # | Section                                                                                                                                                                                                                           | Quote                                                                                                                                                                                                                                                                                                           | Comment                                                                                                                                                                                                                                                                                                                                                           | Recommendation                                                                                                                                                                          |\r\n| --------- | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\r\n| 1         | Search Engines                                                                                                                                                                                                                    | Public web search engines (e.g., Google, Bing, Lycos) using only public or non-sensitive federal information<br><br>Public AI Chatbots (e.g., ChatGPT, Claude, Grok) using only public or non-sensitive federal information                                                                                     | The draft uses the term \"non-sensitive federal information\". It's not clear how this would relate to 800-60 / the security categorization process. In addition, the Minimum Assessment Scope (MAS) just refers to \"federal information\" in the context of OMB Circular A-130 and does not distinguish between \"sensitive\" or \"non-sensitive\".                     | The PMO should clarify what is meant by \"non-sensitive federal information\" when it comes to the applicability of FedRAMP.                                                              |\r\n| 2         | Ancillary services whose compromise would pose a negligible risk to Federal information or information systems, such as systems that make external measurements or only ingest information from other publicly available services | When FedRAMP Doesn’t Apply: The agency determines, through a specific risk analysis, that the compromise or failure of the ancillary service would pose a negligible risk to federal information or information systems based on the agency’s specific use. This determination may vary by agency and use case. | The draft notes that the agency would make this determination through a \"specific risk analysis\". Would this be the sponsoring / partnering agency that would make this determination or would all agencies with a valid ATO on file have input? Agencies have different use cases / risk appetites so this may pose challenges if there is no central oversight. | The PMO should clarify what should be included in a \"specific risk analysis\" and set expectations for CSOs that are being used by multiple agencies / have multiple valid ATOs on file. |",
      "author": "pete-gov",
      "created_at": "2025-06-15T13:16:18Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AzZpV",
      "url": "https://github.com/FedRAMP/community/discussions/7#discussioncomment-13474389",
      "body": "comments received via public comment form:\r\n\r\n| Timestamp          | Agency/Organization | Primary Stakeholder Community | Public Comment                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       | Section Number |\r\n| ------------------ | ------------------- | ----------------------------- | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | -------------- |\r\n| 5/23/2025 13:15:13 | Salesforce          | Cloud Service Provider (CSP)  | Section: Information systems that are only used for a single agency’s operations, hosted on cloud infrastructure or platform, and are not offered as a shared service or do not operate with a shared responsibility mode<br><br>Text: \"The service is exclusively for a single agency's operations and not intended for reuse or reconfiguration by other agencies.\"<br><br>Comment: Does this include SaaS? If so, how can a CSP and agency know ahead of time if a SaaS will forever only be used by a single agency?<br><br>Proposing that we add guidance here that states that, if a platform does intent to become multi-tenant in the future, then it must get FedRAMP Authorized, even if it didn't need to during single use.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |                |\r\n| 5/23/2025 13:15:42 | Salesforce          | Cloud Service Provider (CSP)  | Section: RFC-0010: FedRAMP Scope Interpretation Technical Assistance<br><br>Text: -<br><br>Comment: In general, this technical assistance seems more focused on helping aspring providers figure out if they need to be FedRAMP Authorized or not, rather than helping existing CSPs figure out what is and isn't in scope.<br><br>We would like to see guidance clarifying federal information types and what might impact the CIA of federal information vs. what we have here.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |                |\r\n| 5/25/2025 20:21:56 | Public              | Private Sector - Other        | None.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                | None.          |\r\n| 6/2/2025 7:33:09   | CSP-AB              | Cloud Service Provider (CSP)  | Introduction - \"This technical assistance is designed for reasonable people to have reasonable discussions about FedRAMP applicability based on their specific use of a cloud service. \"<br>Comment: suggest rewording to \" The technical assistance provided here cannot address all potential scenarios and represents only a subset of examples to foster meaningful discussion around applicability. It remains the agency responsibility to identify all relevant issues that they must consider in making their decisions regarding applicability.\"<br><br>Social media and communications platforms used in accordance with agency social media policies.<br>Comment: We propose including communication policies alongside with social media policies.<br><br>Social media and communications platforms used in accordance with agency social media policies - \"When FedRAMP Doesn’t Apply: The service is not an authoritative repository for federal information, and its unavailability would not result in the loss of federal information.\"<br>Comment: If this statement is also true for data.gov it should be referenced there as well for clarity i.e., data.gov is not the authoritative source of datasets shared; nor would its unavailability result in the loss of federal information. That type of confluence will help readers see the similarities between examples.<br><br>Search engines - out of scope detailed example - \"Because no internal data is accessed or trained on, FedRAMP doesn’t apply.\"<br>Comment: Agencies will need to ask smart questions here to understand how internal data may (and may not) be used in combination with AI queries. As such, we propose updating this to: In scenarios where no internal agency data is accessed or otherwise utilized by the AI chatbot FedRAMP doesn't apply. | Included above |\r\n| 6/13/2025 14:26:38 | Cloudflare          | Cloud Service Provider (CSP)  | \\-This is a great technical assistance doc; however, additional scope examples could be useful for more of the grey areas that CSPs often face (especially in hybrid scenarios). Also, the \"When FR doesn't apply\" sections are incredibly helpful in making these determinations and should continue to be used in future technical assistance docs.<br>\\-Define \"negligible risk\" as described as the basis for scope determination for ancillary services<br>\\-AI is mentioned under the search engine example; however, AI is rapidly expanding and growing into something much bigger than a search engine and should be treated as such. FedRAMP is notoriously behind in regulating emerging technologies and this is a great opportunity to expand on examples where AI should be considered in/out of scope.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |                |",
      "author": "pete-gov",
      "created_at": "2025-06-15T13:17:01Z",
      "replies": []
    }
  ]
}