{
  "id": "D_kwDOOxfoic4Af-Mb",
  "url": "https://github.com/FedRAMP/community/discussions/8",
  "title": "FedRAMP RFC-0011:  FedRAMP Pilot Standard for Storing and Sharing Authorization Data",
  "body": "# RFC-0011 FedRAMP Pilot Standard for Storing and Sharing Authorization Data\r\n\r\n> - Status:\r\n> - Created By: FedRAMP PMO\r\n> - Start Date: 2025-05-23\r\n> - Closing Date: 2025-06-22\r\n> - Short Name: rfc–0011-standard-for-storing-and-sharing\r\n\r\n## Where to Comment\r\n\r\n- Discussion Forum: [https://github.com/FedRAMP/rfcs/discussions/33](https://github.com/FedRAMP/rfcs/discussions/33)\r\n- Public Comment Form: [https://forms.gle/sZtXKVYesB7GRpak7](https://forms.gle/sZtXKVYesB7GRpak7)\r\n- Email: pete@fedramp.gov with the subject \"RFC-0011 Feedback\"\r\n\r\n## Summary\r\n\r\nThe FedRAMP Standard for Storing and Sharing Authorization Data outlines requirements for cloud service providers who wish to self-host FedRAMP related authorization data and package materials within their own managed services. Providers who self-host this authorization data, including continuous monitoring materials, would not need to upload materials to the FedRAMP Secure Repository.\r\n\r\nThis standard will be accompanied by an optional pilot phase to allow FedRAMP, cloud service providers, and agencies to learn directly how to best implement this process. Requirements are likely to change based on feedback and learnings during the pilot. More information on the pilot will be provided separately at [fedramp.gov](http://fedramp.gov/). The pilot will be announced during June of 2025.\r\n\r\n## Motivation\r\n\r\nFedRAMP has managed a centralized file repository that hosted most information about cloud service provider’s security plans for low and moderate FedRAMP authorizations in a single place for many years. The risks, complexity, and cost for managing a centralized repository is growing rapidly as FedRAMP scales past 400+ cloud services in the marketplace. This document-based sharing model must change so FedRAMP and cloud services can move increasingly towards relying on machine-readable information developed and shared via apis that facilitates automation.\r\n\r\nCloud service providers often provide trust centers or similar capabilities for commercial customers. These trust centers provide security information to potential and current customers, all controlled by the provider following standard commercial processes and procedures. These existing commercial practices should be reused to the greatest extent possible to ease the burden for both cloud service providers and agency customers.\r\n\r\nThis standard outlines the requirements that will underpin initial pilots for customer managed trust centers that include FedRAMP authorization data.\r\n\r\n## Explanation\r\n\r\nThe full draft standard is approximately 5 pages and is available for review in the following formats:\r\n\r\n- [Basic web formatting on fedramp.gov](https://fedramp.gov/updates/rfcs/0011)\r\n- Basic text markdown on GitHub (below)\r\n- PDF file: [0011-standard-for-storing-and-sharing.pdf](https://github.com/FedRAMP/rfcs/raw/main/rfc/assets/0011-standard-for-storing-and-sharing.pdf)\r\n- Word file: [0011-standard-for-storing-and-sharing.docx](https://github.com/FedRAMP/rfcs/raw/main/rfc/assets/0011-standard-for-storing-and-sharing.docx)\r\n\r\n## Discussion Requested\r\n\r\nThis draft standard is open for any public comment. FedRAMP encourages fast, informal comments from any member of the public. The public may submit multiple comments and may respond to other public comments. All comments from the public sent via email will be made public.\r\n\r\nThe FedRAMP Rev5 working group will continue to host discussions on potential best practices and implementation associated with this standard as well as related pilot activities.\r\n\r\n---\r\n# RFC-0011 FedRAMP Pilot Standard for Storing and Sharing Authorization Data \r\n\r\nFriday, May 23, 2025\r\n\r\n---\r\n\r\n# Background\r\n\r\n[The FedRAMP Authorization Act (44 USC § 3609 (a) (8))](https://www.govinfo.gov/app/details/USCODE-2023-title44/USCODE-2023-title44-chap36-sec3609) directs the Administrator of the General Services Administration to *“provide a secure mechanism for storing and sharing necessary data, including FedRAMP authorization packages, to enable better reuse of such packages across agencies, including making available any information and data necessary for agencies…”* This responsibility is [delegated to the FedRAMP Director](https://www.gsa.gov/directives-library/gsa-delegations-of-authority-fedramp). \r\n\r\nOxford Languages defines a mechanism as *“a natural or established process by which something takes place or is brought about.”*\r\n\r\n[OMB Memorandum M-24-15 on Modernizing FedRAMP](https://www.fedramp.gov/assets/resources/documents/FedRAMP_Policy_Memo.pdf) section 6 states that *“In general, to encourage both security and agility, Federal agencies should use the same infrastructure relied on by the rest of CSPs’ commercial customer base.”*\r\n\r\n# Introduction\r\n\r\nThe FedRAMP Pilot Standard for Storing and Sharing Authorization Data defines requirements for cloud service providers to store and share authorization data with federal agencies using their existing commercial processes and trust centers. This standard provides a secure mechanism to enable better reuse of authorization data across agencies and to make all necessary information and data available to agencies.\r\n\r\nThis standard will initially be implemented as an opt-in pilot open to cloud service providers, allowing FedRAMP, providers, and agencies to learn directly how to best implement and adopt an effective shared responsibility model for storing and sharing authorization data. Providers who establish trust centers that meet these requirements, as verified by FedRAMP, will be exempted from FedRAMP requirements to share materials via the FedRAMP Secure Repository on the USDA Connect Community Portal or existing secure repositories. Please note that explicit requirements during the pilot may vary slightly from the draft standard.\r\n\r\nCloud service providers MAY continue to rely on the FedRAMP secure repository they currently use for sharing information with agencies during the pilot and any following transition period. Providers SHOULD monitor the pilot as the existing FedRAMP Secure Repository and related mechanisms will likely be replaced with this model during FY26 (or earlier).\r\n\r\n# FedRAMP Trust Center Requirements\r\n\r\nCloud service providers SHOULD establish a trust center or similar centralized location to make security information and materials (“authorization data”) available to stakeholders. \r\n\r\n1. The FedRAMP trust center MUST be highly visible on a provider’s core website and MUST clearly state that it includes FedRAMP related materials. The FedRAMP related section SHOULD be available via a direct link that can be included in the FedRAMP marketplace.\r\n\r\n2. The FedRAMP trust center MUST publicly share the following information about the cloud service offering:\r\n\r\n   1. Direct link to the FedRAMP Marketplace for the offering\r\n\r\n   2. Description of the services offered within the FedRAMP authorization scope\r\n\r\n   3. Information for requesting access to non-public FedRAMP materials\r\n\r\n3. The FedRAMP trust center MUST store additional information about the cloud service offering. This information MAY be available to the public based on a risk assessment by the cloud service provider, and MUST be available to federal agencies upon request, including:\r\n\r\n   1. Security Plans and Appendices \r\n\r\n   2. Assessments and Authorizations, including supporting artifacts\r\n\r\n   3. Continuous Monitoring reporting/documentation and supporting artifacts\r\n\r\n   4. Plan Of Action And Milestones (POA\\&M)\r\n\r\n   5. Significant Change Notifications (SCN)\r\n\r\n   6. Incident Reports\r\n\r\n   7. Listing of other FedRAMP authorized services being leveraged\r\n\r\n   8. Any other authorization data required by FedRAMP\r\n\r\n4. The FedRAMP trust center MUST provide a well-documented API or similar machine access to authorization data for federal agencies. \r\n\r\n5. Providers MUST make authorization data available in both human-readable and machine-readable formats.\r\n\r\n6. Providers migrating from the FedRAMP Secure Repository on the USDA Connect Community Portal MUST provide migration information for agencies in their secure folder.\r\n\r\n7. Providers SHOULD follow FedRAMP’s best practices and technical assistance on storing and sharing authorization data where applicable.\r\n\r\n# Provider Access Responsibilities\r\n\r\nCloud service providers are entirely responsible for the intellectual property stored in their FedRAMP trust centers and MUST manage all access to the authorization data stored in their trust centers. \r\n\r\n1. Providers MUST publicly provide plain-language policies and guidance for federal government customers to follow to obtain and manage access to authorization data stored by the cloud service provider.\r\n\r\n2. Providers MUST grant FedRAMP full access to all authorization data. This MUST include reasonable API access and a secure mechanism to routinely manage API credentials.\r\n\r\n3. Providers MUST grant agency authorizing officials (and/or their delegates) full access to all authorization data if they have active customer agreements or indirectly use the service. This MUST include reasonable API access and a secure mechanism to routinely manage API credentials.\r\n\r\n4. Providers SHOULD NOT store federal information that is within the FedRAMP Minimum Assessment Scope within the trust center; providers MUST limit access to such information according to the owner of that federal information. \r\n\r\n5. Providers SHOULD include standard mechanisms that allow customers to manage authorization data access for their users and services directly; these mechanisms SHOULD be the same that customers use to manage access to other aspects of the cloud service offering.\r\n\r\n6. Providers SHOULD grant agency Authorizing Officials and/or their delegates without an active customer agreement temporary full access to all authorization data as appropriate if an agency is directly or indirectly considering use of the system.\r\n\r\n7. Providers SHOULD follow FedRAMP best practices and technical assistance related to storing and sharing authorization data as appropriate.\r\n\r\n# Agency Request Responsibilities\r\n\r\nAgencies SHOULD use native mechanisms provided by cloud service offerings to manage their own user and/or service access to authorization data.\r\n\r\nIf such mechanisms are unavailable, agencies SHOULD follow the request process identified in the FedRAMP Marketplace for a specific cloud service offering to request access to authorization data for review. \r\n\r\nIn all cases:\r\n\r\n1. Agencies MUST limit access of employees and services to non-public authorization data to employees and services with an explicit need for access.\r\n\r\n2. Agencies MUST limit distribution of non-public authorization data to that required for agency operations and delete data after it is no longer needed.\r\n\r\n3. Agencies SHOULD follow FedRAMP best practices and technical assistance related to storing and sharing authorization data as appropriate.",
  "author": "rpalmer-gsa",
  "created_at": "2025-05-23T17:04:22Z",
  "comments": [
    {
      "id": "DC_kwDOOxfoic4Ay0ZO",
      "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13321806",
      "body": "As a security practitioner, I  have never been a fan of airing my laundry publicly.  And as the 20x standard emerges, it has much more sophisticated underlying data that I would not want shared publicly.  Especially those KSIs that will include exceptions and notes.\r\n\r\nExample (not exactly from the KSI obviously)\r\nKSI: MFA Enabled\r\nFinding: Partial\r\nNotes: The following accounts do not have MFA enabled as it would interfere with the service accounts operation: bu_admin, bu_user, sql_user, etc.... These accounts have interactive login disabled as a mitigating control.\r\n\r\nAs a malicious actor, I now know which accounts to target and how to target them.\r\n\r\n\"2. The FedRAMP trust center MUST publicly share the following information about the cloud service offering:\"  Perhaps adding some language to clarify that \"MUST publicly share\" is permissible behind a user registration and approval process.\"  20x does not have the same type of information that an auditor's report has currently. It is more robust with finer grained detail than any audit report today.\r\n\r\nThis would also preclude fourth party vendor from ingesting all that data without permission.  I can see a new market where an information broker gathers up as much \"free\" information from FedRAMP organizations, augments it with risks and other data, and provides a for sale product.  Hmmmm.... maybe I just got my startup idea....  :)",
      "author": "Christcpd",
      "created_at": "2025-05-30T13:49:04Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ay1bB",
          "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13326017",
          "body": "@Christcpd\r\nThanks for raising this important security concern.\r\n\r\nMy reading is that the public requirements under Trust Center bullet 2 appear fairly narrow, covering general information about the service offering and how to request access to more sensitive materials.\r\n\r\nThe detailed technical findings you're concerned about (like specific MFA exceptions and related account details) seem to fall under Trust Center bullet 3, which states this information \"MAY be available to the public based on a risk assessment by the cloud service provider, and MUST be available to federal agencies upon request.\"\r\n\r\nThis suggests cloud providers would make their own risk-based decisions about what potentially sensitive information to make public, if any. I'd imagine sensitive implementation details would typically be kept behind access controls, but I'm curious how others view this balance.",
          "author": "rpalmer-gsa",
          "created_at": "2025-05-30T22:15:57Z"
        },
        {
          "id": "DC_kwDOOxfoic4Ay6JT",
          "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13345363",
          "body": "Ah, I see that logic now.  Thanks for pointing it out.  ",
          "author": "Christcpd",
          "created_at": "2025-06-02T15:37:02Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AzFmE",
      "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13392260",
      "body": "> The FedRAMP trust center MUST store additional information about the cloud service offering. This information MAY be available to the public based on a risk assessment by the cloud service provider, and MUST be available to federal agencies upon request, including:\r\n>    i. Security Plans and Appendices\r\n>    ii. Assessments and Authorizations, including supporting artifacts\r\n>    iii. Continuous Monitoring reporting/documentation and supporting artifacts\r\n>    iv. Plan Of Action And Milestones (POA&M)\r\n>    v. Significant Change Notifications (SCN)\r\n>    vi. Incident Reports\r\n>    vii. Listing of other FedRAMP authorized services being leveraged\r\n>    viii. Any other authorization data required by FedRAMP\r\n\r\nItems like POA&Ms and incident reports contain sensitive vulnerability or operational data and do impact the confidentiality, integrity, or availability of federal systems. In line with minimum assessment scope and standard Boundary Requirements, this data likely should be held to the same security standards as the system itself. Trust centers often do not meet these standards in the case of FedRAMP moderate or High systems. As a CSP, we don't classify our trust centers as being permitted to store this kind of information, let alone actually share such information through it. Recommending this section be revised to:\r\n-Avoid suggesting these may be made public without additional controls\r\n-Require CSPs to indicate how agencies may securely request access\r\n-Clarify storage must be within a system commensurate with the impact level of the authorized service, and within the provider’s minimum FedRAMP assessment scope\r\n\r\n\r\nSuggested rewrite for item 3:\r\n\r\n3. The FedRAMP trust center MUST identify how federal agencies can request access to the following authorization data. This information MUST be stored in an environment commensurate with the impact level of the authorized service, and within the provider’s FedRAMP Minimum Assessment Scope. The provider MAY make select materials public only after performing and documenting a risk assessment that is made available to agency authorizing officials. The following information MUST be made available to federal agencies upon request, including:\r\n  i. Security Plans and Appendices\r\n  ii. Assessments and Authorizations, including supporting artifacts\r\n  iii. Continuous Monitoring reporting/documentation and supporting artifacts\r\n  iv. Plan Of Action And Milestones (POA&M)\r\n  v. Significant Change Notifications (SCN)\r\n  vi. Incident Reports\r\n  vii. Listing of other FedRAMP authorized services being leveraged\r\n  viii. Any other authorization data required by FedRAMP",
      "author": "cb-axon",
      "created_at": "2025-06-06T16:32:51Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AzF4I",
          "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13393416",
          "body": "I believe that the general direction is that authorization data is NOT at the same impact level as Customer data and therefore practices managing access and sharing information with stakeholders are much more important than a full FedRAMP implementation and review of authorization data.\r\n\r\nI am a little hesitant to store POA&M data on trust centers, but these usually store other sensitive material such as pentests and vulnerability reports so I think the gap is smaller than it looks and I think the streamlined approach will be easier to monitor than making a carve-out specifically for that information.",
          "author": "wisecryptic",
          "created_at": "2025-06-06T19:07:04Z"
        },
        {
          "id": "DC_kwDOOxfoic4AzF_3",
          "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13393911",
          "body": "I understand the intent, but authorization documentation frequently includes highly sensitive information—explicitly identifying vulnerabilities, control gaps, or intentionally unimplemented controls—that directly highlights weak areas valuable to an attacker. This is often at the specific request of agency customers. Given this, such data should clearly be treated with protections equal to customer data, in our opinion.\r\n\r\nIn practice, trust centers typically host summaries or public-facing materials, not detailed or actionable vulnerability data. Storing sensitive, explicit vulnerability details in a lower-security trust center isn't consistent with secure practice. Protecting this data must prioritize security over convenience.\r\n",
          "author": "cb-axon",
          "created_at": "2025-06-06T20:28:50Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AzFmr",
      "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13392299",
      "body": "> 5. Providers MUST make authorization data available in both human-readable and machine-readable formats.\r\n\r\nThe definition of “machine-readable” is increasingly subjective—modern tools can easily parse human-readable formats like Word and Excel. Recommend clarifying what’s expected (e.g., structured formats like JSON, XML, etc.) and adjusting this to a SHOULD, with a MUST only if an agency AO requires it.\r\n\r\nSuggested rewrite for item 5:\r\n\r\n5. Providers SHOULD make authorization data available in both human-readable and structured machine-readable formats (e.g., JSON, XML), where appropriate. Providers MUST do so if agency Authorizing Officials request machine-readable access for integration into their internal systems.",
      "author": "cb-axon",
      "created_at": "2025-06-06T16:34:33Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AzF4c",
          "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13393436",
          "body": "I believe we haven't reached consolidation on machine readability at this time. Thus, subjective, ambiguous language in machine readability is a feature, not a bug. From my perspective, this allows early adopters much greater flexibility, while also allowing FedRAMP to promote machine readability on a faster timetable. \r\n\r\nThe two lesser options are either arbitrarily define machine readability which I think will cause a lot of whiplash throughout the ecosystem at this point and likely consolidate on a format that is not yet ideal, which will cause further second order effects of sloppy overpriced implementations, \r\nOR\r\nhold off on machine readable-type language for another 6-18 months. This does not seem to be the preference of FedRAMP.\r\n\r\nI'm more concerned about API references as far as complexity and consolidation goes.",
          "author": "wisecryptic",
          "created_at": "2025-06-06T19:11:50Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4AzFnn",
      "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13392359",
      "body": "> 2. Providers MUST grant FedRAMP **_full access_** to all authorization data. This MUST include reasonable API access and a secure mechanism to routinely manage API credentials.\r\n\r\n> 3. Providers MUST grant agency authorizing officials (and/or their delegates) **_full access_** to all authorization data if they have active customer agreements or indirectly use the service. This MUST include reasonable API access and a secure mechanism to routinely manage API credentials.\r\n\r\n> 6. Providers SHOULD grant agency Authorizing Officials and/or their delegates without an active customer agreement temporary **_full access_** to all authorization data as appropriate if an agency is directly or indirectly considering use of the system.\r\n\r\nThis is just a minor wording comment - here \"Full access\" should be changed to \"at least read access\" - Full access allows users with such permissions to overwrite documents such as SSPs and such, which can (and has) happened erroneously, and causes confusion. Suggest requiring read access at minimum with this, so that agencies can access the data necessary, but not overwrite it.\r\n",
      "author": "cb-axon",
      "created_at": "2025-06-06T16:40:47Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AzF6c",
      "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13393564",
      "body": "Thank you for putting this together. I’m sure the community is excited to see where this goes\r\n\r\n> The risks, complexity, and cost for managing a centralized repository is growing rapidly as FedRAMP scales past 400+ cloud services in the marketplace.\r\n\r\nHaving a responsibilities to both companies and customers to safeguard information, this has been a growing concern for me as well. By distributing information, the cost vs reward of large scale compromise should shift significantly against the favor of malicious actors.\r\n\r\n> The FedRAMP trust center MUST be highly visible on a provider’s core website and MUST clearly state that it includes FedRAMP related materials.\r\n\r\nSoft question on the intended outcome of making the FedRAMP trust center ‘highly visible? Normally a core website is primarily managed by marketing with perhaps a link to a trust subdomain which leads to a providers portal. This portal is primarily accessed by current and investigating customers, whereas the marketing site will be aimed at a much wider audience. I can foresee potential conflicts of vision in implementation of this.\r\n\r\n> Providers SHOULD include standard mechanisms that allow customers to manage authorization data access for their users and services directly; these mechanisms SHOULD be the same that customers use to manage access to other aspects of the cloud service offering.\r\n\r\nI'd like to understand the intent of this better. Generally a cloud service offering authorization and access mechanisms will and should be separate from a Trust center. I am not aware of Trust centers being implemented with full idp integrations per customer, and the overhead on that would be substantial.\r\nMy recommendation is to strike 5.\r\n\r\n",
      "author": "wisecryptic",
      "created_at": "2025-06-06T19:31:26Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AzKzm",
      "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13413606",
      "body": "1. **The draft implies a likely phaseout of the FedRAMP Secure Repository in FY26 but doesn’t define whether this pilot is a precursor to a mandatory shift.**\r\n    - Ask: Will this model become mandatory for Moderate/High systems? If so, when and what migration requirements will be imposed?\r\n    - **Recommendation:** Add a timeline roadmap or migration decision triggers to help CSPs prepare.\r\n\r\n2.  **Define Minimum API Functionality** - The requirement for a “well-documented API or similar machine access” is vague.\r\n    - Suggestion: Specify minimum API capabilities:\r\n      - Metadata query and filtering\r\n      - Document format/version retrieval\r\n      - Authentication/authorization token model (e.g., OAuth2 or SAML)\r\n      - Audit logging for access\r\n\r\n3. **Mandate Metadata for Machine-Readable Docs - Machine-readable formats without consistent metadata won’t scale for automated monitoring tools.**\r\n    - Recommendation: Require structured metadata (e.g., JSON or XML manifest) with:\r\n      - Authorization status and impact level\r\n      - Document version/date\r\n      - Point of contact\r\n      - Assessment type (Initial, Reauthorization, Annual)\r\n\r\n4. **Clarify Rules Around Temporarily Public Access (Pre-Acquisition Phase)**\r\n    - Ask: Should this be based on pre-decisional NDAs or some FedRAMP-defined intake process?\r\n    - Suggestion: Provide criteria or minimum safeguards for granting this level of access (e.g., signed statement of intent, verified agency domain).\r\n\r\n5. **Require Alignment With OSCAL**\r\n    - For machine-readability and interoperability, OSCAL-based documents should be encouraged (or required) wherever possible.\r\n    - Suggestion: Add language like: “Where possible, authorization data SHOULD be made available in OSCAL or other NIST-aligned formats.”\r\n\r\n\r\n\r\n",
      "author": "austinsonger",
      "created_at": "2025-06-09T20:35:59Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Azals",
      "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13478252",
      "body": "Thank you for drafting this document.\r\n\r\nBelow are few suggestions that, if incorporated into this RFC, could enhance clarity and reduce ambiguity.\r\n\r\n1. Lifecycle Management of Authorization Data\r\nGap Identified: RFC-0011 does not specify how long data should be retained or when it should be archived or deleted.\r\nRecommendation:\r\nAdd a section defining minimum retention periods for authorization data (e.g., 3 years post-authorization), criteria for data archiving, and mandatory deletion or sanitization processes once data is obsolete or the service is decommissioned. You can also introduce explicit lifecycle requirements for authorization data stored in FedRAMP trust centers. For example, data should be retained in a readily accessible (“hot”) state for a minimum of 12 months after generation or last use, followed by archival (“cold”) storage for an additional period (e.g., up to 3 years), after which deletion may be permitted unless otherwise required by law or agency agreements.\r\nThis mirrors the hot/cold data retention approach in OMB Memorandum M-21-31, which mandates availability of key cybersecurity-related data (e.g., logs) in a hot state for 12 months and retention for 18 months. A similar model for FedRAMP Trust Centers could be adopted that would support incident response, authorization reviews, and audits, while allowing for cost-effective long-term storage.  \r\n\r\n\r\n2. Version Control and Change Tracking\r\nGap Identified: The RFC lacks requirements around version tracking for documents like SSPs, POA&Ms, or Incident Reports.\r\nRecommendation: Require trust centers to maintain and expose document version history, with metadata including publication date, version number, and change description. This could be via metadata or changelogs accessible through the API.\r\n\r\n3. Trust Center Availability and Reliability\r\nGap Identified: The RFC does not define expected uptime, service reliability, or incident handling for trust centers.\r\nRecommendation: Add requirements or expectations for availability (e.g., 99.9% uptime), response time for access issues, and procedures for notifying agencies when the trust center is down or compromised.\r\n\r\n4. Auditability and Access Logs\r\nGap Identified: The RFC references API access but does not mention access audit logging, which is critical for monitoring and incident response.\r\nRecommendation: Require that trust centers log all access to sensitive authorization data (including API access), and that these logs be retained and made available to FedRAMP and agencies upon request.\r\n\r\n5. User Experience and Accessibility\r\nGap Identified: No guidance is provided on ensuring the trust center is usable, navigable, or accessible for individuals with disabilities.\r\nRecommendation: Recommend that trust centers follow Section 508 compliance for accessibility, and offer a standardized navigation model or UI pattern (e.g., search, filter by document type/status/date) to reduce confusion and improve agency use.\r\n\r\n6. Data Classification & Labeling\r\nGap Identified: There's no requirement to clearly label the sensitivity or classification of documents shared via the trust center.\r\nRecommendation: Require all uploaded documents to include clear classification labels (e.g., Public, For Official Use Only, Controlled Unclassified Information) and associate them with metadata for automated handling and access control.\r\n",
      "author": "vedigaurav",
      "created_at": "2025-06-16T03:14:34Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AzgOH",
      "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13501319",
      "body": "A few comments and a recommended addition...\r\n\r\nOne thing that the FedRAMP marketplace and authorization process has excelled at is clear separation of responsibilities. For example, every agency knows that every cloud service provider (CSP) that offers a product listed on the marketplace underwent a FedRAMP Audit that was performed by an authorized \"Assessor\" with a listing on marketplace.fedramp.gov/assessors. I would like to see this pattern maintained with trust center providers (TSPs). Given the industry move toward automated data collection, status updates could change on a daily basis and an assessor has no way to constantly ensure updates are reflected on the Trust Center. With the current requirements there is no difference between an actual \"Trust Center\" and a marketing page created by the CSP for their product.\r\n\r\nRecommended Addition: \r\n\r\n1. List Trust Center Providers on their own separate tab from Product, Agencies and Assessors on the Fedramp Marketplace \r\n![image (6)](https://github.com/user-attachments/assets/1d0c226a-379b-4375-9ad9-ac6dc8cbbda7)\r\n\r\n2. Add specific wording that requires each Product on the FedRAMP marketplace use a 3rd party (20X or similarly authorized) trust center provider (TSP) to continuously update their Trust Center and that the trust center MUST not be maintained solely by the CSP themselves. \r\n\r\n>  8. Cloud Service Providers MUST commission a FedRAMP authorized Trust Center Provider to maintain and update their FedRAMP Trust Center. \r\n\r\n\r\n> # FedRAMP Trust Center Requirements\r\n> Cloud service providers SHOULD establish a trust center or similar centralized location to make security information and materials (“authorization data”) available to stakeholders.\r\n> \r\n> 1. The FedRAMP trust center MUST be highly visible on a provider’s core website and MUST clearly state that it includes FedRAMP related materials. The FedRAMP related section SHOULD be available via a direct link that can be included in the FedRAMP marketplace.\r\n> 2. The FedRAMP trust center MUST publicly share the following information about the cloud service offering:\r\n>    \r\n>    1. Direct link to the FedRAMP Marketplace for the offering\r\n>    2. Description of the services offered within the FedRAMP authorization scope\r\n>    3. Information for requesting access to non-public FedRAMP materials\r\n> 3. The FedRAMP trust center MUST store additional information about the cloud service offering. This information MAY be available to the public based on a risk assessment by the cloud service provider, and MUST be available to federal agencies upon request, including:\r\n>    \r\n>    1. Security Plans and Appendices\r\n>    2. Assessments and Authorizations, including supporting artifacts\r\n>    3. Continuous Monitoring reporting/documentation and supporting artifacts\r\n>    4. Plan Of Action And Milestones (POA&M)\r\n>    5. Significant Change Notifications (SCN)\r\n>    6. Incident Reports\r\n>    7. Listing of other FedRAMP authorized services being leveraged\r\n>    8. Any other authorization data required by FedRAMP\r\n> 4. The FedRAMP trust center MUST provide a well-documented API or similar machine access to authorization data for federal agencies.\r\n> 5. Providers MUST make authorization data available in both human-readable and machine-readable formats.\r\n> 6. Providers migrating from the FedRAMP Secure Repository on the USDA Connect Community Portal MUST provide migration information for agencies in their secure folder.\r\n> 7. Providers SHOULD follow FedRAMP’s best practices and technical assistance on storing and sharing authorization data where applicable.\r\n",
      "author": "jspenc72",
      "created_at": "2025-06-17T20:45:47Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AzgSy",
          "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13501618",
          "body": "> 8. Cloud Service Providers MUST commission a FedRAMP authorized Trust Center Provider to maintain and update their FedRAMP Trust Center.\r\n\r\nThis isn't something that should be REQUIRED. If anything, it should identify that if the trust center hosts all KSIs and information that it must meet be approved at the appropriate FedRAMP level, but if a CSP whose business is not specifically to host a \"trust center\" wants to create one themselves, they should 100% be allowed to do that. This also boxes out other \"on-prem\" trust center providers that CSPs may want to utilize to ensure the data stays within their boundary, but is still available for Agency's to access.",
          "author": "cb-axon",
          "created_at": "2025-06-17T21:32:10Z"
        },
        {
          "id": "DC_kwDOOxfoic4AzioV",
          "url": "https://github.com/FedRAMP/community/discussions/8#discussioncomment-13511189",
          "body": "Thanks for sharing your comments @cb-axon I appreciate the points you made and hearing the other side of this discussion.\r\n\r\nJust a few thoughts to reiterate and reinforce my position. Having been involved in multiple FedRAMP ATOs I can say in my humble opinion, CSPs self maintaining and reporting their own FedRAMP compliant \"trust center\", is a VERY bad idea. Should FedRAMP also allow CSPs to become the assessors for their own products? (absolutely not) Should the employee who does the accounting for a CSP also do their irs audit? (absolutely not) Separation of responsibilities is a MUST in this world...\r\n\r\nA Trust Center Provider (TCP) has two responsibilites:\r\n\r\n1. Continuously Audit: Through integration with the CSP offering via automation, software agent, manual review, etc and **continuously** check the status of all controls within the FedRAMP framework and record any findings or changes.\r\n2. Continuously Report: these findings internally to the CSP for remediation, to the FedRAMP Assessor for review/assessment and externally on the Trust Center website in a way that both informs the Agencies of control deficiencies via POAM while avoiding disclosure that could be used by a bad actor.\r\n\r\nA Trust Center will be linked to the Product listing on the FedRAMP marketplace, so it becomes the canonical source of information related to their FedRAMP offering for Agencies who are evaluating the security of their Product(s). Given the move to continuous monitoring and compliance reporting of control status checks, POAM, etc it is of paramount importance that Agencies who are evaluating a Product be able to rely on trust center information to make their decisions. \r\n\r\n> This isn't something that should be REQUIRED. If anything, it should identify that if the trust center hosts all KSIs and information that it must meet be approved at the appropriate FedRAMP level, but if a CSP whose business is not specifically to host a \"trust center\" wants to create one themselves, they should 100% be allowed to do that. This also boxes out other \"on-prem\" trust center providers that CSPs may want to utilize to ensure the data stays within their boundary, but is still available for Agency's to access.\r\n\r\nI have nothing against a CSP also becoming a Trust Center Provider for other products just don't tell them they can do it solely on their own, for their own products. \r\nAlso, \"on-prem\" trust centers and keeping information in the boundary is a non issue given requirement number 1, that the trust center itself must be \"publicly accessible on the CSP website\".\r\n\r\n> 1. The FedRAMP trust center MUST be highly visible on a provider’s core website and MUST clearly state that it includes FedRAMP related materials. The FedRAMP related section SHOULD be available via a direct link that can be included in the FedRAMP marketplace.\r\n\r\nIf we are to differentiate a trust center from just another product promo piece or blog article about how good a CSPs product is... we need a separation of responsibility.",
          "author": "jspenc72",
          "created_at": "2025-06-18T16:04:06Z"
        }
      ]
    }
  ]
}