{
  "id": "D_kwDOOxfoic4AgAHz",
  "url": "https://github.com/FedRAMP/community/discussions/9",
  "title": "Upcoming changes to KSIs in release materials",
  "body": "I wanted to share an update in advance as we approach the closing of the [public comment period on RFC-0006](https://www.fedramp.gov/rfcs/0006/) this weekend. It's important to note that rules around public comment restrict much of our ability to dynamically and publicly make changes during this process as this impedes the \"fair\" opportunity to everyone to provide comments on the same materials.\r\n\r\nHowever, given the nature of our pilot and the amount of work industry is doing to address draft KSIs, I feel that transparency here is in the interest of pilot participants.\r\n\r\n**None of the changes mentioned below are final.** We will continue to integrate and iterate based on comments received through the end of the public comment period.\r\n\r\n\\- Pete // FedRAMP Director\r\n\r\n---\r\nFor pilot participant awareness - _please take no action yet based on these, just be aware_:\r\n\r\n**There will be material changes to a number of the key security indicators and their validations.**\r\n\r\nLikely changes based on public comment to date include the following high level changes:\r\n\r\n1. The mappings to related NIST SP 800-53 Controls have been removed from the KSI standard. These will be provided and maintained separately in a related template, technical assistance, or best practice materials. \r\n\r\n2. Incident Response (KSI-IR) has been split into two separate KSIs - Recovery Planning (KSI-RP) and Incident Reporting (KSI-IR). \r\n  - The existing validations were split between these KSIs, reordered, and reworded for clarity in some instances\r\n  - Draft KSI-IR-6 has been removed\r\n  - A new validation to \"develop and maintain a recovery plan\" has been added\r\n\r\n3. Cloud Native Architecture (KSI-CNA) validations have been reordered and reworded for clarity and adjusted.\r\n  - In general these validations no longer direct use of specific technologies that may change (e.g. \"immutable containers\" -> \"immutable infrastructure\", \"firewalls/proxy servers\" -> \"edge systems\", \"logically segmented micro-services\" removed, etc.)\r\n  - The validation to execute continuous scanning of cloud native system components has been removed as redundant (see changes to KLI-MLA (4) below)\r\n\r\n4. Service Configuration (KSI-SC) validation 2 has been reworded for clarity.\r\n  - Instead of \"encrypt all network traffic\" it now reads \"encrypt _or otherwise secure_ network traffic _from unauthorized access_\"\r\n\r\n5. Identity and Access Management (KSI-IAM) validations have been reworded for clarity.\r\n  - We're actively tuning all of these to ensure they align with modern security best practices based on excellent feedback\r\n  - Zero Trust has been moved into IAM to ensure it applies across the entire infrastructure\r\n\r\n6. Monitoring, Logging, and Auditing (KSI-MLA) validations 1, 4, and 6 have been reworded for clarity.\r\n  - 1 adds \"Operate a SIEM _or similar system(s)_\" to clarify use of disparate components/services that provide SIEM capabilities in total are perfectly adequate even if it is not a marketed SIEM system\r\n  - 4 removed \"on publicly accessible\" clarifying that all components should be scanned. (see changes to CNA validation above)\r\n  - 6 clarifies that tracking and prioritization should be \"mitigation and/or remediation\" instead of just remediation\r\n\r\n7. Policy and Inventory (KSP-PI) validation 6 adds that security programs should have \"executive support\"\r\n\r\n8. Third Party Information Resources (KSI-3IR) has been re-acronymed as KSI-TP and validations have been reworded, reordered, and in some cases removed.\r\n  - Implement zero trust design principles has been moved to KSI-IAM\r\n  - The requirement to confirm third party resources have a Secure Software Development Attestation with CISA has been removed. This will be addressed differently in the future.\r\n  - The requirement for SBOMs has been removed. This will be addressed differently in the future.\r\n  - A requirement to \"identify all third party information resources\" has been added\r\n  - The requirement to confirm services storing federal information are FedRAMP authorized and configured securely has been updated to clarify it should address anything within the FedRAMP assessment scope (e.g. handles or likely to impact CIA of federal info)\r\n\r\n---\r\n\r\nPlease note, while we are happy to engage in Q&A on these changes here, if anything about these changes inspires a desire to add comments or opinions in general for us to formally consider on the record related to the _KSIs in the RFC_ then please post public comment on that (e.g. \"I really hope you keep X the same as in this RFC because A/B/C\" or whatever). Again, I realize this is weird, but we are required to consider public comment in a way that we aren't required to consider feedback in random Q&A and it is in the public's interest to leverage public comment.\r\n",
  "author": "pete-gov",
  "created_at": "2025-05-23T12:06:16Z",
  "comments": [
    {
      "id": "DC_kwDOOxfoic4Ayh8R",
      "url": "https://github.com/FedRAMP/community/discussions/9#discussioncomment-13246225",
      "body": "A separate point to add because it comes up frequently: These may continue to change between the pilot and any final formalization of the authorization path, and the pilot will continue to be a bit fuzzy about how these capabilities should be implemented and assessed because the intent of the pilot is to understand innovative ways to do that. \r\n\r\n**FedRAMP will eventually be a bit more consistently prescriptive with this process before formalizing it** while still encouraging innovation, however that prescription will be based on real world learning during the pilot and still be limited in alignment with the [Executive Order on Unleashing Prosperity Through Deregulation](https://www.federalregister.gov/documents/2025/02/06/2025-02345/unleashing-prosperity-through-deregulation) and related priorities for us.\r\n\r\nProviders who receive authorization as part of the Phase One pilot will be given reasonable advance warning of any pending changes that will require them to adjust KSIs, validations, evidence, approaches, etc. after authorization. \r\n\r\n",
      "author": "pete-gov",
      "created_at": "2025-05-23T12:11:34Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4AyiqX",
      "url": "https://github.com/FedRAMP/community/discussions/9#discussioncomment-13249175",
      "body": "Thank you for providing this update! It's helpful to have the heads up and quick turn around on KSIs. We are especially grateful for the rename of 3IR since it made some of our internal sorting go crazy with a number in the acronym instead of just letters. Passing on the thanks from one of our happy devs :) \r\n> 8\\. Third Party Information Resources (KSI-3IR) has been re-acronymed as KSI-TP\r\n\r\n-- Isaac Teuscher (Paramify)",
      "author": "iteuscher",
      "created_at": "2025-05-23T17:09:04Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4AyivJ",
          "url": "https://github.com/FedRAMP/community/discussions/9#discussioncomment-13249481",
          "body": "> We are especially grateful for the rename of 3IR since it made some of our internal sorting go crazy with a number in the acronym instead of just letters. \r\n\r\nDirect, simple, engineering-based, low risk, and easily actionable feedback is the best! ;)\r\n",
          "author": "pete-gov",
          "created_at": "2025-05-23T17:32:13Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ayvre",
      "url": "https://github.com/FedRAMP/community/discussions/9#discussioncomment-13302494",
      "body": "Hi all, a quick note:\r\n\r\nThere have been further changes in this vein through the close of public comment, so not all of these are final or accurate (as previously indicated). But it's a lot closer. Stay tuned tomorrow.",
      "author": "pete-gov",
      "created_at": "2025-05-28T21:35:36Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOxfoic4Ayv-a",
      "url": "https://github.com/FedRAMP/community/discussions/9#discussioncomment-13303706",
      "body": "Update - I haven't gone through line by line to double check and validate this output against the source materials but my friend Gemini popped this out. Still subject to minor fluctuation, not formal yet.\r\n\r\n```\r\n{\r\n    \"KSI-CNA\": {\r\n        \"long_name\": \"Cloud Native Architecture\",\r\n        \"requirement\": \"A secure cloud service offering will use cloud native architecture and design principles to enforce and enhance the Confidentiality, Integrity and Availability of the system.\",\r\n        \"validation\": {\r\n            \"KSI-CNA-01\": \"Configure ALL information resources to limit inbound and outbound traffic\",\r\n            \"KSI-CNA-02\": \"Design systems to minimize the attack surface and minimize lateral movement if compromised\",\r\n            \"KSI-CNA-03\": \"Use logical networking and related capabilities to enforce traffic flow controls\",\r\n            \"KSI-CNA-04\": \"Use immutable infrastructure with strictly defined functionality and privileges by default\",\r\n            \"KSI-CNA-05\": \"Have denial of service protection\",\r\n            \"KSI-CNA-06\": \"Design systems for high availability and rapid recovery\",\r\n            \"KSI-CNA-07\": \"Ensure cloud-native information resources are implemented based on host provider’s best practices and documented guidance\"\r\n        }\r\n    },\r\n    \"KSI-SVC\": {\r\n        \"long_name\": \"Service Configuration\",\r\n        \"requirement\": \"A secure cloud service offering will follow FedRAMP encryption policies, continuously verify information resource integrity, and restrict access to third-party information resources.\",\r\n        \"validation\": {\r\n            \"KSI-SVC-01\": \"Harden and review network and system configurations\",\r\n            \"KSI-SVC-02\": \"Encrypt or otherwise secure network traffic\",\r\n            \"KSI-SVC-03\": \"Encrypt all federal and sensitive information at rest\",\r\n            \"KSI-SVC-04\": \"Manage configuration centrally\",\r\n            \"KSI-SVC-05\": \"Enforce system and information resource integrity through cryptographic means\",\r\n            \"KSI-SVC-06\": \"Use automated key management systems to manage, protect, and regularly rotate digital keys and certificates\",\r\n            \"KSI-SVC-07\": \"Use a consistent, risk-informed approach for applying security patches\"\r\n        }\r\n    },\r\n    \"KSI-IAM\": {\r\n        \"long_name\": \"Identity and Access Management\",\r\n        \"requirement\": \"A secure cloud service offering will protect user data, control access, and apply zero trust principles.\",\r\n        \"validation\": {\r\n            \"KSI-IAM-01\": \"Enforce multi-factor authentication (MFA) using methods that are difficult to intercept or impersonate (phishing-resistant MFA) for all user authentication\",\r\n            \"KSI-IAM-02\": \"Use secure passwordless methods for user authentication and authorization when feasible, otherwise enforce strong passwords with MFA\",\r\n            \"KSI-IAM-03\": \"Enforce appropriately secure authentication methods for non-user accounts and services\",\r\n            \"KSI-IAM-04\": \"Use a least-privileged, role and attribute-based, and just-in-time security authorization model for all user and non-user accounts and services\",\r\n            \"KSI-IAM-05\": \"Apply zero trust design principles\",\r\n            \"KSI-IAM-06\": \"Automatically disable or otherwise secure accounts with privileged access in response to suspicious activity\"\r\n        }\r\n    },\r\n    \"KSI-MLA\": {\r\n        \"long_name\": \"Monitoring, Logging, and Auditing\",\r\n        \"requirement\": \"A secure cloud service offering will monitor, log, and audit all important events, activity, and changes.\",\r\n        \"validation\": {\r\n            \"KSI-MLA-01\": \"Operate a Security Information and Event Management (SIEM) or similar system(s) for centralized, tamper-resistent logging of events, activities, and changes\",\r\n            \"KSI-MLA-02\": \"Regularly review and audit logs\",\r\n            \"KSI-MLA-03\": \"Rapidly detect and remediate or mitigate vulnerabilities\",\r\n            \"KSI-MLA-04\": \"Perform authenticated vulnerability scanning on information resources\",\r\n            \"KSI-MLA-05\": \"Perform Infrastructure as Code and configuration evaluation and testing\",\r\n            \"KSI-MLA-06\": \"Centrally track and prioritize the mitigation and/or remediation of identified vulnerabilities\"\r\n        }\r\n    },\r\n    \"KSI-CMT\": {\r\n        \"long_name\": \"Change Management\",\r\n        \"requirement\": \"A secure cloud service provider will ensure that all system changes are properly documented and configuration baselines are updated accordingly.\",\r\n        \"validation\": {\r\n            \"KSI-CMT-01\": \"Log and monitor system modifications\",\r\n            \"KSI-CMT-02\": \"Execute changes though redeployment of version controlled immutable resources rather than direct modification wherever possible\",\r\n            \"KSI-CMT-03\": \"Implement automated testing and validation of changes prior to deployment\",\r\n            \"KSI-CMT-04\": \"Have a documented change management procedure\",\r\n            \"KSI-CMT-05\": \"Evaluate the risk and potential impact of any change\"\r\n        }\r\n    },\r\n    \"KSI-PIY\": {\r\n        \"long_name\": \"Policy and Inventory\",\r\n        \"requirement\": \"A secure cloud service offering will have intentional, organized, universal guidance for how every information resource, including personnel, is secured.\",\r\n        \"validation\": {\r\n            \"KSI-PIY-01\": \"Have an up-to-date information resource inventory or code defining all deployed assets, software, and services\",\r\n            \"KSI-PIY-02\": \"Have policies outlining the security objectives of all information resources\",\r\n            \"KSI-PIY-03\": \"Maintain a vulnerability disclosure program\",\r\n            \"KSI-PIY-04\": \"Build security considerations into the Software Development Lifecycle and align with CISA Secure By Design principles\",\r\n            \"KSI-PIY-05\": \"Document methods used to evaluate information resource implementations\",\r\n            \"KSI-PIY-06\": \"Have a dedicated staff and budget for security with executive support, commensurate with the size, complexity, scope, and risk of the service offering\",\r\n            \"KSI-PIY-07\": \"Document risk management decisions for software supply chain security\"\r\n        }\r\n    },\r\n    \"KSI-TPR\": {\r\n        \"long_name\": \"Third-Party Information Resources\",\r\n        \"requirement\": \"A secure cloud service offering will understand, monitor, and manage supply chain risks from third-party information resources.\",\r\n        \"validation\": {\r\n            \"KSI-TPR-01\": \"Identify all third-party information resources\",\r\n            \"KSI-TPR-02\": \"Regularly confirm that services handling federal information **or** are likely to impact the confidentiality, integrity, or availability of federal information are FedRAMP authorized and securely configured\",\r\n            \"KSI-TPR-03\": \"Identify and prioritize mitigation of potential supply chain risks\",\r\n            \"KSI-TPR-04\": \"Monitor third party software information resources for upstream vulnerabilities, with contractual notification requirements or active monitoring services\"\r\n        }\r\n    },\r\n    \"KSI-CED\": {\r\n        \"long_name\": \"Cybersecurity Education\",\r\n        \"requirement\": \"A secure cloud service provider will continuously educate their employees on cybersecurity measures, testing them regularly to ensure their knowledge is satisfactory.\",\r\n        \"validation\": {\r\n            \"KSI-CED-01\": \"Ensure all employees receive security awareness training\",\r\n            \"KSI-CED-02\": \"Require role-specific training for high risk roles, including at least roles with privileged access\"\r\n        }\r\n    },\r\n    \"KSI-RPL\": {\r\n        \"long_name\": \"Recovery Planning\",\r\n        \"requirement\": \"A secure cloud service offering will define, maintain, and test incident response plan(s) and recovery capabilities to ensure minimal service disruption and data loss during incidents and contingencies.\",\r\n        \"validation\": {\r\n            \"KSI-RPL-01\": \"Define Recovery Time Objectives (RTO) and Recovery Point Objectives (RPO)\",\r\n            \"KSI-RPL-02\": \"Develop and maintain a recovery plan that aligns with the defined recovery objectives\",\r\n            \"KSI-RPL-03\": \"Perform system backups aligned with recovery objectives\",\r\n            \"KSI-RPL-04\": \"Regularly test the capability to recover from incidents and contingencies\"\r\n        }\r\n    },\r\n    \"KSI-INR\": {\r\n        \"long_name\": \"Incident Reporting\",\r\n        \"requirement\": \"A secure cloud service offering will document, report, and analyze security incidents to ensure regulatory compliance and continuous security improvement.\",\r\n        \"validation\": {\r\n            \"KSI-INR-01\": \"Report incidents according to FedRAMP requirements and cloud service provider policies\",\r\n            \"KSI-INR-02\": \"Maintain a log of incidents and periodically review past incidents for patterns or vulnerabilities\",\r\n            \"KSI-INR-03\": \"Generate after action reports and regularly incorporate lessons learned into operations\"\r\n        }\r\n    }\r\n}\r\n\r\n```",
      "author": "pete-gov",
      "created_at": "2025-05-28T23:59:55Z",
      "replies": [
        {
          "id": "DC_kwDOOxfoic4Ayxgt",
          "url": "https://github.com/FedRAMP/community/discussions/9#discussioncomment-13309997",
          "body": "In addition to removing the Arabic numeral for consistent sorting, I love that each \"family\" now has a (consistently long) three letter acronym!",
          "author": "tnnrjmsn-eit",
          "created_at": "2025-05-29T13:38:46Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOxfoic4Ayx_Q",
      "url": "https://github.com/FedRAMP/community/discussions/9#discussioncomment-13311952",
      "body": "I'm going to close this discussion as we prep to formally release the KSI's on our website (to avoid any potential confusion).",
      "author": "pete-gov",
      "created_at": "2025-05-29T16:39:29Z",
      "replies": []
    }
  ]
}