{
  "id": "D_kwDOOK0ax84AfILE",
  "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/19",
  "title": "Risk-based Vulnerability Management--thoughts?",
  "body": "The biggest timesink that we have as a CSP in our continuous monitoring process is vulnerability management. \r\n\r\nThe current approach of \"patch everything\" is becoming untenable and I don't think we're the only ones impacted by this burden. Given that the intent of this working group is to \"Identify and Share Best Practices in Continuous Monitoring\" I figured I'd bring it up here, particularly as this relates to everyone's favorite monitoring artifact--the POAM. \r\n\r\nFurthermore, I believe that this topic is both in-scope of and actionable by the CWG based on the [FedRAMP 20-X FAQ](https://www.fedramp.gov/20x/faqs/), specifically:\r\n>Technical assistance and guidance for FedRAMP 20x will be formalized on a rolling basis as the pilot is validated by the Community Working Groups. Each piece of guidance will go through formal public comment before it is made official and open to use by industry and other agencies.\r\n\r\nFirst, for those unaware, [Risk-based Vulnerability Management](https://www.techtarget.com/searchsecurity/definition/risk-based-patch-management-RBPM) (RBVM) is maximizing your resources to maximize security. Instead of blindly focusing on patching everything that hits the vuln report, it focuses on patching known exploited vulnerabilities (KEV) first, then high/moderate/low as resourcing allows. This can also lead to [\"clearer security metrics\" ](https://www.sentinelone.com/cybersecurity-101/cybersecurity/what-is-risk-based-vulnerability-management-rbvm/) which supports a number of the FedRAMP 20-X initiatives. \r\n\r\nSecond, [CISA already agrees with this approach](https://www.cisa.gov/news-events/directives/bod-22-01-reducing-significant-risk-known-exploited-vulnerabilities). \r\n\r\n>**What is more important to remediate first – critical and high or known exploited vulnerabilities?**\r\n>Known exploited vulnerabilities should be the top priority for remediation. Based on a study of historical vulnerability data dating back to 2019, less than 4% of all known vulnerabilities have been used by attackers in the wild. Rather than have agencies focus on thousands of vulnerabilities that may never be used in a real-world attack, BOD 22-01 shifts the focus to those vulnerabilities that are active threats.\r\n\r\nThe reality is that time spent fixing a low or a moderate takes away finite resources from something else. In 2024, [there were 40,300 CVEs ](https://www.cvedetails.com/cvss-score-charts.php?fromform=1&vendor_id=&product_id=&startdate=2024-01-01&enddate=2024-12-31) and yet, by the same source, there were [11 KEVs at the Moderate](https://www.cvedetails.com/vulnerability-list/year-2024/vulnerabilities.html?page=6&order=3&isInCISAKEV=1) and zero at the Low level. That's an exploit rate of 0.0027%.\r\n\r\nMany software vendors also don't report low or moderate CVEs (they classify them as bugs) or they simply defer the fixes until the next scheduled software release. This causes POAMs to look unwieldy while providing no tangible benefit to security reporting and even less benefit to security posture. \r\n\r\n**The question to the CWG is**: should we be focused on doing work to solve non-existent problems? Or is it time to modernize the approach to vulnerability management? ",
  "author": "jblaher",
  "created_at": "2025-04-02T21:11:19Z",
  "comments": [
    {
      "id": "DC_kwDOOK0ax84AwkAJ",
      "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/19#discussioncomment-12730377",
      "body": "Josh,\r\nMy two cents on the matter would be on modernizing the approach as we struggle with the same issues as ConMon takes up a substantial number of monthly hours as well as POAM updating (which we are in process of automating ingestion from our scanning sources into the FedRAMP template and then updating accordingly which will still be the manual part of the process as certain fields require input that cannot be automated.\r\nWe do focus on Critical and High vulnerabilities based on severity scoring and exploitability but when you have a large number of vendor applications deployed across servers and containers it become a real effort to get vendors to acknowledge their requirements to regularly patch their software according to federal timeframes (don’t get me started on “golang” GO language library vulns as they are becoming the source of many vulnerabilities that vendors ignore as unused libraries and thus “we aren’t vulnerable”.\r\nContainerized applications are becoming more and more prevalent and represent the biggest time sink that we have.\r\nAnd finally, as far as I know, there is no single authorized threat source database however to me this would be NVD.  There are others that our container scanner reports on however their reliability is generally supportive of NVD findings with the exception of one source that is notoriously misclassifying findings severity or is finding vulnerabilities that cannot be correlated with more accurate sources.\r\n",
      "author": "ronkara",
      "created_at": "2025-04-04T20:41:23Z",
      "replies": [
        {
          "id": "DC_kwDOOK0ax84AwpsR",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/19#discussioncomment-12753681",
          "body": "100% agree @ronkara  - the milestone updating can be very laborious, and when we implemented automation, we got complaints that it was too formulaic, that they really wanted us to do them by hand which is just not practical at scale.\r\n\r\nOn your second point about the vendor dependencies, theoretically we can tag those as Vendor Dependencies, but it's also laborious. NVD and our vuln scan software both say that a CVE has a patch available, so it's researching each container image to find those nuances of \"we aren't vulnerable so aren't going to patch\" and log them.",
          "author": "mjprager",
          "created_at": "2025-04-07T16:28:41Z"
        },
        {
          "id": "DC_kwDOOK0ax84AxAQb",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/19#discussioncomment-12846107",
          "body": "\r\n\r\n> It would be nice if FedRAMP (or CSPs together) could create a public resource on the CVEs that fill the bill above - where a commercial product relies on open source libraries that have not patched the CVE for a while and likely will not. \r\n\r\nThis may be something the community picks up sooner than later, given today's [news from MITRE. ](https://www.reddit.com/r/cybersecurity/comments/1jzy815/mitre_support_for_the_cve_program_is_due_to/) Ultimately, I'm still of the belief that smarter vuln management is required, however it materializes. \r\n",
          "author": "jblaher",
          "created_at": "2025-04-15T19:21:25Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOK0ax84Aw26U",
      "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/19#discussioncomment-12807828",
      "body": "> We do focus on Critical and High vulnerabilities based on severity scoring and exploitability but when you have a large number of vendor applications deployed across servers and containers it become a real effort to get vendors to acknowledge their requirements to regularly patch their software according to federal timeframes (don’t get me started on “golang” GO language library vulns as they are becoming the source of many vulnerabilities that vendors ignore as unused libraries and thus “we aren’t vulnerable”.\r\n\r\nI agree wholeheartedly. I think my sentiment is that if we remove the requirement to patch non-exploited lows and moderates, then the effort of tracking down a vendor dependency can be reduced to nearly zero. One could event argue that the need to include Lows & Mods on a POAM would be moot. \r\n\r\nI'll agree that the NVD as an authoritative voice is only going to continue to weaken, given the persistent backlog and [recent move ](https://www.securityweek.com/nist-puts-pre-2018-cves-on-back-burner-as-it-works-to-clear-backlog/)to \"Defer\" a number of \"older\" CVES. I'll also add that since the Linux kernel became a CNA last year, there was a huge spike in CVEs, most at Lows or Moderates. Unless a CSP is compiling upstream linux, these CVEs aren't likely to exist in a downstream product (i.e. RHEL, Ubuntu, etc.) which means CSPs need to deal (administratively) with CVEs that will not impact them. \r\n\r\nBut mostly, I want to focus on figuring out the happy medium between security reporting and security resourcing when it comes to patching otherwise, we're all going to drown as code starts writing code. ",
      "author": "jblaher",
      "created_at": "2025-04-11T19:11:36Z",
      "replies": [
        {
          "id": "DC_kwDOOK0ax84AxGiQ",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/19#discussioncomment-12871824",
          "body": "I think we would agree that our intention is to always patch to the most current versions, but from a reporting standpoint that that if we focus on Criticals and Highs and then Mediums which are exploitable this would give us a more manageable number of POAMs to track and report. An inefficient use of my time is to track 100 Low POAMs that may or may not ever be remediated by the vendors.",
          "author": "ronkara",
          "created_at": "2025-04-17T21:04:42Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOK0ax84AyuSZ",
      "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/19#discussioncomment-13296793",
      "body": "Totally agreed. CSPs should be able to create risk-based approaches to their FedRAMP Vulnerability Management Program - rescoring vulnerabilities based on business context and agreeing with your authorizing officials on what your prioritization formula looks like and what SLAs make sense.\r\n\r\nFor example, dropping the SLAs for Moderate and Lows to the enterprise vuln management SLA, while high findings have SLA of 30 days, and critical may even have a shorter SLA to around 2 weeks. \r\n\r\nCVSS scores are always effective to utilize as a starting point, but additional business context is absolutely necessary to accurately rescore and prioritize remediation efforts. When you're dealing with limited resources, you need to be smart about where you're focusing your time. Of course, this can only theoretically work if your authorizing officials are in agreement - without that buy-in, you're still stuck with the old ways on doing conmon. \r\n",
      "author": "GurkhaShieldForce",
      "created_at": "2025-05-28T12:31:20Z",
      "replies": []
    }
  ]
}