{
  "id": "D_kwDOOK0ax84AfSPx",
  "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26",
  "title": "Updates to Significant Change Request Process",
  "body": "This is a dedicated discussion about topics related to the development of a new standard for Significant Change Requests. We welcome feedback on changes to the current SCR process, lessons learned within your Agency or CSO, or best practices that may support a new standard. ",
  "author": "ryan-hodges-gsa",
  "created_at": "2025-04-14T14:30:04Z",
  "comments": [
    {
      "id": "DC_kwDOOK0ax84Aw9FX",
      "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12833111",
      "body": "As someone who has spent over 14 years in government, transitioned to a large CSP, and now consults for a small CSP struggling to secure enough funding to achieve FedRAMP compliance, my thoughts are as follows:\r\n\r\nThe SCR process traditionally have been a MAJOR blocker to CSP's both small and large who are looking to bring their products/innovation to market for several reasons:\r\n\r\n1. **Complexity and Rigor:** The SCR process involves a thorough and detailed review of a CSP's security controls. This can be complex and time-consuming, requiring significant effort to ensure all controls meet FedRAMP's stringent requirements.\r\n2. **Time-Consuming:** The process can take a considerable amount of time, from preparing the necessary documentation to undergoing the review and addressing any findings. This can delay the time-to-market for CSPs.\r\n3. **Resource Intensive:** CSPs often need to allocate substantial resources, including personnel and financial investment, to navigate the SCR process. This can be particularly challenging for smaller companies with limited resources.\r\n4. **Documentation Requirements**: The amount of documentation required for the SCR process is extensive. CSPs must provide detailed descriptions of their security controls, policies, and procedures, which can be a significant administrative burden.\r\n5. **Continuous Monitoring**: Even after initial authorization, CSPs must engage in continuous monitoring and periodic re-assessments to maintain their FedRAMP status. This ongoing requirement can be resource-intensive and add to the overall burden.\r\n6. **Cost:** The cost of significant changes is too burdensome for CSPs, especially smaller ones, when introducing multiple changes. Smaller CSPs often cannot wait for the annual assessment to implement changes, as they face pressure to deliver functionality immediately to the government through out-of-cycle changes.\r\n\r\n**Recommendations:** \r\n\r\n1. **Remove 3PAO** from the entire SCR Process and delegate review and approvals to agencies\r\n**3PAOs** often include controls that are not relevant to the specific change, leading to additional costs for CSPs.\r\n**On-going** SCR cost for SAP/SCR/SAR/RA-5 testing introduces significant cost to cloud service providers ( Up to 40k-50k per significant change)\r\n**3PAOs** often advise CSPs to submit an SCR for changes that may not require one, highlighting the subjectivity and lack of clarity around what constitutes an SCR.\r\n\r\n1. **Standardized Templates:** Develop standardized SIA/SCR Risk template. This can help CSPs prepare more efficiently and reduce the time to market.  \r\n2. **Risk-Based Documentation**: Implement a risk-based approach to documentation, where the level of detail required is proportional to the risk associated with the control. Lower-risk controls could have simplified documentation requirements. Remove requirements for SAP/SAR\r\n3. **Scanning:** The introduction of new infrastructure or containers should not require additional scanning, as this is already covered under the monthly continuous monitoring requirements.\r\n4. **Continuous Improvement Feedback Loop**: Establish a continuous improvement feedback loop where CSPs and agencies can provide ongoing feedback on the SCR process. Use this feedback to make iterative improvements.\r\n5. **Pilot Programs:** Launch pilot programs to test new approaches to the SCR process, such as reduced documentation requirements or alternative approval pathways. Use the results to inform broader changes.\r\n6. **Enhanced Communication:** Improve communication channels between FedRAMP, CSPs, and agencies to ensure all parties are aware of process changes, best practices, and common pitfalls.\r\n\r\nIn conclusion, removing unnecessary costs and requirements from the SCR process aligns with the current administration's call for eliminating barriers. This approach enables the best commercial solutions to be offered to the government without cumbersome processes.",
      "author": "ProdSecCSP",
      "created_at": "2025-04-14T18:44:48Z",
      "replies": [
        {
          "id": "DC_kwDOOK0ax84Aw_do",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12842856",
          "body": "I don't necessarily disagree with not having every change assessed by a 3PAO (in fact, I tend to like the 'true this up during the annual assessment' approach that HHS often uses, although they are still paperwork heavy with SCR forms AND SAPs done months in advance).  \r\n\r\nThe single biggest barrier, to me, I think, is there is no consistent agency feedback or approval process, and it's documentation heavy.    First you need them to approve the SCR control scoping, then the SAP, usually with 30/60 days advance notice before you can even conduct the SCR assessment.  Obviously, we don't want to prevent agencies from having a say, but we do want to make it easier and more frictionless for this.  (And the comment above about 3PAOs being subjective on control selection is a function of agencies pushing back on selections that are 'too easy'). \r\n\r\n@thequikbrwnfox \r\n> CSPs need to be able to show a rigorous, risk-based approach to compensate for the responsibility shift. A security impact analysis or risk assessment per change would help agencies feel more comfortable.\r\n\r\nI think you're onto something here.  In theory, an SIA should already be done for all changes, but I think if there were a *standardized objective* template for SIAs/change reviews, that might streamline the agency review.    As part of that review, it might even account for control selection.  \r\n\r\nAs a quick pass of an SIA template (we mostly care about the 'no' answers here)\r\n- does this change integrate into existing access control mechanisms?\r\n- does this change integrate into existing logging processes?\r\n- are compliance and vulnerability scans for any components associated with this change being conducted?\r\n- is this change a refinement of existing structures and functionality (e.g. VMs to containers) or a net new structure (adding a new transit subnet)?\r\n- does this change leverage existing cryptographic modules for data in transit and at rest?\r\n- does this change leverage the existing underlying architecture?\r\n- is this change an upgrade/replacement for an existing tool or functionality?  \r\netc.  \r\n\r\nI'm trying to minimize the impact of changes that integrate cleanly into existing processes or infrastructure.  Those are usually the most common SCRs I've seen, and frankly, I haven't seen too many 'failing' SCRs for those sorts of changes.\r\n\r\n\r\n\r\n\r\n \r\n\r\n ",
          "author": "jsantore-cgc",
          "created_at": "2025-04-15T14:11:37Z"
        },
        {
          "id": "DC_kwDOOK0ax84Aw_uM",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12843916",
          "body": "I think there are a few things here that need to be revisited. Removing the 3PAO in theory makes sense at least for the majority of what is currently deemed \"significant\" but I think it's a little bit foolish for us as CSPs to believe that federal agencies are waiting with open arms to take this on themselves. Federal agencies frequently want less responsibility with FedRAMP packages, continuous monitoring requirements, etc. and from our conversations they certainly don't want **more** work, especially now with many of them having to navigate their priorities with reduced staff and budget. \r\n\r\nEmpowering CSPs to continue to innovate and add new functionality and features to their offerings should be the way forward but we as CSPs should also then be willing to provide the necessary test artifacts and details in either a change log or similar documentation to show what's changing and why. Submitting an SCR for every little change or update is exhausting, time consuming, and generally a complete waste of time and effort on both the CSP and auditors. \r\n\r\nI agree with @jsantore-cgc here that consistency is a glaring issue across nearly everything we do in the FedRAMP process, especially in regards to SCRs. There is no one process that is meant to be followed and there is so much subjectivity and interpretation that can happen that we are told to consider everything an SCR and that does nothing but hinder innovation. ",
          "author": "AnievesPANW",
          "created_at": "2025-04-15T15:39:29Z"
        },
        {
          "id": "DC_kwDOOK0ax84Aw_1R",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12844369",
          "body": "> 1. e SCR process involves a thorough and detailed review of a CSP's security control\r\n\r\nSo we ought NOT do detailed and thorough reviews of security controls? We do this monthly always - regardless of SCRs.  How do you know if a control is working if you don't do a periodic and thorough review. If your risk tolerance allows for a control to be in error or non-functional for possibly 1 year until the next annual (or 2 if the annual selection doesn't pick that control) then I guess that's fine - maybe for Lows that is fine by definition.  For Moderate or High - the goal is to defend against the bad guys and sleep at night. For us and the Agency AOs they want to know more or less continuously that the controls are working as defined and bit rot doesn't set in. Full transparency on bias - I come from a QC and hardware background in addition to kernel and driver software dev - and we just are more paranoid beasts because, crash dumps and BSODs take down airlines, and power plants, and credit card networks, etc.",
          "author": "sunstonesecure-robert",
          "created_at": "2025-04-15T16:23:33Z"
        },
        {
          "id": "DC_kwDOOK0ax84Aw_2x",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12844465",
          "body": "> 2\\. delay the time-to-market for CSPs\r\n\r\nand...delay time-to-breach for bad guys, which to an AO is probably more important than time-to-market for new features. At least for moderate and High.  Maybe for Low, this does make sense by definition.  ",
          "author": "sunstonesecure-robert",
          "created_at": "2025-04-15T16:31:38Z"
        },
        {
          "id": "DC_kwDOOK0ax84Aw_3K",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12844490",
          "body": "> * This can be particularly challenging for smaller companies with limited resources.\r\n\r\nI would love to hear your specifics.  I manage 5 Moderate ATOs including all Con Mon and 1 High. Java, Scala, Ruby, Go, Python and .NET. 1 person.  Azure and AWS and hybrid.  So if there's something that is taking your team more than 1 FTE of effort to manage for a single ATO, let's discuss in detail and break down where the bottlenecks are.",
          "author": "sunstonesecure-robert",
          "created_at": "2025-04-15T16:33:28Z"
        },
        {
          "id": "DC_kwDOOK0ax84Aw_3-",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12844542",
          "body": "> 5\\. continuous monitoring\r\n\r\nMaybe pre-ATO companies don't realize that once you are on the marketplace you become a higher value target for the bad guys. You have a target painted on you as we all know (see news even today) breaches almost always go through the supply chain weakest links and small companies.  From first hand experience your attacks will go up at minimum 10X.  So if you don't have the resources and finances to prepare for that reality, you need to seriously consider the impact to your operations.\r\n\r\nEven with all 420+ controls in place you WILL have incidents (insider and out).  So continuous \"vigilance\" - regardless of the artifacts and paperwork - is essential.  ",
          "author": "sunstonesecure-robert",
          "created_at": "2025-04-15T16:37:02Z"
        },
        {
          "id": "DC_kwDOOK0ax84Aw_5D",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12844611",
          "body": "> 6\\. face pressure to deliver functionality immediately to the government through out-of-cycle changes.\r\n\r\n2 things. Apart from security patches - which I agree should be automatic approvals by any sane logic - this has not been my experience across multiple agencies over decades.  (Unless...we are talking about fixing bugs that should have been fixed pre-contract. I was a vendor - I know how we overpromise and under deliver due to VC and board pressure. I get it, I do. But that's not a good argument for loosening the controls.) \r\n\r\nMostly agencies take MONTHS to decide what they want, who can approve, and when to upgrade/deploy - for the simplest of things. So good account management and customer engagement should give you at least a 3-6 month crystal ball on what they need and when. Unless your cycles are >1 year. Maybe for some IC stuff, admittedly that does make sense.  \r\n\r\nSecond - pressure != good reason to toss out controls or relax security.  Queen song comes to mind.  We also have pressure from the bad guys to keep data secure (not to mention insiders.)  High performers perform best under pressure in my experience, actually better under pressure.",
          "author": "sunstonesecure-robert",
          "created_at": "2025-04-15T16:43:20Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOK0ax84Aw_j1",
      "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12843253",
      "body": "I am very on board with ideas around detailing some very minor / negligible changes which could occur without triggering a full SCR (with SAP, SAR, etc). Ideally, a Security Impact Analysis for those items would be completed and submitted for 3PAO/Agency review and then the assessment itself would just happen at the next Annual.\r\n\r\nHowever, specific to scanning as it has been mentioned a few times already:\r\n\r\n1) Scanning SHOULD be required for new asset types even though it is covered by ConMon. The goal of the SCR should be to detail for AOs what additional risk is being added to the CSO to accomplish the change. An SCR that involves net new assets (not talking auto-scaled or adding more of an existing asset) should have the vulnerabilities and misconfigurations listed in the RET.\r\n\r\n2) Changes to scanning tools should always be an SCR (as it has been). There should be formalized guidance to the informal practice of operating old scan tool in parallel with new scan tool. The goal should simply be to ensure that the new scan tool is correctly configured to meet breadth/depth expectations AND that the CSP is able to account for all POA&M items from the old tool so that no true positive findings are dropped in the tool exchange.",
      "author": "Bscudera9",
      "created_at": "2025-04-15T14:43:21Z",
      "replies": [
        {
          "id": "DC_kwDOOK0ax84Aw_w6",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12844090",
          "body": "I think reducing the amount of changes that require a full-blown assessment and all deliverables associated with it is certainly the way to go. If there isn't a PMO-published method of how to tackle this across the board then this likely needs to be a decision or agreement made between a CSP and their 3PAO. Different CSPs and 3PAOs across the industry will see these things differently and ultimately would need to align on expectations upfront for this to work but I believe this is the way forward. We don't completely remove the requirement of another pair of eyes on these changes but it's also not a barrier to implementation. \r\n\r\n1. Scanning is and always should be required for anything in production. I think we need to be a bit specific about the term \"net new\" assets as well though and you mention the RET, which means some level of audit was required for this. I think depending on the specifics of these new assets that even an SIA and scan data could be sufficient here. Unless I'm misunderstanding what you're saying with mentioning the RET, I feel as though even adding net new assets that it could be rolled into continuous monitoring as well. \r\n2. I agree there is a need for a formalized process with guidance about how this should be handled because historically we've been told by 3PAOs that \"you should have X amount of scans and run them in parallel for Y amount of months\" but I don't recall seeing any of this specifically documented by FedRAMP. It's almost just been an understanding across the industry of how to approach this. I think that even the change of a scanning tool could be removed from the full SCR process based on your second point. \r\n\r\nLet me explain. If a CSP is going from one VM scanner to another, is a full SCR necessary? I could completely understand a minor engagement taking place specifically around how you are still meeting the required controls as you switch tools, but if a CSP can stand up another scanner, show that it's scanning the same inventory and returning similar results, shouldn't that be sufficient? I say similar because no two scanners are the same and they function differently. The security and compliance boundary isn't changing, no other changes are being made to the authorization boundary, why would the changing of the SaaS being used to get you those vulnerability numbers require a 6+ month process of review/approval by a 3PAO, Agency and/or the PMO to determine if you can change that? \r\n\r\nI'll go a bit further since this specific example is close to home. We've literally had to renew licenses with one tool that we wanted to move away from in favor for another because of the SCR requirements. This cost us money, resources, and wasted time invested moving toward another tool because it didn't fit in with the current FedRAMP process. ",
          "author": "AnievesPANW",
          "created_at": "2025-04-15T15:55:34Z"
        },
        {
          "id": "DC_kwDOOK0ax84Aw_zg",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12844256",
          "body": "@AnievesPANW \r\nThere are a few things going on here:\r\n1) the SCR associated with changing the tool, and since the scan tool is such a big part of the security posture, it de facto hits a bunch of the RA-5 controls and enhancements.  Although I tend to agree that swapping tools in and of itself shouldn't necessarily be an SCR, historically it has been.\r\n2) The run scans in parallel was less of an SCR thing and more of a 'make sure you've reconciled all scan findings.'  If tool X had findings {a,b,c,d,e} and tool Y had findings {a,b,c,f,g} you can reconcile the a,b,c ones, but either you have to show that d,e are the same as f,g, and so you're reconciled, or else d,e are remediated and there are no net new differences between the tools.  Or to your point:\r\n> ...show that it's scanning the same inventory and returning similar results, shouldn't that be sufficient?\r\n\r\nThis is the crux of it.  The multiple parallel scans are ensuring the similar results (i.e. reconciliation).  \r\n\r\n\r\n\r\n",
          "author": "jsantore-cgc",
          "created_at": "2025-04-15T16:13:31Z"
        },
        {
          "id": "DC_kwDOOK0ax84Aw_2U",
          "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12844436",
          "body": "> This is the crux of it. The multiple parallel scans are ensuring the similar results (i.e. reconciliation).\r\n\r\nwell almost, just today for example we had a CSP find out that their tool despite 3 Moderate audits - doesn't actually have FIPS crypto support. So...the scans look great and would compare favorably against other tools, but no FIPS. Similarly we often see peripheral things neglected - is it using SSO? Are the audit logs available and ingested into the SIEM? Do we have least privs on the tool? Are the configs in git? Are the update sources in boundary and approved or default to the internet? etc etc\r\n\r\nSo there's a lot more than just scan parity in this particular example, and so while there could be a control (part) by control (part) decision tree for when something needs AO approval or not, I just advocate doing the full and thorough SIA and BIA on all changes and let the AO decide.  \r\n\r\nAny rational OS and lib security patch or version update SIA and BIA would almost certainly qualify as Low risk (high reward) and I can't see AOs ever blocking those. Perhaps require an SLA (as for CSPs) and the AO has x days to approve or else if the SIA and BIA are available, auto-approve otherwise (at least for Low, Moderate).",
          "author": "sunstonesecure-robert",
          "created_at": "2025-04-15T16:29:47Z"
        }
      ]
    },
    {
      "id": "DC_kwDOOK0ax84AxBUY",
      "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12850456",
      "body": "Picking up on a couple of excellent points made above.\r\n\r\nWe agree with @thequikbrwnfox  on the use of 3PAOS. Removing 3PAO from the entire SCR process and delegating review and approvals to agencies is not necessarily going to result in better outcomes for CSPs because it does not take account of the ongoing cost or administrative burden of ConMon, and assumes agencies are in a position to actually take on this responsibility, which as of now isn't necessarily true. Whatever the role of 3PAOs moving forwards, it is vital to retain a baseline where CSPs can show how they meet the standard.\r\n\r\nAnother excellent point raised by @jsantore-cgc is The single biggest barrier is there is no consistent agency feedback or approval process, and it's documentation heavy. This is a huge challenge for so many of our members who are having to negotiate multiple agencies and processes. There has to be some degree of reciprocity!",
      "author": "CSB-AB",
      "created_at": "2025-04-16T06:23:31Z",
      "replies": []
    },
    {
      "id": "DC_kwDOOK0ax84AxWvo",
      "url": "https://github.com/FedRAMP/rev5-continuous-monitoring-cwg/discussions/26#discussioncomment-12938216",
      "body": "Today, FedRAMP released the draft “FedRAMP Significant Change Notification Standard” as part of our formal Request for Comment.  This document creates a new Significant Change Notification standard that replaces all previous FedRAMP guidance related to Significant Change Requests for all FedRAMP authorizations and certifications.  \r\n\r\nYou can find the draft standard https://www.fedramp.gov/rfcs/0007/\r\n\r\nThis is a departure from the current SCR process and you will see some key themes from this forum emerge in the new standard, so thank you for the feedback you have provided to date.\r\n\r\nWhile we will not be closing this discussion, we will no longer be able to take into account any feedback provided here after this publishing.  The correct venue for formal feedback is the RFC process itself.  \r\n\r\nWe have started another topic on implementation and would like to hear your thoughts on how your internal processes will need to adjust with this standard.\r\n",
      "author": "paulagosta",
      "created_at": "2025-04-24T17:21:04Z",
      "replies": []
    }
  ]
}